{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Associate Degree of Advanced Manufacturing prepares students with a technical background or aptitude to excel in highly digitised and automated modern manufacturing industries. Managers and specialists need a blend of skills from across traditional fields to develop innovative and competitive manufacturing solutions. Advanced manufacturing sits at the nexus of automation, statistical learning, and the internet of things applied in production systems. Advanced manufacturing brings real-time data, automation, data analytics and intelligence to operations.\n\nThis course covers methods, skills, and tools used in advanced manufacturing and cyber-physical production systems. Students develop a blended skillset of physics, mathematics, data analysis, creativity and critical thinking. Topics in this course include industrial data science, manufacturing, industrial engineering, automation, product life cycle management, additive manufacturing, Internet of Things, collaborative robotics, sensors, and artificial intelligence. Students use modern tools and problem-solving techniques to tackle real-world challenges. Students explore complex system analysis and problem solving through case studies derived from the UTS Centre for Advanced Manufacturing and industry partners. A central component of the program is the teaching of scientific methods for solving complex, socio-technical problems. To this end, students learn to develop socially, environmentally, economically, and technically sound solutions in real-world contexts. Industry relevant and globally translatable skills are used to promote job-readiness and employability in fields ranging from manufacturing, aerospace, and mining to food production, medical, retail and construction.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "None",
  "course_structure": "Students are required to complete 96 credit points, comprising 36 credit points of core subjects and 60 credit points from subjects in the Advanced Manufacturing stream.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c22100.html",
    "crawled_at": "2025-11-10T19:20:00.825050",
    "csv_source": "merged_Admission_Courses.csv"
  }
}