{
  "course_code": "C09100",
  "course_name": "Bachelor of Forensic Science (Honours)",
  "credit_points": null,
  "cricos_code": "092385E",
  "overview": "As the first forensic science degree in Australia, the world-class UTS Bachelor of Forensic Science is recognised for producing future leaders in this compelling field of practice. More than just a theoretical science degree, this course delivers a comprehensive learning experience at the intersection of STEM, information technology, law, criminology and social impact.\n\nThe honours degree contains an additional year of study on top of the standard Bachelor of Forensic Science curriculum. This year is dedicated to the acquisition of high-level research skills under the guidance of leading academics and industry practitioners from the acclaimed UTS Centre for Forensic Science.\n\nWhy UTS Science? UTS Science, one of Australia’s leading university science faculties, is committed to scientific advancement that creates a more sustainable world. When students study with UTS, they join a university that delivers global impact in STEM education and research and a faculty that produces scientists with the power to transform the profession.\n\nCourse features Students complete a year-long forensic science research project in a UTS lab or with one of many industry partners, engaging and collaborating on a real-world project that offers value to the profession. Insights from our industry partners indicate high demand for graduates with more than just fundamental forensic science skills — as well as developing hands-on research experience and producing a formal thesis, honours students gain a range of professional capabilities (critical thinking, collaboration, autonomous practice) that prepare them to meet this workforce demand.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "2",
  "course_fee": "23220",
  "course_intake": "Feb/ Jul",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "Graduates from this course are eligible to become members of the Royal Australian Chemical Institute and the Australian and New Zealand Forensic Science Society.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nThe honours program is normally open to students who have attained at least a credit average over the final two-thirds of the undergraduate program.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Graduates will prepare to make their mark in the world of criminal justice and security by adding high-level research and professional skills to their core forensic science skill sets. Depending on their thesis topic and choice of major in their first three years of study, they can prepare for roles in state and federal policing and criminal justice, government and scientific research organisations (ASIO, CSIRO, ANSTO, customs and immigration), intelligence agencies, or in a wealth of commercial settings where forensic science expertise is highly valued by industry (banking, insurance, consulting, accounting, forensic and cybersecurity organisations).",
  "course_structure": "The course comprises 48 credit points of study, consisting of two academic stages. The major component of the course (75 per cent) is a research project that extends over the full duration of the course and normally takes the form of an experimental investigation. The project is undertaken within one of the research groups at UTS in an area of forensic science. Projects may also be undertaken in collaboration with an external partner. Projects are chosen by the student, although first preferences cannot always be accommodated. As part of the project, students undertake a critical review of the existing literature in their research area and develop a research plan for the year. The results of the project are presented in an oral seminar and in a written thesis, both of which are formally assessed. The remaining 25 per cent is the coursework component, in which students complete two professional development subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09100.html",
    "crawled_at": "2025-11-10T13:36:39.822157",
    "csv_source": "merged_Admission_Courses.csv"
  }
}