{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "099116C",
  "overview": "The Bachelor of Entrepreneurship (Honours) is a one-year, full-time course that provides students with an undergraduate qualification in entrepreneurship. The course is open to graduates from all disciplines and is designed to help motivated students develop their own entrepreneurial proposal.\n\nThe degree is aimed at a diverse cohort of students with a desire to develop (or continue to develop) an entrepreneurial project or start-up venture. Students of all disciplines graduating with undergraduate degrees at UTS, other Australian universities or international institutions can apply.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "2*",
  "course_fee": "22460",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nApplicants also require:\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Career options include working in the student's own or other founder's start-ups and scale-ups applying advanced entrepreneurship skills and knowledge in commercial and not-for-profit settings or working as an entrepreneur or intrapreneur where entrepreneurial business knowledge helps to ensure success in the commercialisation of innovations. The course provides training for early-stage start-up management roles.",
  "course_structure": "The course totals 48 credit points of study, comprising three 8-credit-point core subjects (24 credit points) and two project subjects (24 credit points). Students have regular meetings with their academic supervisor and mentors throughout the year.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09101.html",
    "crawled_at": "2025-11-10T13:32:07.521466",
    "csv_source": "merged_Admission_Courses.csv"
  }
}