{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "015933J",
  "overview": "The Bachelor of Business (Honours) provides an opportunity for advanced study in the disciplinary areas of accounting, finance and economics, management or marketing.\n\nThe course provides the ideal foundation for students who plan to pursue a career in applied research in business and related professions, or who plan to undertake master's or doctoral research studies.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "2",
  "course_fee": "22460",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nApplicants must have completed the UTS Bachelor of Business, or an equivalent degree, with an overall credit average and an average mark of 70 (or equivalent for non-UTS students) in the discipline area in which the honours degree is to be awarded.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Career options include accounting, economics, finance, financial services, human resource management, international business, management, marketing, marketing communication, and government advisory positions.",
  "course_structure": "The Bachelor of Business (Honours) comprises 48 credit points of study.\n\nStudents may undertake one of the following five streams.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09004.html",
    "crawled_at": "2025-11-10T13:32:00.357705",
    "csv_source": "merged_Admission_Courses.csv"
  }
}