{
  "course_code": "C10301",
  "course_name": "Bachelor of Sport and Exercise Management",
  "credit_points": "144 Credit points",
  "cricos_code": "080086D",
  "overview": "This course develops graduates who possess a sound knowledge of the biophysical, behavioural and sociocultural foundations of sport and exercise, combined with the management skills and knowledge increasingly necessary in sport and exercise professions.\n\nThis course contains a blend of sport and exercise subjects and business subjects. As the sport and exercise industry has undergone a period of substantial growth, the need for sport and exercise professionals with management skills and qualifications has become increasingly important. Graduates are equipped with the professional knowledge and skills to operate in one of Australia's most dynamic industries. Students who complete this course with the required electives and grade point average also meet current entry criteria for the UTS Master of Physiotherapy (C04306).",
  "awards": [
    "Bachelor of Sport and Exercise Management (BSportExM)"
  ],
  "faculty": [
    "Health"
  ],
  "study_level": "Undergraduate",
  "location": [
    "Moore Park Precinct"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "6",
  "course_fee": "19060",
  "course_intake": "Feb",
  "uac_codes": [
    "606030",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Engage in the process of personal and professional development through inquiry, critical thinking, and reflective practice. "
    },
    {
      "number": 2,
      "text": "Apply knowledge and skills to solve real-world problems in sport, exercise, and health, guided by evidence-informed practice. "
    },
    {
      "number": 3,
      "text": "Communicate, collaborate and lead in the fields of sport, exercise, and health to optimise client outcomes. "
    },
    {
      "number": 4,
      "text": "Demonstrate socially responsible, legal, and ethical behaviour in the field of sport, exercise, and health. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/4abaefefc3beee50020e061ad001316e"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 70; Admission requirements for Chinese students (Gaokao score out of 750): 455; Admission requirements for students with GCE A Levels: 7; Admission requirements for Hong Kong students (HKDSE): 14; Admission requirements for Indian students (AISSC): 9; Admission requirements for Indian students (ISC): 76; Admission requirements for students with IB or Predicted IB: 24/29 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 5; Admission requirements for Singaporean students (A Level): 7; Admission requirements for USA students (SAT 1): 1090; Admission requirements for UTS Foundation Studies students: 6.2",
  "career_options": "Career options include athlete management, corporate health and fitness, fitness consultant, health promotion, sport development manager, sport event manager, sport marketing, sport policy, sport scientist, sport venue manager and physiotherapy (pathway).",
  "course_structure": "Students must complete 144 credit points comprising 24 subjects, made up of 20 core subjects and four elective subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10301.html",
    "crawled_at": "2025-11-10T04:26:51.032726",
    "csv_source": "merged_Admission_Courses.csv"
  }
}