{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "098041C",
  "overview": "This course provides the opportunity for eligible graduates of the Bachelor of Health Science (C10360) to extend their skills and understanding of the research process. It emphasises the reciprocal relationship between health research and the contexts of local and global health.\n\nThis course provides Bachelor of Health Science graduates with the opportunity to develop skills in clinically focused research. The course deepens students' understanding of the importance of research in health.\n\nThe course places health science research within the professional, philosophical, historical, social, cultural and political contexts of health. The honours program is regarded as a research apprenticeship and requires an extensive commitment from students. It is an opportunity to produce a substantial piece of work, conduct research and/or explore research data in an area of interest at much more depth and more independently than has been possible in previous undergraduate studies.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "2",
  "course_fee": "19060",
  "course_intake": "Feb/ Jul",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Career options include positions in health promotion, advocacy, health education, e-health, health data and information management systems, planning and policy, project management and evaluation, community development, research and consultancy across both public and private health sectors, physiotherapy (pathway) and pharmacy (pathway).",
  "course_structure": "The course comprises 48 credit points, made up of two dissertation subjects (totalling 36 credit points) and one research methodology subject (12 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09049.html",
    "crawled_at": "2025-11-10T13:35:19.041402",
    "csv_source": "merged_Admission_Courses.csv"
  }
}