{
  "course_code": "C10169",
  "course_name": "Bachelor of Molecular Biotechnology Bachelor of Business",
  "credit_points": "192 Credit points",
  "cricos_code": "041436K",
  "overview": "The Bachelor of Molecular Biotechnology Bachelor of Business is designed to produce graduates who are prepared for scientific practice in the biotechnology industry or who are equipped for entry into business and management in science-based businesses or institutions.\n\nStudents study the biological processes of living organisms and learn the skills required to manipulate processes in the development of new pharmaceuticals, vaccines, food or organic substances. This combined degree allows students to choose between a career in business or biotechnological science.",
  "awards": [
    "Bachelor of Molecular Biotechnology (BMolBiotech) Bachelor of Business (BBus)"
  ],
  "faculty": [
    "Science",
    "Business"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8**",
  "course_fee": "23220",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609176",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Depending on disciplines chosen, students may be eligible for entry to the relevant professional associations. Refer to the Bachelor of Business (C10026) for details on professional recognition of that award.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Explain how current and emerging molecular biotechnologies can be used to pioneer better health care or help solve or otherwise address environmental issues, and to evaluate and integrate economic and scientific strategies that influence the translation of new biotechnology products to the marketplace. "
    },
    {
      "number": 2,
      "text": "Critically evaluate information from sources such as databases and published literature to identify novel research ideas and apply strategic and creative reasoning to find solutions or articulate issues related to biotechnology. "
    },
    {
      "number": 3,
      "text": "Articulate the role and place of bio-business in the economy, with due consideration of global risk perceptions and the legal and regulatory requirements in biotechnology. "
    },
    {
      "number": 4,
      "text": "Demonstrate a confident independence to identify problems or unmet needs and act to find innovative and creative solutions with an understanding of the social, disciplinary, economic, and contextual barriers. "
    },
    {
      "number": 5,
      "text": "Display effective and appropriate professional communication skills (oral, written, visual) in order to pitch ideas, generate defensible, convincing arguments or transmit research findings within a multi-disciplinary setting. "
    },
    {
      "number": 6,
      "text": "Develop knowledge of Indigenous Australian contexts to inform professional cultural capabilities to work effectively with and for, Indigenous Australians within the biotechnology sector. "
    },
    {
      "number": 7,
      "text": "Apply evidence, creativity and critical reasoning to solve business problems "
    },
    {
      "number": 8,
      "text": "Communicate information clearly in a form appropriate for its audience "
    },
    {
      "number": 9,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal "
    },
    {
      "number": 10,
      "text": "Make judgements and business decisions consistent with the principles of social responsibility and inclusion "
    },
    {
      "number": 11,
      "text": "Apply technical and professional skills to operate effectively in business "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Medical Biotechnology, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/424d276b47f22650a31de422036d431f"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 80; Admission requirements for Chinese students (Gaokao score out of 750): 487; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13; Admission requirements for Indian students (ISC): 83; Admission requirements for students with IB or Predicted IB: 28/33 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 10; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1160; Admission requirements for UTS Foundation Studies students: 6.9",
  "career_options": "Graduates are able to tap into both industries and job markets. Examples include biotechnologist or manager in a bioanalytical lab, vaccine manufacturer, analyst, biotechnologist, product developer, and research scientist. Graduates can work in product development in a variety of industries including pharmaceuticals, agriculture, quality control and quarantine, and drug and medicine research.",
  "course_structure": "The course comprises a total of 192 credit points, made up of 96 credit points of biotechnology subjects and 96 credit points of business subjects.\n\nGraduation from the biotechnology component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Molecular Biotechnology prior to completion of the business component of the combined degree must apply for transfer to the Bachelor of Molecular Biotechnology (C10172) single degree program where they must complete all requirements for the stand-alone single degree.\n\nSimilarly, if a student wishes to graduate from the business component of the combined degree prior to completion of the science component they must apply for transfer to the Bachelor of Business (C10026) single degree program where they must complete all requirements for the stand-alone single degree.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10169.html",
    "crawled_at": "2025-11-10T03:26:22.370233",
    "csv_source": "merged_Admission_Courses.csv"
  }
}