{
  "course_code": "C10125",
  "course_name": "Bachelor of Business Bachelor of Laws",
  "credit_points": "240 Credit points",
  "cricos_code": "008756B",
  "overview": "The combined Bachelor of Business Bachelor of Laws equips students with skills in the highly marketable disciplines of business and law. Students build fundamental knowledge of the law and its application in a range of business environments, as well as an understanding of the legal frameworks that support key business disciplines.\n\nSpecialist skills are developed through electives and major choices, such as the Legal Futures and Technology major, which is focused on the emerging tools that are shaping the legal profession.\n\nAs well as gaining the critical, analytical and evaluative skills required for effective legal and business practice, on completion of this course students also meet the academic requirements for admission to practise law in NSW.",
  "awards": [
    "Bachelor of Business (BBus) Bachelor of Laws (LLB)"
  ],
  "faculty": [
    "Law",
    "Business"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "10",
  "course_fee": "22750",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609010",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).\n\nRefer to the Bachelor of Business (C10026) for details on professional recognition of that award.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 6,
      "text": "Apply evidence, creativity and critical reasoning to solve business problems. "
    },
    {
      "number": 7,
      "text": "Communicate information clearly in a form appropriate for its audience. "
    },
    {
      "number": 8,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal. "
    },
    {
      "number": 9,
      "text": "Make judgements and business decisions consistent with the principles of social responsibility and inclusion. "
    },
    {
      "number": 10,
      "text": "Apply technical and professional skills to operate effectively in business. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b0b6e453830c3290fed7d4326daad313"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include legal adviser within a government department; lawyer in corporate and commercial sector, mergers and acquisitions, property and intellectual property; as well as management consultant or professional in the chosen business specialisation (such as an accountant or marketing executive).",
  "course_structure": "The course comprises a total of 240 credit points, allowing students to graduate with the separate degrees of Bachelor of Business and Bachelor of Laws. The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe business component of 96 credit points comprises:\n\nFor a current listing of subjects in each course refer to the study package directory.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10125.html",
    "crawled_at": "2025-11-10T03:20:24.203187",
    "csv_source": "merged_Admission_Courses.csv"
  }
}