{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "Bachelor of Communication (Strategic Communication) Bachelor of International Studies (Honours) is an exit-point for students who have completed the International Honours pathway within the Bachelor of Communication (Strategic Communication) Bachelor of International Studies (C10367).\n\nIn the fourth year of the combined degree, International Honours students spend an academic year studying in the local language at a university in the country of their major and also complete an honours level research project under the supervision of a relevant UTS academic.\n\nEntry to the International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors.\n\nThe knowledge and skills developed in the Bachelor of Communication (Strategic Communication) are designed to produce effective, ethical and qualified communication professionals and are transferable to a range of work environments and. Students produce course work that provides them with an array of material for a portfolio to show potential employers.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "This course has professional recognition from the Public Relations Institute of Australia.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Communication Inherent (Essential) Requirements Statement.\n\nFor course specific information see the Bachelor of International Studies Diploma in Languages Inherent (Essential) Requirements Statement",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include communication strategist, advertising account executive, advertising copywriter, social media strategist, community relations manager, marketing communication specialist, media liaison officer, political media advisor, public relations consultant, publicity officer, and many more.",
  "course_structure": "Bachelor of Communication (Strategic Communication) (144 credit points)\n\nInternational Studies (96 credit points)",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09139.html",
    "crawled_at": "2025-11-10T17:16:26.540622",
    "csv_source": "merged_Admission_Courses.csv"
  }
}