{
  "course_code": "C09088",
  "course_name": "Bachelor of Information Technology Bachelor of Laws (Honours)",
  "credit_points": "240 Credit points",
  "cricos_code": "116598A",
  "overview": "The primary goal of this combined degree is to prepare lawyers with an expert knowledge of IT qualifying them to work as IT professionals in a legal environment.\n\nThe law component of this course provides a thorough grounding in Australian legal practice. The information technology component offers a sound education in all aspects of computing and information technology and allows students to gain a specialisation with an IT major.\n\nHonours relates to the law component only and students must successfully complete both of the research subjects: 76090 Research Methodology and 76040 Research Thesis. Strong research skills are valued highly in contemporary professional practice.\n\nThe information technology component adopts a practice-based approach to IT education and the course content is a mix of theory and practice. As well as gaining strong technical skills in IT, students gain skills in business analysis, problem-solving, teamwork and communication.\n\nStudents have the opportunity to engage in deeper study of the law by studying 76090 Research Methodology and undertaking 76040 Research Thesis. This course can be a pathway to higher degree research programs.",
  "awards": [
    "Bachelor of Information Technology (BIT) Bachelor of Laws (Honours) (LLB(Hons))"
  ],
  "faculty": [
    "LawEngineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).\n\nThe IT component qualifies for professional-level membership of the Australian Computer Society.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and transform an advanced body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to critically analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Formulate appropriate responses to problems and questions in law and execute a piece of legal scholarship, using advanced skills in legal research, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "Generate solutions to complex legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Critically reflect on ethical Indigenous research practices to work with and for Indigenous peoples across the legal and community sectors. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Lawyers with IT skills are in demand. Career opportunities include lawyer or policy adviser in various government departments, in-house legal counsel to an IT or software company, or specialist in areas such as intellectual property, e-commerce and privacy or internet censorship. Alternatively, graduates can work as IT professionals in legal practice, legal publishing or private law firms.",
  "course_structure": "The course comprises a total of 240 credit points, allowing students to graduate with the separate degrees of Bachelor of Information Technology and Bachelor of Laws. The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe IT component of 96 credit points is made up of:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09088.html",
    "crawled_at": "2025-11-10T17:01:34.729137",
    "csv_source": "merged_Admission_Courses.csv"
  }
}