{
  "course_code": "C10278",
  "course_name": "Bachelor of Information Systems Bachelor of Business",
  "credit_points": "192 Credit points",
  "cricos_code": "0100484",
  "overview": "The Bachelor of Information Systems Bachelor of Business (BIS BBus) is a cross-faculty offering, leveraging the strengths of Information Systems and Business. The offering is aimed at meeting the emerging demands of a new generation of technology managers ready to deal with the challenges of complex systems.\n\nStudents study complex systems such as enterprises, their services for different stakeholders (customers/patients/citizens/other organisations and stakeholders), and their internal processes conducted by people (with knowledge, skills and social capital) using data, information and IT-enabled services. The Business component provides students with the knowledge, competencies and values necessary for fulfilling an effective career in business.\n\nBachelor of Information Systems Bachelor of Business (BIS BBus) graduates are highly sought after in meeting the job demands of the increasingly digital world of the future.\n\nBIS BBus graduates work in, and create value from the financial, environmental and social aspects of any type of organisation.\n\nWith future-focussed specialisations including Systems Analytics, Smart Infrastructure and Sustainable Enterprises, BIS/BBus graduates are well positioned to serve Australian local, as well as international job markets.",
  "awards": [
    "Bachelor of Information Systems (BIS) Bachelor of Business (BBus)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "TechnologyBusiness"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8",
  "course_fee": "25200",
  "course_intake": "Feb",
  "uac_codes": [
    "603221",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The Faculty of Engineering and Information Technology is seeking accreditation from the Australian Computer Society.\n\nRefer to the Bachelor of Business (C10026) for details on professional recognition of that award.",
  "learning_outcomes": [
    {
      "number": 7,
      "text": "Apply evidence, creativity and critical reasoning to solve business problems. (BBus) "
    },
    {
      "number": 8,
      "text": "Communicate information clearly in a form appropriate for its audience. (BBus) "
    },
    {
      "number": 9,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal. (BBus) "
    },
    {
      "number": 10,
      "text": "Make judgements and business decisions consistent with the principles of social responsibility and inclusion. (BBus) "
    },
    {
      "number": 11,
      "text": "Apply technical and professional skills to operate effectively in business. (BBus) "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Accounting major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/09cd0a7e47376610413994ed036d43e0"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Advertising and Marketing Communications major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/19a3a67a47b76610413994ed036d4381"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Business Analytics major Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/31dd024747f7a610413994ed036d437c"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Economics major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/3c99028f47b7a610413994ed036d4318"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Finance major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/552ad287473ba610413994ed036d434b"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Human Resource Management major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/6b41ee3647b76610413994ed036d43e8"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - International Business major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/c980dec747f7a610413994ed036d43e6"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Management major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/eaf5de8f47f7a610413994ed036d43af"
    },
    {
      "name": "Bachelor of Information Systems, Bachelor of Business - Marketing major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/13d2ee43477ba610413994ed036d43e6"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nCurrent school leavers are advised to complete the Year 12 Engineering and IT Questionnaire. The questionnaire allows applicants to demonstrate their strong motivation to study engineering or IT at UTS and may assist applicants whose ATAR falls short of the required cut-off by up to three points.\n\nNon-current school leavers are advised to complete the employment question on their UAC application, as adjustment factors may be applied on the basis of relevant work experience.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 80; Admission requirements for Chinese students (Gaokao score out of 750): 487; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13; Admission requirements for Indian students (ISC): 83; Admission requirements for students with IB or Predicted IB: 28/33 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 10; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1160; Admission requirements for UTS Foundation Studies students: 6.9",
  "career_options": "Students pursue a career in a range of sectors such as energy, transport, smart cities, business, and government. Career options include in roles such as Business Analyst, Business Process Modeller, Smart Infrastructure Professional, Supply Chain Modeller, Digital Transformation Analyst, and Information Systems Analyst/Designer.",
  "course_structure": "Students are required to complete 192 credit points, comprising 96 credit points in business and 96 credit points in information systems. The business component consists of core (48 credit points) and a business major (48 credit points). The information systems component consists of core (72 credit points) and stream choice (24 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10278.html",
    "crawled_at": "2025-11-10T03:17:49.903554",
    "csv_source": "merged_Admission_Courses.csv"
  }
}