{
  "course_code": "C09133",
  "course_name": "Bachelor of Business Bachelor of International Studies (Honours)",
  "credit_points": "240 Credit points",
  "cricos_code": "106918F",
  "overview": "Bachelor of Business Bachelor of International Studies (Honours) is an exit-point for students who have completed the International Honours pathway within the Bachelor of Business Bachelor of International Studies (C10020).\n\nIn the fourth year of the combined degree, International Honours students spend an academic year studying in the local language at a university in the country of their major and also complete an honours level research project under the supervision of a relevant UTS academic.\n\nEntry to the International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors.\n\nThis course gives students a business degree with an international edge and the communication and interpersonal skills required for a career overseas or in a multinational organisation.",
  "awards": [
    "Bachelor of Business (BBus) Bachelor of International Studies (Honours) (BIntSt(Hons))"
  ],
  "faculty": [
    "BusinessArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply evidence, creativity and critical reasoning to solve business problems "
    },
    {
      "number": 2,
      "text": "Communicate information clearly in a form appropriate for its audience "
    },
    {
      "number": 3,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal "
    },
    {
      "number": 4,
      "text": "Make judgements and business decisions consistent with the principles of social responsibility and inclusion "
    },
    {
      "number": 5,
      "text": "Apply technical and professional skills to operate effectively in business "
    },
    {
      "number": 6,
      "text": "Acquire and apply knowledge and skills relevant to working with and for Indigenous peoples in a specific professional business context "
    },
    {
      "number": 7,
      "text": "Understand and engage with cultural diversities and employ effective strategies to operate within varied professional and everyday settings in Australia and internationally "
    },
    {
      "number": 8,
      "text": "Apply research methods and advanced theoretical knowledge to evaluate findings of complex problems in contemporary societies and cultures and conduct an independent research project "
    },
    {
      "number": 9,
      "text": "Communicate effectively and appropriately in an additional language for everyday and professional purposes "
    },
    {
      "number": 10,
      "text": "Engage critically with current issues to act in socially responsible ways in Australian and international settings "
    },
    {
      "number": 11,
      "text": "Communicate clearly and effectively in written and spoken language using diverse digital technologies "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of International Studies Diploma in Languages Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in any branch of business or commerce as well as management of private and public sector enterprises ranging from start-ups to large multinational enterprises. Career options are enhanced by international experience, making students more marketable to prospective employers.",
  "course_structure": "International Studies (96 credit points)",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09133.html",
    "crawled_at": "2025-11-10T17:15:41.654368",
    "csv_source": "merged_Admission_Courses.csv"
  }
}