{
  "course_code": "C10383",
  "course_name": "Bachelor of Communication in Social and Political Sciences Bachelor of Laws",
  "credit_points": "240 Credit points",
  "cricos_code": "087789E",
  "overview": "This degree combines expertise in social and political sciences with fundamental knowledge of the law. Students study sociology, social policy, politics, public history and international studies in the context of legal and social science practice. They simultaneously engage with an exploration of the law that meets the academic requirements for admission to practise in NSW.\n\nBy combining professional studies, hands-on research, internships and fieldwork in two discrete disciplines, this combined degree equips students to consider the role of the law as a tool for social and political change.\n\nElective choices include cross-discipline studies in history, communication, media and country studies; specialist legal subjects; and the Legal Futures and Technology major, which provides first-hand experience of the technologies shaping the future of the legal profession.\n\nGraduates are ready to use their professional legal requirement to support activities in social research, policy development and political advocacy, or for roles in the social science, media and communication sectors.",
  "awards": [
    "Bachelor of Communication in Social and Political Sciences / Bachelor of Communication in Social and Political Sciences and in (name of second stream) (BCommSocPolSc) Bachelor of Laws (LLB)"
  ],
  "faculty": [
    "LawArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "10",
  "course_fee": "22750",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609003",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 6,
      "text": "Apply theoretically informed understandings of communication industries to independent and collaborative projects across a range of media. "
    },
    {
      "number": 6,
      "text": "Apply theoretically informed understandings of communication industries to independent and collaborative projects across a range of media. "
    },
    {
      "number": 7,
      "text": "Act as reflexive critical thinkers and innovative communication practitioners who can thoughtfully evaluate and analyse their own and others’ work. "
    },
    {
      "number": 7,
      "text": "Act as reflexive critical thinkers and innovative communication practitioners who can thoughtfully evaluate and analyse their own and others’ work. "
    },
    {
      "number": 8,
      "text": "Demonstrate a strong awareness, knowledge of, and sensitivity to, diversity and equity in global contexts. "
    },
    {
      "number": 8,
      "text": "Demonstrate a strong awareness, knowledge of, and sensitivity to, diversity and equity in global contexts. "
    },
    {
      "number": 9,
      "text": "Apply knowledge and skills related to Indigenous Australian contexts to inform capabilities to work for and with Indigenous Australians within communication industries. "
    },
    {
      "number": 9,
      "text": "Apply knowledge and skills related to Indigenous Australian contexts to inform capabilities to work for and with Indigenous Australians within communication industries. "
    },
    {
      "number": 10,
      "text": "Reflect upon and act ethically in the personal, political and professional contexts of civil society. "
    },
    {
      "number": 10,
      "text": "Reflect upon and act ethically in the personal, political and professional contexts of civil society. "
    },
    {
      "number": 11,
      "text": "Listen actively and communicate clearly and appropriately in diverse communication industry contexts utilising a range of media and modes for different audiences. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Arts and Social Sciences Communication Inherent (Essential) Requirements Statement and the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/57c88ebac327d210020e061ad0013148"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include lawyer in business or media organisations, community or public sector, as an advocate, policy maker, political activist, political adviser or social or media researcher.",
  "course_structure": "The course comprises 240 credit points. The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe communication component of 96 credit points is made up of:\n\nFor a current listing of subjects in each course refer to the study package directory.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10383.html",
    "crawled_at": "2025-11-10T05:08:40.490626",
    "csv_source": "merged_Admission_Courses.csv"
  }
}