{
  "course_code": "C10355",
  "course_name": "Bachelor of Management Bachelor of Creative Intelligence and Innovation",
  "credit_points": "240 Credit points",
  "cricos_code": "088067J",
  "overview": "Taking a transdisciplinary approach, the combined degree Bachelor of Management Bachelor of Creative Intelligence and Innovation provides a compelling combination of deep industry knowledge alongside dynamic approaches to product and service design. This program goes well beyond the design-thinking and design-led innovation programmes now common in university environments to examine how innovation is led from multiple disciplinary perspectives.\n\nThe management focus of the program provides integrated exposure to the structure, function, and operation of the socio-culturally dynamic entertainment and experience industries, with a special focus on the visitor and audience economies of events, sport business, and the digital creative sector. Featuring a strong emphasis on innovation and entrepreneurship, this course provides a compelling combination of conceptual rigour and practical knowledge, which includes opportunities for internships with industry partners and overseas exchange placements with university partners.\n\nThe creative intelligence focus of the program propels students to ‘think differently’ and to experience a new form of education. Instead of lectures and tutorials, students do hackathons, think tanks, and hot housing days in a creative lab environment during their winter and summer schools. They take ideas for a walk and trial speculative scenarios – they undertake thought experiments and engage in carefully-designed sandpit environments with creative methods and practices from across the disciplines.\n\nIn summary, this combined degree brings together multiple perspectives from diverse fields, integrating insights from the entertainment and experience industries, this allowing for the cultivation of real-world projects and self-initiated proposals, equipping graduates to address the ‘wicked’ problems, complex challenges, and untapped opportunities in today's world.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of this combined degree also gain leading edge capabilities which are highly valued in the globalised world, including critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work independently across disciplines. These creative intelligence competencies enable graduates to navigate in a rapidly changing world.",
  "awards": [
    "Bachelor of Management (BMgt) Bachelor of Creative Intelligence and Innovation (BCIInn)"
  ],
  "faculty": [
    "BusinessTD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8**",
  "course_fee": "21550",
  "course_intake": "Feb",
  "uac_codes": [
    "609532",
    "Events",
    "Autumn Session609533",
    "Sport Business",
    "Autumn Session609531",
    "Strategic Innovation and Entrepreneurship",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply critical thinking skills to analyse contemporary managerial challenges, enabling the development of creative solutions relevant to professional practice "
    },
    {
      "number": 2,
      "text": "Develop effective communication skills to enable cogent knowledge transfer with colleagues to achieve productive project outcomes relevant to professional practice. "
    },
    {
      "number": 3,
      "text": "Evaluate and implement ethical principles in respect of managing for social responsibility, including knowledge of cultural diversity, economic equity, and environmental sustainability as they relate to professional practice. "
    },
    {
      "number": 4,
      "text": "Execute managerial capabilities and technical skills that are critical to professional practice in a specialised industry sector "
    },
    {
      "number": 5,
      "text": "Acquire and apply knowledge of Indigenous Australian contexts to inform professional capabilities to work with and for Indigenous Australians across management professions "
    },
    {
      "number": 6,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints "
    },
    {
      "number": 7,
      "text": "Identify, create, and employ a range of appropriate creative intelligence methods and boundary-crossing methodologies to construct and solve problems and generate transformative possibilities "
    },
    {
      "number": 8,
      "text": "Practice mutual, responsible value creation, including the implementation of sustainable and entrepreneurial innovation "
    },
    {
      "number": 9,
      "text": "Communicate transdisciplinary ideas and solutions succinctly and persuasively using appropriate modalities. "
    },
    {
      "number": 10,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well-considered values that enable greater purpose and inclusivity "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/d5cf68518358ba90fed7d4326daad3b2"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Career options include positions in event management, festival management, event coordination, event planning, destination management, destination marketing, conference organising, meetings planning, business event management, wedding planning, entertainment venue management, social media management, event marketing, sport marketing, sport management, sport venue management, sport event management, sports agency, sports administration, player management, sponsorship management, and player relations management.",
  "course_structure": "Students must complete 240 credit points, comprising 144 credit points of sport business and events subjects, and 96 credit points of creative intelligence and innovation subjects.\n\nThe creative intelligence and innovation subjects are undertaken in accelerated form in July and Summer sessions during the first three years of study, and through one full year of study after completion of the professional degree. The Bachelor of Creative Intelligence and Innovation is not offered as a separate degree, but is completed only in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10355.html",
    "crawled_at": "2025-11-10T03:33:21.794055",
    "csv_source": "merged_Admission_Courses.csv"
  }
}