{
  "course_code": "C09072",
  "course_name": "Bachelor of Engineering (Honours) Bachelor of Science",
  "credit_points": "246 Credit points",
  "cricos_code": "084093F",
  "overview": "This combined degree is designed to provide opportunities for students interested in science, the scientific basis of engineering and technology, and the technology itself. Graduates of this course work as cutting-edge professionals where science and engineering interact dynamically.\n\nThere is a strong interrelation between the progress of engineering and developments in science, and a demonstrated need for professionals with a strong understanding and experience in both areas.\n\nStudents have the option of undertaking honours in science, or an additional two internships to gain the Diploma in Professional Engineering Practice, or both.\n\nThis combined degree can be completed in less time than would be required to complete the two degrees separately.",
  "awards": [
    "Bachelor of Engineering (Honours) in (name of Engineering major) (BE(Hons)) Bachelor of Science in (name of Science major) (BSc)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "TechnologyScience"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": "10 Year(s)",
  "duration_sessions": "10",
  "course_fee": "24500",
  "course_intake": "Feb",
  "uac_codes": [
    "609360",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The Bachelor of Engineering (Honours), majoring in Civil Engineering, Civil and Environmental Engineering, Electrical Engineering, Flexible Engineering, Mechanical Engineering, Mechanical and Mechatronic Engineering, or Mechatronic Engineering, is fully accredited by Engineers Australia at the level of Professional Engineer and is recognised internationally by signatories to the Washington Accord. Biomedical Engineering, Data Science Engineering, Electrical and Electronic Engineering, Electronic Engineering, and Software Engineering majors are provisionally accredited with Engineers Australia, pending full accreditation. UTS is currently seeking provisional accreditation of the Chemical Process Engineering and Renewable Energy Engineering majors.",
  "learning_outcomes": [
    {
      "number": 7,
      "text": "Demonstrate theoretical and technical knowledge of broad science concepts and explain specialised disciplinary knowledge. (BSc) "
    },
    {
      "number": 8,
      "text": "Evaluate scientific evidence and apply effective experimental design and/or mathematical reasoning, analysis, and critical thinking to apply science and/or mathematic methodologies to real world problems. (BSc) "
    },
    {
      "number": 9,
      "text": "Work autonomously or in teams to address workplace or community problems utilising best scientific practice, with consideration to safety requirements and ethical guidelines. (BSc) "
    },
    {
      "number": 10,
      "text": "Design creative solutions to contemporary or complex scientific issues by incorporating innovative methods, reflective practices, and self-directed learning. (BSc) "
    },
    {
      "number": 11,
      "text": "Present and communicate complex ideas and justifications using appropriate communication approaches from a variety of methods (oral, written, visual) to communicate with discipline experts, scientists, industry, and the general public. (BSc) "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, Electrical Engineering major, Physics major, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/c830f43947647e10413994ed036d4311"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nCurrent school leavers are advised to complete the Year 12 Engineering and IT Questionnaire. The questionnaire allows applicants to demonstrate their strong motivation to study engineering or IT at UTS and may assist applicants whose ATAR falls short of the required cut-off by up to three points.\n\nNon-current school leavers are advised to complete the employment question on their UAC application as adjustment factors may be applied on the basis of relevant work experience.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Career options depend on the majors and subjects chosen. Options include research, design and development, and scientific management. Graduates work in industry or government, in areas such as biotechnology, communications, energy and resource exploration, environmental protection, medical technology, molecular biology and materials technology, nanotechnology and transportation.",
  "course_structure": "Students are required to complete 246 credit points, comprising 168 credit points in engineering and 78 credit points in science. The engineering component consists of core (48 credit points), major (field of practice) (114 credit points) and professional engineering practice (6 credit points). The science component consists of a science major (78 credit points).\n\nStudents select both the engineering and science major at the time of admission; however, it is possible to apply to change majors at a later date. Students selecting the flexible engineering major should decide by the end of the first year of full-time study whether to transfer to a designated major or continue with the flexible program.\n\nGraduation from the science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Science prior to completion of the engineering component of the combined degree must apply for transfer to the Bachelor of Science (C10242) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nSimilarly, if a student wishes to graduate from the engineering component of the combined degree prior to completion of the science component they must apply for transfer to the Bachelor of Engineering (Honours) (C09066) single degree program where they must complete all requirements for the stand-alone single degree version, including the Engineering Work Experience subject.\n\nFurther, students wishing to graduate from the engineering component of the combined degree prior to completion of the science component must have completed at least 60 credit points of the science major (CBK90586).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09072.html",
    "crawled_at": "2025-11-10T04:23:18.684720",
    "csv_source": "merged_Admission_Courses.csv"
  }
}