{
  "course_code": "C09130",
  "course_name": "Bachelor of Creative Production (Honours)",
  "credit_points": "48 Credit points",
  "cricos_code": "107053J",
  "overview": "For those who have a passion for visual arts, drawing and storytelling, the Bachelor of Animation Production (Honours) at UTS gives students the knowledge and hands-on experience required to create animation work that communicates clear and powerful ideas, helping them stand out in a global industry.\n\nThe Bachelor of Animation Production (Honours) students learn how to observe the world around them, drawing directly from life to gain inspiration for characters and stories. They discover how to think creatively and develop ideas through multiple stages, focusing upon character development, narrative structure and engaging performance. They also learn fundamental 2D, 3D and hybrid animation skills to bring their stories to life.\n\nGraduates from the Bachelor of Animation Production (Honours) are image-makers, critical thinkers and storytellers in equal measure and we help equip them to become leaders in this industry. Students learn to develop, pitch and defend ideas, and ultimately create original content for film, TV, advertising and other screen-based media that will engage global audiences.\n\nUTS understands that teamwork is at the heart of the animation industry which is why a studio-led approach is used to create a high-intensity practical environment where students learn how to work with their peers in a professional and collaborative atmosphere, melding creativity, technology and research.\n\nThe honours year allows exploration through the completion of an independent animated film/project.",
  "awards": [
    "Bachelor of Animation Production (Honours) (BCreativeProd(Hons))"
  ],
  "faculty": [
    "Arts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 2025,
      "text": "Refer to the Admission Requirements for application requirements. Availabilities Expand all City campus-Autumn Session Learning outcomes Expand all Upon completion of this course, graduates will be able to:"
    },
    {
      "number": 1,
      "text": "Demonstrate advanced knowledge of contemporary theoretical paradigms and professional practices relevant to independent and collaborative creative works. "
    },
    {
      "number": 2,
      "text": "Demonstrate reflexive critical thinking as creative practitioners who are intellectually curious, imaginative, and innovative, and who can constructively evaluate your own and others' creative research and practice. "
    },
    {
      "number": 3,
      "text": "Demonstrate high-level awareness of domestic and international contexts and be actively open to cultural exchange as creative practitioners. "
    },
    {
      "number": 4,
      "text": "Critically reflect on professional ethical communication and collaboration practices to work effectively for or with Indigenous Australians in the contexts of creative production. "
    },
    {
      "number": 5,
      "text": "Act transparently and demonstrate an awareness of ethical practice and integrity in the professional contexts of creative production. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of Music and Sound Design, Bachelor of Communication (Media Arts and Production), Bachelor of Communication (Journalism), Bachelor of Animation Production Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/06c9c440837c7e50fed7d4326daad377"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nAll applicants must submit the required documents as part of their application. More information can be found on the Bachelor of Animation Production (Honours) website under the How to Apply section.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Bachelor of Animation Production (Honours) opens up animation careers in film, television and emergent screen-based content creation industries. Career options include director, animator, scriptwriter, concept artist, production designer, character designer, set designer, storyboard artist, layout artist, digital cinematographer, technical director, producer, modeller, rigger, VFX artist, editor, colourist and compositor.",
  "course_structure": "Students must complete 48 credit points comprising of animation studios.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09130.html",
    "crawled_at": "2025-11-10T17:14:50.413019",
    "csv_source": "merged_Admission_Courses.csv"
  }
}