{
  "course_code": "C10143",
  "course_name": "Bachelor of Information Technology (Co-op)",
  "credit_points": "144 Credit points",
  "cricos_code": "None",
  "overview": "This is a cooperative education scholarship program in computer information systems, developed by UTS in cooperation with a group of leading organisations. It differs from other cooperative education courses in that, during the industry-based sessions, students follow a structured program designed jointly by UTS and the employer group, including formal coursework delivered by industry.\n\nThere are a limited number of places available in this course according to the number of industry sponsors each year. If selected for this course, students receive a total scholarship of around $49,500 for the duration of the course.\n\nThis intensive course includes two six-month industry-based sessions with different industry sponsors. Industry sponsors are heavily involved in the curriculum design to ensure graduates are not only highly qualified but also have the knowledge and skills relevant to the needs of industry.\n\nStudents normally secure graduate employment before completion of the course. Sponsors also actively recruit graduates from the course but students are not obliged to take up employment with a sponsor.",
  "awards": [
    "Bachelor of Information Technology (Co-op)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [
    "603210",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Graduates are eligible to apply for professional-level membership of the Australian Computer Society.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/eb44add847996610a31de422036d4306"
    }
  ],
  "notes": "This course is only offered to local students.\n\nThis course is intended for domestic current school leavers.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThis is an intensive scholarship course intended for current school leavers, although applications are accepted from non-current school leavers who completed Year 12 one year prior to application. Special application and selection procedures apply. Applicants must submit a Bachelor of Information Technology application questionnaire.\n\nApplicants must demonstrate leadership potential and involvement in extracurricular activities, and it is expected that they achieve a minimum ATAR of 85. Short-listed applicants are interviewed, and final selection is based on ATAR and interview performance.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include business analyst, systems analyst, information systems manager, project manager, commercial manager and roles in social media/digital marketing.",
  "course_structure": "Students are required to complete 144 credit points, comprising core (48 credit points), software development studios (12 credit points), work integrated learning (36 credit points), sub-major (24 credit points), and electives (24 credit points).\n\nThere are special conditions relating to students enrolled in this course. Leave of absence and re-admission after withdrawal are not normally granted to students, except under extraordinary circumstances and subject to satisfactory arrangements being possible.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10143.html",
    "crawled_at": "2025-11-10T17:32:12.759652",
    "csv_source": "merged_Admission_Courses.csv"
  }
}