{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "088070C",
  "overview": "The Bachelor of Health Science is a flexible and innovative degree that equips graduates with qualifications to help improve the health of individuals and populations. It is a broad field of practice, based on the application of scientific principles in governmental and non-governmental health services and the wider industry.\n\nThis transdisciplinary course is characterised by a strong emphasis on the social model of health and combines health-specific content with a mix of professional and scientific subjects. Students develop knowledge within a framework that can be tailored to suit their interests and needs. In majors, students can gain an in-depth understanding of Indigenous health or health promotion. Alternatively, students can develop their knowledge of global and international health priorities to contribute to overseas health initiatives and aid organisations or undertake the human structure and function major. Students who complete this course with the required pathway and grade point average also meet current entry criteria for the UTS Master of Physiotherapy.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "6",
  "course_fee": "19060",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "The course name will be changing to Bachelor of Public Health for 2024 admission. The UTS website will reflect this name change in August. Applications via UAC are already updated with the new course name.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 69; Admission requirements for Chinese students (Gaokao score out of 750): 452; Admission requirements for students with GCE A Levels: 7; Admission requirements for Hong Kong students (HKDSE): 14; Admission requirements for Indian students (AISSC): 8.5; Admission requirements for Indian students (ISC): 76; Admission requirements for students with IB or Predicted IB: 24/29 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 5; Admission requirements for Singaporean students (A Level): 7; Admission requirements for USA students (SAT 1): 1080; Admission requirements for UTS Foundation Studies students: 6.1",
  "career_options": "Career options include positions in health promotion, epidemiology, advocacy, health education, e-health, health data and information management systems, planning and policy, project management and evaluation, community development, research and consultancy across both public and private health sectors, physiotherapy (pathway).",
  "course_structure": "The course comprises 144 credit points. Students choose a major in Health Promotion, Global Health, Human Structure and Function, Indigenous Health or Pharmacology, or can choose the no specified major option.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10360.html",
    "crawled_at": "2025-11-10T13:35:11.762511",
    "csv_source": "merged_Admission_Courses.csv"
  }
}