{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "This combined degree is the same as the Bachelor of Engineering (Honours) Bachelor of Science (C09072), except for the additional requirement of two internships and completion of the professional engineering practice program. Students can transfer to this program if they wish to complete the Diploma in Professional Engineering Practice.\n\nThere is a strong interrelation between the progress of engineering and developments in science and a demonstrated need for professionals with a strong understanding and experience in both areas.\n\nStudents also have the option of undertaking honours in science.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "The Bachelor of Engineering (Honours) Diploma in Professional Engineering Practice, majoring in Civil Engineering, Civil and Environmental Engineering, Electrical Engineering, Flexible Engineering, Mechanical Engineering, Mechanical and Mechatronic Engineering, or Mechatronic Engineering, is fully accredited by Engineers Australia at the level of Professional Engineer and is recognised internationally by signatories to the Washington Accord. Biomedical Engineering, Data Science Engineering, Electrical and Electronic Engineering, Electronic Engineering, and Software Engineering majors are provisionally accredited with Engineers Australia, pending full accreditation. UTS is currently seeking provisional accreditation of the Chemical Process Engineering and Renewable Energy Engineering majors.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "Direct admission to this course via the Universities Admissions Centre (UAC) is not available. Students currently enrolled in the Bachelor of Engineering (Honours) Bachelor of Science (C09072) may apply via Internal Course Transfer.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options depend on the majors and subjects chosen. Options include research, design and development, and scientific management. Graduates work in industry or government, in areas such as biotechnology, communications, energy and resource exploration, environmental protection, medical technology, molecular biology and materials technology, nanotechnology and transportation.",
  "course_structure": "Students are required to complete 288 credit points, comprising 210 credit points in engineering and 78 credit points in science. The engineering component consists of core (48 credit points), major (field of practice) (114 credit points) and the professional engineering practice program (28 credit points). The science component consists of a science major (78 credit points).\n\nGraduation from the science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Science prior to completion of the engineering component of the combined degree must apply for transfer to the Bachelor of Science (C10242) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nSimilarly, if a student wishes to graduate from the engineering component of the combined degree prior to completion of the science component they must apply for transfer to the Bachelor of Engineering (Honours) Diploma in Professional Engineering Practice (C09067) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nFurther, students wishing to graduate from the engineering component of the combined degree prior to completion of the science component must have completed at least 60 credit points of the science major (CBK90586).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09073.html",
    "crawled_at": "2025-11-10T16:53:57.957478",
    "csv_source": "merged_Admission_Courses.csv"
  }
}