{
  "course_code": "C09083",
  "course_name": "Bachelor of Laws (Honours)",
  "credit_points": "192 Credit points",
  "cricos_code": "116593F",
  "overview": "This course provides students with a coherent and advanced knowledge of the underlying principles and concepts in the discipline of law and equips them with advanced research skills. UTS Law graduates are increasingly in demand in the legal profession and in other employment sectors where legal knowledge and skills are valued. Today's law graduates are employed in a wide range of roles and responsibilities, including to advise and counsel parties, act as negotiators, manage project teams and resolve disputes. Students must successfully complete both of the research subjects: 76090 Research Methodology and 76040 Research Thesis. Strong research skills are valued highly in contemporary professional practice.\n\nThis course provides full-time or part-time study for students wishing to obtain a professional legal qualification that satisfies the requirements for admission as a lawyer.\n\nStudents have the opportunity to engage in deeper study of the law by studying 76090 Research Methodology and undertaking 76040 Research Thesis. This course can be a pathway to higher degree research programs.",
  "awards": [
    "Bachelor of Laws (Honours)"
  ],
  "faculty": [
    "Law"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "5 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer provided students undertake the optional practical legal training program as part of the course or at the completion of the course. Check with the Legal Profession Admission Board (LPAB) for time constraints.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and transform an advanced body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to critically analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Formulate appropriate responses to problems and questions in law and execute a piece of legal scholarship, using advanced skills in legal research, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "Generate solutions to complex legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include lawyer or legal policy adviser within a government or corporate department, private law firm or community law centre, or negotiating treaties or work in legislation drafting with the Attorney-General's Department.",
  "course_structure": "The course comprises a total of 192 credit points. The study components for course completion are:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09083.html",
    "crawled_at": "2025-11-10T16:55:18.352105",
    "csv_source": "merged_Admission_Courses.csv"
  }
}