{
  "course_code": "C09156",
  "course_name": "Bachelor of Medical Science Bachelor of International Studies (Honours)",
  "credit_points": "240 Credit points",
  "cricos_code": "106915J",
  "overview": "The Bachelor of Medical Science Bachelor of International Studies (Honours) is an exit-point for students who have completed the International Honours pathway within the Bachelor of Medical Science Bachelor of International Studies (C10167).\n\nThe Bachelor of Medical Science Bachelor of International Studies (Honours) is a combined degree that integrates medical science with the immersion in another language and culture. The medical science program is designed to educate and train graduates for careers in medical and health-related sciences or pathology depending on their major choice. In the Medical and Health-related Science major students learn the body through the study of tissues, organs and cellular facets both in health and disease, medical devices, how medicines work, as well as public health policies and clinical trials. In the Pathology major students learn how diseases trigger biochemical or cellular changes in the body and how to best diagnose and treat these diseases. Students learn by applying and investigating scientific approaches in world class laboratories with up-to-date scientific technologies and equipment in line with those used in the industry. This hands-on learning is accompanied by development of professional skills such as communication, problem solving, critical thinking, and innovation that means the students are ideally placed for a range of professions.\n\nIn the fourth year of the combined degree, International Honours students spend an academic year studying in the local language at a university in the country of their major and also complete an honours level research project under the supervision of a relevant UTS academic.\n\nEntry to the International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors.\n\nThe combination of medical science and international studies aims to produce graduates with an increased awareness of the international contexts of health and who are well prepared to pursue global health-related professional careers. The course provides the knowledge and skills for students to be excellent medical scientists, but also with an excellent language and international skills set, meaning graduates can make a difference to society in a range of careers with a global and international context.\n\nMultinational pharmaceutical companies look to medical science graduates to work in drug registration, clinical trials coordination, as technical or marketing representatives and as policy analysts. International health initiatives involving governments or non-government organisations also look for the unique skills provided by this dual degree.",
  "awards": [
    "Bachelor of Medical Science (BMedSc) in (name of major) Bachelor of International Studies (Honours)"
  ],
  "faculty": [
    "ScienceArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Explain how diseases arise and disrupt normal physiological function and appraise the technologies used to diagnose, treat, and cure diseases. "
    },
    {
      "number": 2,
      "text": "Collect, accurately record, interpret, and draw conclusions from data to solve real-world medical problems, and infer how the results of medical research can be translated to improve patient outcomes. "
    },
    {
      "number": 3,
      "text": "Evaluate ethical, social, and cultural issues in medical science in local and global contexts and work responsibly, safely and with respect to diversity and regulatory frameworks. "
    },
    {
      "number": 4,
      "text": "Reflect upon, independently evaluate, and critically appraise current evidence-based literature to identify medical problems or unmet medical needs and creatively translate medical research results to improve the clinical care of patients. "
    },
    {
      "number": 5,
      "text": "Effectively communicate medical science knowledge and research information, and the importance thereof, to a range of audiences using a variety of modes, independently and collaboratively. "
    },
    {
      "number": 6,
      "text": "Acquire or develop knowledge of Indigenous Australian contexts to inform professional cultural capability to work effectively with and for, Indigenous Australians within the medical science context. "
    },
    {
      "number": 7,
      "text": "Understand and engage with cultural diversities and employ effective strategies to operate within varied professional and everyday settings in Australia and internationally. "
    },
    {
      "number": 8,
      "text": "Apply research methods and advanced theoretical knowledge to evaluate findings of complex problems in contemporary societies and cultures and conduct an independent research project. "
    },
    {
      "number": 9,
      "text": "Communicate effectively and appropriately in an additional language for everyday and professional purposes. "
    },
    {
      "number": 10,
      "text": "Engage critically with current issues to act in socially responsible ways in Australian and international settings. "
    },
    {
      "number": 11,
      "text": "Communicate clearly and effectively in written and spoken language using diverse digital technologies. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of International Studies Diploma in Languages Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in government departments, private and public hospitals and public health units, pathology, multinational medical and pharmaceutical companies, global and international health organisations (government and non-government). The international perspective provided by the international studies component enhances global opportunities.",
  "course_structure": "Students must complete 240 credit points of study, comprising 144 credit points relating to medical science and 96 credit points relating to international studies.\n\nGraduation from the medical science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Medical Science prior to completion of the international studies component of the combined degree must apply for transfer to the Bachelor of Medical Science (C10184) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nInternational Studies (96 credit points)",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09156.html",
    "crawled_at": "2025-11-10T17:25:57.339524",
    "csv_source": "merged_Admission_Courses.csv"
  }
}