{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "Bachelor of Nursing Bachelor of International Studies (Honours) is an exit-point for students who have completed the International Honours pathway within the Bachelor of Nursing Bachelor of Arts in International Studies (C10123)\n\nIn the fourth year of the combined degree, International Honours students spend an academic year studying in the local language at a university in the country of their major and also complete an honours level research project under the supervision of a relevant UTS academic.\n\nEntry to the International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors.\n\nThe School of Nursing & Midwifery at UTS is ranked number 1 in Australia and seventh in the world. (QS World University Rankings by Subject 2020). We shape the future of healthcare through clinically relevant and research-inspired teaching and learning. The Bachelor of Nursing course is taught by high profile award-winning educators and researchers as well as experienced practicing clinicians. We use a blend of e-learning and face-to-face approaches to engage, inspire and challenge students and our clinical simulation facilities and the diverse clinical placements experiences provided ensure that students develop high level clinical and critical thinking skills. A wide choice of elective third year subjects allows students to sample different nursing specialties including emergency nursing, theatre, paediatrics, community and primary healthcare, aged care and mental health.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "None",
  "course_structure": "(96 credit points)\n\nStudents select one of the following languages (Chinese, French, German, Italian, Japanese, Spanish) at the time of enrolment. The language choice guides the country major specialisation. For example, students who choose Italian will have the opportunity to apply for a one-year International Honours to be completed at a host university in Italy. The first core subject 99218 Intercultural Communication must be completed before the second year of study. Entry to this International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors. All students who are admitted into the International Honours will receive a contribution of up to $1500 towards their travel expenses.\n\nStudents are required to meet living costs while overseas for all options. Living costs in some countries are higher than in Sydney.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09158.html",
    "crawled_at": "2025-11-10T17:26:12.080236",
    "csv_source": "merged_Admission_Courses.csv"
  }
}