{
  "course_code": "C10131",
  "course_name": "Bachelor of Medical Science Bachelor of Laws",
  "credit_points": "240 Credit points",
  "cricos_code": "025797G",
  "overview": "Medical and health practice, medical and biological research, and industrial and commercial enterprise are all areas of medical science where legal expertise is of crucial importance.\n\nMedical Scientists with Law training have careers that are dynamic and involve an exciting range of professions from research and development, policy and practice in the medical and Health and Sciences, government, industrial and commercial applications of medical science and law. Medical Scientists at UTS can chose to major in Medical and Health-related Sciences or Pathology, allowing them to have a speciality relevant to their career choices and interests. In the Medical and Health-related Science major students learn the body through the study of tissues, organs and cellular facets both in health and disease, medical devices, how medicines work, as well as public health policies and clinical trials. In the Pathology major students learn how diseases trigger biochemical or cellular changes in the body and how to best diagnose and treat these diseases. Students also learn how to identify infectious agents and the latest approaches to prevent, treat infections and limit their impact on society. Students learn by applying and investigating scientific approaches in world class laboratories with up-to-date scientific technologies and equipment in line with those used in the industry. This hands-on learning is accompanied by development of professional skills such as communication, problem solving, critical thinking, and innovation.\n\nWith the Bachelor of Medical Science Bachelor of Laws, students can prepare for specialist roles in the field of health care law or opt to pursue two discrete qualifications in medical science and law. Elective subjects in biomedicine, mental health or intellectual property tailor the degree to either a health care or research focus, or students can pursue a broad introduction to a range of health and law concepts by choosing subjects that correspond to their individual interests.\n\nThe Legal Futures and Technology major enables the development of niche expertise in emerging technologies that are impacting the legal sector, such as smart contracts, AI and blockchain. The Bachelor of Laws satisfies the academic requirements for admission to practise law in NSW.",
  "awards": [
    "Bachelor of Medical Science",
    "in (name of major) Bachelor of Laws (LLB)"
  ],
  "faculty": [
    "Law",
    "Science"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "10",
  "course_fee": "22750",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609065",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 6,
      "text": "Explain how diseases arise and disrupt normal physiological function and appraise the technologies used to diagnose, treat, and cure diseases. "
    },
    {
      "number": 7,
      "text": "Collect, accurately record, interpret, and draw conclusions from data to solve real-world medical problems, and infer how the results of medical research can be translated to improve patient outcomes. "
    },
    {
      "number": 8,
      "text": "Evaluate ethical, social, and cultural issues in medical science in local and global contexts and work responsibly, safely and with respect to diversity and regulatory frameworks. "
    },
    {
      "number": 9,
      "text": "Reflect upon, independently evaluate, and critically appraise current evidence-based literature to identify medical problems or unmet medical needs and creatively translate medical research results to improve the clinical care of patients. "
    },
    {
      "number": 10,
      "text": "Effectively communicate medical science knowledge and research information, and the importance thereof, to a range of audiences using a variety of modes, independently and collaboratively. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Medical and Health-related sciences, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/c09d6c5f478c3a50413994ed036d4392"
    },
    {
      "name": "Pathology, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/c49d6c5f478c3a50413994ed036d439d"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include lawyer in areas where a strong background in human biology, medical diagnostics, human genetic, precision medicine, medical research and development, or pharmacology is valued; manager, officer or researcher in private or public health administration.",
  "course_structure": "The course comprises a total of 240 credit points and allows students to graduate with the separate degrees of Bachelor of Medical Science (BMedSc) and Bachelor of Laws (LLB). The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe medical science component comprises 96 credit points of core medical science subjects.\n\nStudents graduate from the BMedSc independently from the LLB. However, to be eligible for graduation from the BMedSc, students must complete a total of 96 credit points of science subjects plus at least 96 credit points of Bachelor of Laws subjects.\n\nFor a current listing of subjects in each course refer to the study package directory.\n\nGraduation from the medical science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Medical Science prior to completion of the law component of the combined degree must apply for transfer to the Bachelor of Medical Science (C10184) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nSimilarly, a student can graduate from the law component of the combined degree prior to completion of the medical science component, but if they wish to continue with the medical science component, they must apply for transfer to the Bachelor of Medical Science (C10184) single degree program where they need to complete all requirements for the stand-alone single degree version.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10131.html",
    "crawled_at": "2025-11-10T04:59:34.417507",
    "csv_source": "merged_Admission_Courses.csv"
  }
}