{
  "course_code": "C10338",
  "course_name": "Bachelor of Laws Bachelor of Creative Intelligence and Innovation",
  "credit_points": "240 Credit points",
  "cricos_code": "079765B",
  "overview": "The Bachelor of Laws Bachelor of Creative Intelligence and Innovation is an innovative UTS degree with a focus on creating new value through transdisciplinary problem solving.\n\nBy combining these courses, students learn to solve complex challenges, work collaboratively across and between disciplines, and apply their conceptual and problem-solving expertise beyond traditional professional boundaries.\n\nBoth degrees are practice-oriented in their design. In the BCII, students use design processes to engage with industry experiences, real-world projects and self-initiated proposals. The law component of this degree offers fieldwork, leadership, mooting and mentoring opportunities, and meets the academic requirements for admission to practise law in NSW. Students can also enrol in the Legal Futures and Technology major, which provides a future-focused look at the technologies shaping the legal profession.\n\nBy the end of the course, students have the skills to engage in critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work on their own across disciplines.\n\nGraduates have the capacity to take a contemporary and solutions-focused approach to a career in law, or to use their legal expertise as a solid foundation for entrepreneurial, collaborative, strategic or analytical positions across a range of professional sectors.",
  "awards": [
    "Bachelor of Laws (LLB) Bachelor of Creative Intelligence and Innovation (BCIInn)"
  ],
  "faculty": [
    "LawTD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "8*",
  "course_fee": "22750",
  "course_intake": "Feb",
  "uac_codes": [
    "609575",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training (PLT) program, such as the Graduate Certificate in Professional Legal Practice (C11232).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 6,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints. "
    },
    {
      "number": 7,
      "text": "Identify, create, and employ a range of appropriate creative intelligence methods and boundary-crossing methodologies to construct and solve problems and generate transformative possibilities. "
    },
    {
      "number": 8,
      "text": "Practice mutual, responsible value creation, including the implementation of sustainable and entrepreneurial innovation. "
    },
    {
      "number": 9,
      "text": "Communicate transdisciplinary ideas and solutions succinctly and persuasively using appropriate modalities. "
    },
    {
      "number": 10,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well- considered values that enable greater purpose and inclusivity. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f2ca632f47b22650a31de422036d4383"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include entrepreneur, speculative start-up consultant, entrepreneurial lawyer, commercial lawyer, corporate lawyer, barrister, creative enterprise manager, solicitor, product development and life cycle manager, market researcher, strategic analyst, and brand development manager.\n\nBy being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "The course comprises a total of 240 credit points. The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe creative intelligence and innovation component consists of 96 credit points. The creative intelligence and innovation subjects are undertaken in accelerated form within July and Summer sessions during the first three years of study, and through one full year of study after completion of the professional degree. The Bachelor of Creative Intelligence and Innovation is not offered as a separate degree, but is completed only in combination with the professional degree program.\n\nFor a current listing of subjects in each course, refer to the study package directory.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10338.html",
    "crawled_at": "2025-11-10T05:02:50.700777",
    "csv_source": "merged_Admission_Courses.csv"
  }
}