{
  "course_code": "C09122",
  "course_name": "Bachelor of Creative Intelligence and Innovation (Honours)",
  "credit_points": "108 Credit points",
  "cricos_code": "0100449",
  "overview": "The Bachelor of Creative Intelligence and Innovation (Honours) offers training in research to prepare students for further postgraduate research study in the transdisciplinary innovation area.\n\nThis course provides students opportunities to be exposed to professional practice through engagement with industry and community mentors as well as to work on research that addresses real-world challenges. Honours also provides a pathway for students interested in pursuing postgraduate studies at masters and PhD level, and enhances graduates' career and study options.\n\nThis degree empowers its graduates to recognise and respond to real-world challenges which take a global, cultural and social justice perspective and potentially shape future workforce opportunities through contribution to knowledge.\n\nStudents in this course will engage with cutting-edge creative practices through UTS’s academic mentors to explore concepts, methods, techniques and technologies across disciplinary boundaries with the intention of provoking insights and generating knowledge in new transdisciplinary contexts.",
  "awards": [
    "Bachelor of Creative Intelligence and Innovation (Honours)"
  ],
  "faculty": [
    "TD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints. "
    },
    {
      "number": 2,
      "text": "Independently identify and trial novel research and discovery practices to elicit transdisciplinary insights. "
    },
    {
      "number": 3,
      "text": "Articulate and justify research design to demonstrate rigour in creative and critical thinking. "
    },
    {
      "number": 4,
      "text": "Synthesise and persuasively communicate novel transdisciplinary ideas with depth and clarity, using appropriate modalities. "
    },
    {
      "number": 5,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well-considered values that enable greater purpose and inclusivity. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the TD School Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "The course is only open to students who are currently undertaking a combined Bachelor of Creative Intelligence and Innovation degree.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nTo qualify for entry into the course, the student must have successfully completed:\n\n1. all required subjects in their professional degree program with a weighted average mark of 65 and above; and\n\n2. the following Bachelor of Creative Intelligence and Innovation subjects with a weighted average mark of 80 and above:\n\n81511 Problems to Possibilities\n\n81512 Creative Practice and Methods\n\n81513 Past, Present, Future of Innovation\n\n81514 Creativity and Complexity\n\n81515 Leading Innovation\n\n81516 Initiatives and Entrepreneurship\n\nand\n\n3. subject 81541 Research Proposal with a final mark of 75 and above.\n\nEligibility for admission does not guarantee offer of a place.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course equips graduates with the critical thinking, creativity and professional project skills to pursue careers in their chosen field. Specific career options depend on the student's core discipline. Graduates are also well prepared to undertake postgraduate research degrees or begin a career as a researcher.",
  "course_structure": "Students must complete 108 credit points, comprising 72 credit points of creative intelligence and innovation subjects and 36 credit points of honours subjects. The creative intelligence and innovation subjects are undertaken in accelerated form within the July and Summer sessions during the first three years of study in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09122.html",
    "crawled_at": "2025-11-10T17:13:47.493890",
    "csv_source": "merged_Admission_Courses.csv"
  }
}