{
  "course_code": "C10391",
  "course_name": "Bachelor of Forensic Science Bachelor of Laws",
  "credit_points": "240 Credit points",
  "cricos_code": "092384F",
  "overview": "In this combined degree, students learn to use science as a tool to enforce the law or to prepare for professional and specialist work in the world of forensic science.\n\nMajoring in biology, chemistry, crime scene investigation or digital forensics, students work in world-class forensic science facilities that have been modelled on operational labs. Simultaneously, they study the foundations of the law, including constitutional, civil, criminal, commercial, tort and ethics law, before choosing an elective path that complements their scientific interests.\n\nSoft skills, including critical thinking and problem solving, are a key component of the degree. The Legal Futures and Technology major is also on offer in this course, offering students the chance to explore smart contracts, AI, blockchain and other technologies as they relate to future legal practice.\n\nGraduates meet the academic requirements for admission to practise law in NSW and benefit from UTS's extensive partnerships with the federal and state police services, national and international forensic institutions, and government laboratories.",
  "awards": [
    "Bachelor of Forensic Science (BForSc) Bachelor of Laws (LLB)"
  ],
  "faculty": [
    "Law",
    "Science"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "10",
  "course_fee": "22750",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609068",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training (PLT) program, such as the Graduate Certificate in Professional Legal Practice (C11232).\n\nGraduates of the Bachelor of Forensic Science are eligible for membership of the Royal Australian Chemical Institute and the Australian and New Zealand Forensic Science Society.",
  "learning_outcomes": [
    {
      "number": 3,
      "text": "A capacity to think critically, strategically and creatively, including the ability to: a. Identify and articulate legal issues in context, including the skill of critical reading and writing; b. Apply reasoning and research to generate appropriate responses; c. Engage in critical analysis and make a reasoned choice amongst alternatives; and d. Think creatively in approaching legal issues and generating appropriate responses. "
    },
    {
      "number": 4,
      "text": "Well-developed cognitive and practical skills necessary to identify, research, evaluate and synthesise relevant factual, legal and policy issues. "
    },
    {
      "number": 7,
      "text": "Bachelor of Law graduates will: Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 9,
      "text": "Demonstrate a command of forensic science practice, including the detection, collection, and analysis of traces in order to exploit and integrate the results of analyses into investigative, evaluative and intelligence frameworks. "
    },
    {
      "number": 10,
      "text": "Apply investigative, critical thinking and problem-solving skills to forensic science problems and design experimental methods to test hypotheses and critically analyse and interpret data. "
    },
    {
      "number": 11,
      "text": "Practise safe, ethical, and professional conduct with consideration for the role of forensic science in addressing current and future challenges faced by law enforcement, the legal system, security, and the wider community. "
    },
    {
      "number": 12,
      "text": "Apply forensic science professional skills with a high degree of personal autonomy and reflection to demonstrate initiative and innovative thinking in solving complex forensic problems. "
    },
    {
      "number": 13,
      "text": "Demonstrate skills in communicating experimental conclusions, expert opinion, and the justification of professional decisions related to forensic science processes effectively to expert, scientific, and non-expert audiences. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Biology major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/766de767c3feee50020e061ad00131ba"
    },
    {
      "name": "CSI major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/ba6de767c3feee50020e061ad00131a2"
    },
    {
      "name": "Chemistry major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/fe6de767c3feee50020e061ad00131c6"
    },
    {
      "name": "Digital Forensics major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b66de767c3feee50020e061ad0013197"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include positions in the police service, state and federal law enforcement agencies, government and private forensic or drug detection laboratories, customs, quarantine services, environmental protection agencies, pharmaceutical, chemical and analytical industries, DNA testing laboratories, medical diagnostic laboratories, hospitals or corporate multinationals providing forensic, medical or research services, digital forensic laboratories, scene of crime officers.",
  "course_structure": "The course comprises a total of 240 credit points and allows students to graduate with the separate degrees of Bachelor of Forensic Science (BForSc) and Bachelor of Laws (LLB). The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe forensic science component comprises 42 credit points of core subjects and a 54-credit-point major choice taken from one of the four specified majors representing different forensic science disciplines.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10391.html",
    "crawled_at": "2025-11-10T04:57:23.083189",
    "csv_source": "merged_Admission_Courses.csv"
  }
}