{
  "course_code": "C10448",
  "course_name": "Bachelor of Criminology Bachelor of Forensic Science",
  "credit_points": "192 Credit points",
  "cricos_code": "106142E",
  "overview": "The Bachelor of Criminology Bachelor of Forensic Science prepares students to respond to the changing nature of crime in the 21st century by addressing the realities of crime and forensics in an increasingly digital and transnational age. Students develop a skill set that combines enabling sciences, social sciences, in-depth understandings of forensic science and crime in the context of their chosen specialisations in both components of the course.\n\nThis course provides students with a thorough understanding of how forensic science and criminology can solve and prevent crime. This is a hands-on course using world-class facilities that are modelled on operational laboratories.\n\nThis degree combines theory and practice to address industry needs for an applied approach to criminology and specifically addresses the increasingly digital and transnational dimensions of crime. Students work with data sets, tools, problems and cases used in industry and contributed by UTS partners to be work-ready.\n\nIn the Bachelor of Criminology students are able to select from a standard major or an extended major:\n\nStandard majors - Forensics, Data Analytics, or Justice and Legal Studies.\n\nExtended majors - Analytics and Research, or Digital Security\n\nIn the Bachelor of Forensic Science students are able to select from 4 majors: Chemistry, Biology, Crime Scene Investigation, or Digital Forensics.\n\nThe course is offered primarily on campus, but individual subjects include aspects of asynchronous self-paced learning, synchronous online activities, collaborative learning and activities on campus, and industry engagement via site visits and/or guest speakers.\n\nPathways: The service of commissioned officers and those who have completed agency training courses is recognised as part of the basis for admission and Recognition of Prior Learning (RPL) for fast-tracking of degree completion.",
  "awards": [
    "Bachelor of Criminology (BCrim) Bachelor of Forensic Science (BForSc)"
  ],
  "faculty": [
    "Arts",
    "and",
    "Social",
    "SciencesScience"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8",
  "course_fee": "23220",
  "course_intake": "Feb",
  "uac_codes": [
    "609166",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply and evaluate methodologies, technologies and practices to comprehensively understand crime, disorder and threats to public safety & security, reflecting upon emerging threats to criminal and community justice. "
    },
    {
      "number": 2,
      "text": "Act with ethical integrity and social responsibility, demonstrating a critical understanding of crime, disorder and threats to public safety & security and the factors that contribute to offending and victimisation. "
    },
    {
      "number": 3,
      "text": "Analyse and respond to criminal justice and social policy challenges within organisations, communities and systems of governance. "
    },
    {
      "number": 4,
      "text": "Analyse crime, disorder and threats to public safety & security as both a domestic and global phenomenon to understand and respond appropriately to the individual, social and structural dimensions of crime and justice. "
    },
    {
      "number": 5,
      "text": "Communicate and collaborate effectively in different contexts to address issues of crime, disorder and threats to public safety and security. "
    },
    {
      "number": 6,
      "text": "Develop professional knowledge and skills to work effectively with and for Indigenous peoples across the criminal justice system. "
    },
    {
      "number": 7,
      "text": "Demonstrate a command of forensic science practice, including the detection, collection, and analysis of traces in order to exploit and integrate the results of analyses into investigative, evaluative and intelligence frameworks. "
    },
    {
      "number": 8,
      "text": "Apply investigative, critical thinking and problem-solving skills to forensic science problems and design experimental methods to test hypotheses and critically analyse and interpret data. "
    },
    {
      "number": 9,
      "text": "Practise safe, ethical, and professional conduct with consideration for the role of forensic science in addressing current and future challenges faced by law enforcement, the legal system, security, and the wider community. "
    },
    {
      "number": 10,
      "text": "Apply forensic science professional skills with a high degree of personal autonomy and reflection to demonstrate initiative and innovative thinking in solving complex forensic problems. "
    },
    {
      "number": 11,
      "text": "Demonstrate skills in communicating experimental conclusions, expert opinion, and the justification of professional decisions related to forensic science processes effectively to expert, scientific, and non-expert audiences. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of Global Studies, Bachelor of Sustainability and Environment and Bachelor of Criminology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, Biology major, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/93e1841a4719ae10a31de422036d43f2"
    },
    {
      "name": "Autumn commencing, Chemistry major, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/d3e1841a4719ae10a31de422036d43fd"
    },
    {
      "name": "Autumn commencing, Crime Scene Investigation major, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/23e1c41a4719ae10a31de422036d4307"
    },
    {
      "name": "Autumn commencing, Digital Forensics major, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/6fe1c41a4719ae10a31de422036d4310"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 82; Admission requirements for Chinese students (Gaokao score out of 750): 494; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13.5; Admission requirements for Indian students (ISC): 84; Admission requirements for students with IB or Predicted IB: 29/34 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 11; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1170; Admission requirements for UTS Foundation Studies students: 7",
  "career_options": "Career options include police officer, law enforcement agent, corrections officer, border force officer, customs officer, crime prevention analyst, policy analyst, community justice/development worker, government worker, evaluator, cyber security analyst, fraud prevention analyst, digital fraud prevention analyst, intelligence officer, ICT security specialist, security consultant.\n\nChemistry major: Criminalist, trace evidence specialist, explosive specialist, analytical chemist, toxicologist, clinical or regulatory toxicologist, analytical technician.\n\nBiology major: DNA specialist, forensic scientist, molecular research scientist, hospital scientist, pathology technician, forensic anthropologist, forensic pathology technician.\n\nCrime scene investigation major: Scene-of-crime officer, team leader in investigations, fire investigator, trace evidence specialist, forensic scientist, analyst.\n\nDigital forensics major: Digital forensic scientist or analyst, e-Discovery analyst, cyberthreat intelligence analyst, fraud investigator, information security analyst, malware analyst.",
  "course_structure": "Students complete 192 credit points comprising:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10448.html",
    "crawled_at": "2025-11-10T04:53:46.737908",
    "csv_source": "merged_Admission_Courses.csv"
  }
}