{
  "course_code": "C10324",
  "course_name": "Bachelor of Design in Visual Communication Bachelor of Creative Intelligence and Innovation",
  "credit_points": "240 Credit points",
  "cricos_code": "079754E",
  "overview": "This distinctive degree explores diverse forms of visual communication across design, culture and media. Visual Communication students acquire in depth understanding of the histories, practices and meanings of the visual world. In turn, obtaining the visual knowledge and skills required to negotiate rapidly changing technology, visual media and culture while becoming skilled in apprehending the unprecedented pace at which visual images, visual technologies and information data are produced.\n\nTaking a transdisciplinary approach, the Bachelor of Creative Intelligence and Innovation utilises multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals, equipping graduates to address the wicked problems, complex challenges and untapped opportunities in today's world.\n\nStudents immerse themselves in a practice-oriented, studio-based culture, studying a range of interdisciplinary subjects encompassing typography, interaction and image-making. Taught by experts in visual communication, students learn everything from the history and theory of visual culture and technology to producing cutting edge creative work in digital media, interaction design, photography, editorial design, information visualisation, web design, wayfinding, mobile apps, code, machine learning, motion graphics, the internet of things and 3D technologies such as VR/AR and 3D printing. Exploring both traditional and experimental research methods students learn to produce conceptually rigorous and socially responsive work. They graduate with the capacity to work across and between disciplines, to articulate design practices and processes, and to apply them to complex problems. Graduates develop industry experience through the degree's emphasis on addressing real-world issues in collaborative and team-based work.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of the combined degree also gain leading edge capabilities that are highly valued in the globalised world, including dealing with critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work on their own across disciplines. These creative intelligence competencies enable graduates to navigate in a rapidly changing world.",
  "awards": [
    "Bachelor of Design in Visual Communication (BDesign) Bachelor of Creative Intelligence and Innovation (BCIInn)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "BuildingTD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "8*",
  "course_fee": "22460",
  "course_intake": "Feb",
  "uac_codes": [
    "609555",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Develop a sustainable, informed, and ethical stance on social, cultural, and ecological issues, integrating practice-led projects and cultural principles. "
    },
    {
      "number": 2,
      "text": "Collaborate professionally within teams, communicate effectively across various mediums, and contribute constructively to peer learning. "
    },
    {
      "number": 3,
      "text": "Innovate in design through context-responsive, exploratory, and iterative processes, advancing technical and digital skills for professional production and presentation. "
    },
    {
      "number": 4,
      "text": "Critically engage with local and global design practices, ethics, and intellectual property, fostering self-directed learning and applying methodologies tailored to specific projects. "
    },
    {
      "number": 5,
      "text": "Source and evaluate academic and professional references, employ qualitative research methods, and critically reflect on design history and theory to inform complex ideas and creative practice. "
    },
    {
      "number": 6,
      "text": "Practice cultural principles and protocols to work effectively with and for Indigenous peoples across Design in Visual Communication projects and industry. "
    },
    {
      "number": 7,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints. "
    },
    {
      "number": 8,
      "text": "Identify, create, and employ a range of appropriate creative intelligence methods and boundary-crossing methodologies to construct and solve problems and generate transformative possibilities. "
    },
    {
      "number": 9,
      "text": "Practice mutual, responsible value creation, including the implementation of sustainable and entrepreneurial innovation. "
    },
    {
      "number": 10,
      "text": "Communicate transdisciplinary ideas and solutions succinctly and persuasively using appropriate modalities. "
    },
    {
      "number": 11,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well-considered values that enable greater purpose and inclusivity. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b85d6b6b47f22650a31de422036d43d3"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nAdmission to the combined degree is on merit according to the admissions policy for the Bachelor of Design in Visual Communication.\n\nUTS: Design, Architecture and Building may consider applications based on the results of the Special Tertiary Admissions Test (STAT) if students lack academic qualifications but have extensive professional experience. The STAT is conducted through the Universities Admissions Centre.\n\nStudents must refer to the inherent requirements for all degrees offered by Design and Architecture in the Faculty of Design, Architecture and Building.\n\nNon-current school leavers are selected on the basis of academic merit or on the basis of portfolio and interview rank.\n\nApplicants are advised to submit an optional portfolio by Tuesday 31 October 2017.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 80; Admission requirements for Chinese students (Gaokao score out of 750): 487; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13; Admission requirements for Indian students (ISC): 83; Admission requirements for students with IB or Predicted IB: 28/33 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 10; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1160; Admission requirements for UTS Foundation Studies students: 6.9",
  "career_options": "There are many career options in a range of fields for graduates, such as digital media, publication designer, graphic designer, interaction designer, interactive media designer, web designer, branding specialist, art director, motion graphics designer, advertising, illustrator, and exhibition designer. Graduates are also equipped with the skills to become writers, researchers, editors and critics, and to apply design thinking in a non-design industry business.\n\nBy being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "Students must complete 240 credit points, comprising 144 credit points in visual communication and 96 credit points in creative intelligence and innovation. The creative intelligence and innovation subjects are undertaken in accelerated form within July and Summer sessions during the first three years of study, and through one full year of study after completion of the professional degree. The Bachelor of Creative Intelligence and Innovation is not offered as a separate degree, but is completed only in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10324.html",
    "crawled_at": "2025-11-10T04:00:00.365930",
    "csv_source": "merged_Admission_Courses.csv"
  }
}