{
  "course_code": "C10126",
  "course_name": "Bachelor of Science Bachelor of Laws",
  "credit_points": "240 Credit points",
  "cricos_code": "009473E",
  "overview": "This degree addresses the increasing need for scientific expertise among lawyers.\n\nWith the Bachelor of Laws, students explore the common law and the broader Australian legal system before building specialist expertise through electives and majors. These include biomedical law, bioethics, and intellectual property law, or the Legal Futures and Technology major, which provides an intensive exploration of emerging technologies that are shaping the legal sector. With the Bachelor of Science, students study the fundamentals of science before choosing a major in either nanotechnology, medical science, biotechnology or mathematics, or using their electives to build a degree that reflects their personal interests.\n\nThis course meets the academic requirements for admission to practise law in NSW. Graduates possess an understanding of the law in the context of research and industrial and commercial enterprise, making them ready for specialist legal careers in areas such as patent, environmental or medical law.",
  "awards": [
    "Bachelor of Science in (name of Science major) (BSc) Bachelor of Laws (LLB)"
  ],
  "faculty": [
    "Law",
    "Science"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "10",
  "course_fee": "22750",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609060",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).\n\nDepending on the science specialisation and subjects chosen, graduates may be eligible for admission to the relevant scientific professional organisation.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and apply a broad and coherent body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in law to construct effective legal arguments. "
    },
    {
      "number": 4,
      "text": "Generate solutions to legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Apply knowledge and skills to develop professional capabilities to work effectively with and for Indigenous peoples and communities across the law profession. "
    },
    {
      "number": 6,
      "text": "Demonstrate theoretical and technical knowledge of broad science concepts and explain specialised disciplinary knowledge. "
    },
    {
      "number": 7,
      "text": "Evaluate scientific evidence and apply effective experimental design and/or mathematical reasoning, analysis, and critical thinking to apply science and/or mathematic methodologies to real world problems. "
    },
    {
      "number": 8,
      "text": "Work autonomously or in teams to address workplace or community problems utilising best scientific practice, with consideration to safety requirements and ethical guidelines. "
    },
    {
      "number": 9,
      "text": "Design creative solutions to contemporary or complex scientific issues by incorporating innovative methods, reflective practices, and self-directed learning. "
    },
    {
      "number": 10,
      "text": "Present and communicate complex ideas and justifications using appropriate communication approaches from a variety of methods (oral, written, visual) to communicate with discipline experts, scientists, industry, and the general public. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 91; Admission requirements for Chinese students (Gaokao score out of 750): 543; Admission requirements for students with GCE A Levels: 12; Admission requirements for Hong Kong students (HKDSE): 20; Admission requirements for Indian students (AISSC): 16.5; Admission requirements for Indian students (ISC): 90; Admission requirements for students with IB or Predicted IB: 33/38 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 16; Admission requirements for Singaporean students (A Level): 12; Admission requirements for USA students (SAT 1): 1270; Admission requirements for UTS Foundation Studies students: 7.6",
  "career_options": "Career options include positions in the law (in areas where strong scientific backgrounds are valued, such as conservation and resource management), climate change advisory roles, defence technologies, environmental pollution regulation, finance, human health, industrial and occupational health and safety, pharmaceutical and biotechnological research and development, and scientific patents.",
  "course_structure": "The course comprises a total of 240 credit points and allows students to graduate with the separate degrees of Bachelor of Science (BSc) and Bachelor of Laws (LLB). The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe science component comprises 96 credit points of core science subjects taken from one of 10 specified majors representing different science disciplines.\n\nStudents graduate from the BSc independently from the LLB. However, to be eligible for graduation from the BSc students must complete one of the 96-credit-point UTS: Science majors plus at least 96 credit points of Bachelor of Law subjects.\n\nGraduation from the science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Science prior to completion of the law component of the combined degree must apply for transfer to the Bachelor of Science (C10242) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nSimilarly, a student can graduate from the law component of the combined degree prior to completion of the science component, but if they wish to continue with the science component, they must apply for transfer to the Bachelor of Science (C10242) single degree program where they need to complete all requirements for the stand-alone single degree version.\n\nFor a current listing of subjects in each course refer to the study package directory.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10126.html",
    "crawled_at": "2025-11-10T05:01:37.861804",
    "csv_source": "merged_Admission_Courses.csv"
  }
}