{
  "course_code": "C10376",
  "course_name": "Bachelor of Communication (Journalism) Bachelor of Creative Intelligence and Innovation",
  "credit_points": null,
  "cricos_code": "087780C",
  "overview": "For those interested in investigating world issues like politics, climate change or global relations, and sharing them with the public, journalism is an exciting and broad career option. It combines skills in writing, production, research and critical thinking to develop students’ capacities to frame world issues and affairs in accessible and relevant ways. UTS teaches journalism on the principle that it is a public good, and that any functional society requires a free and robust media. We encourage our graduates to be critical thinkers and train them in the ethical, intellectual, and political foundations needed to start their professional lives.\n\nTaking a transdisciplinary approach, the Bachelor of Creative Intelligence and Innovation utilises multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals, equipping graduates to address the wicked problems, complex challenges and untapped opportunities in today's world.\n\nSituated in the heart of Sydney in close proximity to the Australian Broadcasting Corporation (ABC), the Bachelor of Communication (Journalism) is a practice-based course, providing opportunities to engage with real reporting through UTS Central News and industry leaders like the ABC, The Guardian and more. The Bachelor of Communication (Journalism) gives students a crucial understanding of the role journalists play in a democracy, with journalism providing a forum for public debate and giving voice to all communities. Through hands-on practice, students also gain the skills in production, digital content creation, news reporting and analysis and writing required to excel in this diverse industry. These skills can be applied in various media platforms, including online, audio, television, video, print and social media.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of the combined degree also gain leading edge capabilities that are highly valued in the globalised world, including dealing with critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work on their own across disciplines. These creative intelligence competencies enable graduates to navigate a rapidly changing world.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "8*",
  "course_fee": "23220",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of Music and Sound Design, Bachelor of Communication (Media Arts and Production), Bachelor of Communication (Journalism), Bachelor of Animation Production Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nAdmission to the combined degree is on merit according to the admissions policy for the Bachelor of Communication (Journalism) (C10361).\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 76; Admission requirements for Chinese students (Gaokao score out of 750): 474; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11.5; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 26/31 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1130; Admission requirements for UTS Foundation Studies students: 6.7",
  "career_options": "To increase career flexibility, students can add a second major from five of the other majors offered in the Bachelor of Communication, and build further skills and portfolios that equip them for a range of work options in media and communication. These courses give students practical and transferrable skills for the expanding media industries.\n\nGraduates leave with access to many career options, including reporter, producer, editor, social media editor, sub-editor, feature and freelance journalist, investigative journalist, researcher, and print, broadcast and online media content producer. In areas related to journalism, graduates may wish to pursue roles such as media advisors, communication consultants, content producers, or work in government and non-government organisations in a communication role.\n\nBy being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "Students must complete 240 credit points consisting of 24 credit points of core subjects, a 48-credit-point major, a potential 48-credit-point second major, 24 credit points of electives and a 96-credit-point creative intelligence and innovation core.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10376.html",
    "crawled_at": "2025-11-10T03:35:38.160007",
    "csv_source": "merged_Admission_Courses.csv"
  }
}