{
  "course_code": "C10359",
  "course_name": "Bachelor of Communication (Digital and Social Media) Bachelor of Creative Intelligence and Innovation",
  "credit_points": null,
  "cricos_code": "088069G",
  "overview": "One of the first communication courses to focus on social media and digital technologies, the Bachelor of Communication (Digital and Social Media) at UTS ensures students become capable practitioners of the modern formats of digital communication. This rapidly evolving industry requires workers to be technologically literate, culturally aware, and innovative, with an ability to analyse and develop solutions to problems using digital media technologies. In the course, students are introduced to key debates around the role of social media as a communication tool, and its prevalence in day-to-day affairs. They also develop transferable, practical skills in social media management, user experience (UX) and user interface design (UI), and data visualisation and analysis.\n\nTaking a transdisciplinary approach, the Bachelor of Creative Intelligence and Innovation utilises multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals, equipping graduates to address the wicked problems, complex challenges and untapped opportunities in today's world.\n\nThrough case study analysis and applied learning, the Bachelor of Communication (Digital and Social Media) offers a comprehensive understanding of digital and social media as both a social phenomenon and future career pathway. Students focus on practical exercises to develop user engagement strategies, create prototypes for app development, and understand the intricacies of social media communication. By the end of the course, students will have built a sizeable portfolio of work to show to employers and assist their entry into a large job market.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of the combined degree also gain leading edge capabilities that are highly valued in the globalised world, including dealing with critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work on their own, across and between other disciplines. These creative intelligence competencies enable graduates to navigate across a rapidly accelerating world of change.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "8*",
  "course_fee": "20200",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Communication Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nAdmission to the combined degree is on merit according to the admissions policy for the Bachelor of Communication (Digital and Social Media).\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 73; Admission requirements for Chinese students (Gaokao score out of 750): 465; Admission requirements for students with GCE A Levels: 7; Admission requirements for Hong Kong students (HKDSE): 14; Admission requirements for Indian students (AISSC): 10; Admission requirements for Indian students (ISC): 78; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 7; Admission requirements for Singaporean students (A Level): 7; Admission requirements for USA students (SAT 1): 1110; Admission requirements for UTS Foundation Studies students: 6.5",
  "career_options": "To increase career flexibility, students can add a second major from five of the other majors offered in the Bachelor of Communication, and build further skills and portfolios that equip them for a range of work options in media and communication. These courses give students practical and transferrable skills for the expanding media industries.\n\nCareers in the growth area of digital and social media are far-reaching and present in many industries, from small businesses to large corporations, in both freelance and in-house digital marketing departments. Job options include social media manager, UX/UI designer, digital campaign manager, prototype designer, digital entrepreneur, digital marketing specialist, policy analyst, communications officer, and more.\n\nBy being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "Students must complete 240 credit points consisting of 24 credit points of core subjects, a 48-credit-point major, a potential 48-credit-point second major, 24 credit points of electives and a 96-credit-point creative intelligence and innovation core.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10359.html",
    "crawled_at": "2025-11-10T03:35:31.774805",
    "csv_source": "merged_Admission_Courses.csv"
  }
}