{
  "course_code": "C10352",
  "course_name": "Bachelor of Advanced Science Bachelor of Creative Intelligence and Innovation",
  "credit_points": "240 Credit points",
  "cricos_code": "088064A",
  "overview": "The Bachelor of Advanced Science is no ordinary science degree. Designed for high achievers, it equips students with expertise in one of three disciplines at the forefront of contemporary scientific endeavour. Whether they’re working towards careers in medicine, or they want to learn at the cutting edge of pharmaceutical or quantum sciences, students emerge ready to respond to the complex challenges that are shaping their future profession.\n\nTaking a transdisciplinary approach, the Bachelor of Creative Intelligence and Innovation utilises multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals, equipping graduates to address the wicked problems, complex challenges and untapped opportunities in today's world.\n\nThe flexibility of this course allows students to either specialise in a specific professional area or develop skills and knowledge in a range of scientific disciplines. All majors aim to produce professional scientists with a thorough grounding in theory, and highly adaptable and practical scientific, experimental and computational skills relevant to the discipline chosen.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of the combined degree also gain leading edge capabilities that are highly valued in the globalised world, including dealing with critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, as well as the ability to work on their own, across and between other disciplines. These creative intelligence competencies enable graduates to navigate across a rapidly changing world.",
  "awards": [
    "Bachelor of Advanced Science (BAdvSc) Bachelor of Creative Intelligence and Innovation (BCIInn)"
  ],
  "faculty": [
    "ScienceTD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8*",
  "course_fee": "23560",
  "course_intake": "Feb",
  "uac_codes": [
    "609590",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Explain how the applications of scientific disciplinary knowledge can be integrated as advances relevant to different scientific topics. "
    },
    {
      "number": 2,
      "text": "Design scientific experiments to collect, accurately record data that can be critically analysed and applied to real-world scientific questions. "
    },
    {
      "number": 3,
      "text": "Evaluate ethical constraints and limitations of data collection and analysis whilst using appropriate scientific approaches to solve global problems and engage in decision making. "
    },
    {
      "number": 4,
      "text": "Reflect upon, independently evaluate, and critically appraise current sources of information from various disciplines to develop innovative solutions to real world problems. "
    },
    {
      "number": 5,
      "text": "Effectively communicate scientific knowledge to a range of audiences while using a variety of appropriate methods and media. "
    },
    {
      "number": 6,
      "text": "Acquire and apply knowledge of Indigenous Australian contexts to inform professional capabilities to work effectively with and for, Indigenous Australians within scientific contexts. "
    },
    {
      "number": 7,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints. "
    },
    {
      "number": 8,
      "text": "Identify, create, and employ a range of appropriate creative intelligence methods and boundary‐crossing methodologies to construct and solve problems and generate transformative possibilities. "
    },
    {
      "number": 9,
      "text": "Practice mutual, responsible value creation, including the implementation of sustainable and entrepreneurial innovation. "
    },
    {
      "number": 10,
      "text": "Communicate transdisciplinary ideas and solutions succinctly and persuasively using appropriate modalities. "
    },
    {
      "number": 11,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well‐considered values that enable greater purpose and inclusivity. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Pharmaceutical Sciences, Biology sub-major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/abca272f47b22650a31de422036d4351"
    },
    {
      "name": "Pharmaceutical Sciences, Chemistry sub-major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/ebca272f47b22650a31de422036d436b"
    },
    {
      "name": "Pharmaceutical Sciences, Electives, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/e3ca272f47b22650a31de422036d4392"
    },
    {
      "name": "Pre-medicine, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/2fca272f47b22650a31de422036d4336"
    },
    {
      "name": "Quantum Technology, Engineering sub-major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/e3ca272f47b22650a31de422036d43a0"
    },
    {
      "name": "Quantum Technology, Quantum Computing and Communications sub-major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/bbca272f47b22650a31de422036d43ed"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 87.75; Admission requirements for Chinese students (Gaokao score out of 750): 510; Admission requirements for students with GCE A Levels: 10.5; Admission requirements for Hong Kong students (HKDSE): 19; Admission requirements for Indian students (AISSC): 15.5; Admission requirements for Indian students (ISC): 88; Admission requirements for students with IB or Predicted IB: 32/37 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 14; Admission requirements for Singaporean students (A Level): 10.5; Admission requirements for USA students (SAT 1): 1230; Admission requirements for UTS Foundation Studies students: 7.3",
  "career_options": "By being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "Students must complete 240 credit points. The Advanced Science component consists of 144 credit points, made up of 18 credit points of core subjects, a 102-credit-point major (pre-medicine or pharmaceutical science), and 24 credit points of electives.\n\nThe creative intelligence and innovation component consists of 96 credit points. The subjects are undertaken in accelerated form within July and Summer sessions during the first three years of study, and through one full year of study after completion of the professional degree. The Bachelor of Creative Intelligence and Innovation is not offered as a separate degree, but is completed only in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10352.html",
    "crawled_at": "2025-11-10T05:15:05.813287",
    "csv_source": "merged_Admission_Courses.csv"
  }
}