{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Bachelor of Languages and Cultures offers students studies in languages other than English, culture and society focused on developing their intercultural and linguistic capabilities. It also offers a capstone subject that allows students to design and carry out a small-scale research project that requires them to apply their linguistic skills and cultural knowledge.\n\nThe combined Bachelor of Nursing Bachelor of Languages and Cultures provides students with intercultural and linguistic skills that raise their awareness of the international implications of the Bachelor of Nursing, and is designed to prepare students for the role of the registered nurse. The course incorporates a range of nursing subjects as well as behavioural science, physical science, ethics and professional subjects relevant to contemporary nursing practice. Graduates of the course are capable of delivering a high standard of confident, safe and therapeutic nursing care in a variety of healthcare settings. They demonstrate nursing care that is patient-centred, informed and responsible. Students develop an understanding and awareness of a language other than English languages and another culture and refine their intercultural skills. Students also develop their professional skills in writing, research and evaluation.\n\nClinical learning is a key element of the course with clinical placements in healthcare settings occurring in every session. Learning technologies such as simulation, which is undertaken within faculty clinical practice laboratories, assist students in preparing for clinical practice. Across the course students develop an e-portfolio to showcase their abilities and facilitate career planning. In the third year of the course students are able to pursue an area of nursing interest by choosing a clinical specialty elective.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of International Studies Diploma in Languages Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "English Language requirements for the Bachelor of Nursing and selection criteria for the Enrolled Nurse program are changing for admission in 2021. For 2021 admissions requirements see 2021 Admission Requirements.\n\nBachelor of Nursing Accelerated Graduate Entry program is not available from 2021\n\nStudents admitted to the Bachelor of Nursing (standard and accelerated program) before 2016 should refer to the course description in the 2015 handbook.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe requirements specified above apply to the standard, three-year mode of the course. The accelerated program has the following requirements.\n\nHospital-trained enrolled nurses are not eligible for the accelerated course. Successful applicants are given advanced standing (eight subjects = 48 credit points) for their previous studies and are able to complete the course in two years full time with no pre-session or summer schools. Students who receive block credit of 48 credit points are not eligible for any further credit reduction against their course of study.\n\nAs part of its duty of care to patients and clients receiving health care in NSW, anyone who works in a NSW public health facility must first undergo a criminal record check. You must provide UTS with either evidence that a criminal record check has been conducted on you in your country, or a statutory declaration that you have no criminal record in your country of residence or in any country you have resided in. Participation in screening and vaccination against infectious diseases are prerequisites for students undertaking clinical placements in health facilities.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options for registered nurses include working in diverse specialty areas such as community health, critical care, intensive care, aged care, mental health, operating theatres and paediatrics. Career progression opportunities include working as a clinical nurse consultant, clinical nurse specialist, nurse educator, nurse manager, nurse practitioner or rural and remote practice nurse.",
  "course_structure": "The course comprises 144 credit points, made up of nursing theory, science and clinical practice in a range of health facilities. Full-time students study four subjects per session and part-time students study two subjects per session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10417.html",
    "crawled_at": "2025-11-10T17:52:03.077086",
    "csv_source": "merged_Admission_Courses.csv"
  }
}