{
  "course_code": "C10371",
  "course_name": "Bachelor of Communication in Digital and Social Media",
  "credit_points": "144 Credit points",
  "cricos_code": "087738E",
  "overview": "One of the first communication courses to focus on social media and digital technologies, the Bachelor of Communication (Digital and Social Media) at UTS ensures students become capable practitioners of the modern formats of digital communication. This rapidly evolving industry requires workers to be technologically literate, culturally aware, and innovative, with an ability to analyse and develop solutions to problems using digital media technologies. In the course, students are introduced to key debates around the role of social media as a communication tool, and its prevalence in day-to-day affairs. They also develop transferable, practical skills in social media management, user experience (UX) and user interface design (UI), and data visualisation and analysis.\n\nThrough case study analysis and applied learning, the Bachelor of Communication (Digital and Social Media) offers a comprehensive understanding of digital and social media as both a social phenomenon and future career pathway. Students focus on practical exercises to develop user engagement strategies, create prototypes for app development, and understand the intricacies of social media communication. By the end of the course, students have built a sizeable portfolio of work to show to employers and assist their entry into a large job market.",
  "awards": [
    "Bachelor of Communication in Digital and Social Media / Bachelor of Communication in Digital and Social Media and in (name of second stream) (BCommDigSocMed)"
  ],
  "faculty": [
    "Arts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [
    "600007",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply theoretically informed understandings of communication industries to independent and collaborative projects across a range of media. "
    },
    {
      "number": 2,
      "text": "Act as reflexive critical thinkers and innovative communication practitioners who can thoughtfully evaluate and analyse their own and others’ work. "
    },
    {
      "number": 3,
      "text": "Demonstrate a strong awareness, knowledge of, and sensitivity to, diversity and equity in global contexts. "
    },
    {
      "number": 4,
      "text": "Apply knowledge and skills related to Indigenous Australian contexts to inform capabilities to work for and with Indigenous Australians within communication industries. "
    },
    {
      "number": 5,
      "text": "Reflect upon and act ethically in the personal, political and professional contexts of civil society. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Communication Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8c9e7203837f2e10fed7d4326daad31f"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/009e7203837f2e10fed7d4326daad308"
    }
  ],
  "notes": "Students who commenced the Bachelor of Communication (Digital and Social Media) before 2022 can view their revised program of study here.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "To increase career flexibility, students can add a second major from five of the other majors offered in the Bachelor of Communication, and build further skills and portfolios that equip them for a range of work options in media and communication. These courses give students practical and transferrable skills for the expanding media industries.\n\nCareers in the growth area of digital and social media are far-reaching and present in many industries, from small businesses to large corporations, in both freelance and in-house digital marketing departments. Job options include social media manager, UX/UI designer, digital campaign manager, prototype designer, digital entrepreneur, digital marketing specialist, policy analyst, communications officer, and more.",
  "course_structure": "Students must complete 144 credit points consisting of 24 credit points of core subjects, a 48-credit-point major, a potential 48-credit-point second major, and 24 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10371.html",
    "crawled_at": "2025-11-10T17:50:22.156725",
    "csv_source": "merged_Admission_Courses.csv"
  }
}