{
  "course_code": "C10342",
  "course_name": "Bachelor of Management",
  "credit_points": "144 Credit points",
  "cricos_code": "084784A",
  "overview": "The Bachelor of Management provides integrated insights into the functions of professional enterprises in the experience economy and related digital industries. The program involves a combination of both theory and practice-oriented education, with the option of workplace internships. Offshore partnerships with established UTS university partners allow students to engage with the UTS exchange program in the later stages of their degree. Partnerships with industry bodies allow students to engage with practical projects, field visits, in-class case studies, and internships, all of which assist with prospects for graduate employment.\n\nWith majors available in digital creative enterprise, events, and sport business, the Bachelor of Management program reflects the longstanding importance of entertainment and experience-based industries in Australia's economy. These highly adaptable creative sectors reflect the globalised, digitised, and dynamic nature of work in the 21st century, around which innovation and entrepreneurship are keys.",
  "awards": [
    "Bachelor of Management (BM)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": "6 Year(s)",
  "duration_sessions": "6",
  "course_fee": "21550",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "601068",
    "Events",
    "Autumn Session, Spring Session601075",
    "Sustainability & Social Impact",
    "Autumn Session, Spring Session601080",
    "Strategic Innovation & Entrepreneurship",
    "Autumn Session, Spring Session601070",
    "Sport Business",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 2026,
      "text": "Availabilities Expand all City campus-Autumn Session City campus-Spring Session Learning outcomes Expand all Upon completion of this course, graduates will be able to:"
    },
    {
      "number": 1,
      "text": "Apply critical thinking skills to analyse contemporary managerial challenges, enabling the development of creative solutions relevant to professional practice "
    },
    {
      "number": 2,
      "text": "Develop effective communication skills to enable cogent knowledge transfer with colleagues to achieve productive project outcomes relevant to professional practice "
    },
    {
      "number": 3,
      "text": "Evaluate and implement ethical principles in respect of managing for social responsibility, including knowledge of cultural diversity, economic equity, and environmental sustainability as they relate to professional practice "
    },
    {
      "number": 4,
      "text": "Execute managerial capabilities and technical skills that are critical to professional practice in a specialised industry sector "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Digital Creative Enterprise major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f369a9474727e250413994ed036d434e"
    },
    {
      "name": "Events major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b369a9474727e250413994ed036d4330"
    },
    {
      "name": "Events major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8c79a9474727e250413994ed036d438e"
    },
    {
      "name": "Sport Business major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b769a9474727e250413994ed036d4345"
    },
    {
      "name": "Sport Business major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0c79a9474727e250413994ed036d4385"
    },
    {
      "name": "Strategic Innovation and Entrepreneurship major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/3b69a9474727e250413994ed036d4365"
    },
    {
      "name": "Strategic Innovation and Entrepreneurship major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0479a9474727e250413994ed036d4398"
    },
    {
      "name": "Sustainability and Social Impact major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/3b69a9474727e250413994ed036d437c"
    },
    {
      "name": "Sustainability and Social Impact major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8479a9474727e250413994ed036d43a2"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Career options include digital and creative technologies entrepreneur, digital marketing director, digital strategist, digital channel manager, digital content manager, online community manager, digital project manager, digital marketing director, digital and creative industry business analyst, event and festival manager, conference and meeting manager, sport event manager, event marketing, public relations and sponsorship manager, venue manager, event planner, sport management and marketing, sport event manager, venue and facility manager, sports developer, sport for development, sports administrator, athlete wellbeing, player union manager, athlete agent, sport media manager, sport sponsorship and promotions, operations manager, destination manager and marketing manager in government agencies (local, state, national and international levels).",
  "course_structure": "The course comprises a total of 144 credit points. The study components for course completion are:\n\nStudents can choose any one of the following majors: Digital Creative Enterprise, Events or Sport Business.\n\nElectives can be taken from any faculty in the university, with the approval of the owning Faculty.\n\nStudents have an option to undertake an internship program (26600 Business Internship) as an elective within the major or as a free elective. Students should not enrol in the internship subject in the last session of study to ensure that completion of required hours of work does not impact graduation and/or international students' visa conditions.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10342.html",
    "crawled_at": "2025-11-10T03:10:50.264045",
    "csv_source": "merged_Admission_Courses.csv"
  }
}