{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Bachelor of Communication (Honours) offers graduates the opportunity to pursue advanced-level study in communication, social sciences, cultural studies and creative arts. It prepares graduates for professional and/or higher degree research practice. Emphasis is placed on interdisciplinary approaches and the integration of scholarship with contemporary issues in society and culture.\n\nAn honours degree in communication provides an excellent opportunity for students to develop their research skills for professional or higher degree communication research or creative practice. Supported by leading researchers, teachers and creative practitioners, students undertake a program of advanced coursework and produce a project relevant to their academic, professional and/or creative major.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Communication Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nApplicants are admitted to the honours program only if appropriately qualified UTS: Communication academic staff are available for supervision for the thesis component.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course equips graduates with the critical thinking, creativity and professional project skills to pursue careers in a number of communication and creative industries, such as digital media, public relations, journalism, music, creative practice, policy and advocacy and writing. Graduates are also well prepared to undertake postgraduate research degrees or begin a career as a researcher. Specific career options depend on the student's core discipline.",
  "course_structure": "Students complete two 12-credit-point subjects (24 credit points) and an honours project (24 credit points). The project is based on their original work informed by theoretical study and independent research. The project may be presented in a variety of traditional and/or non-traditional formats.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09047.html",
    "crawled_at": "2025-11-10T16:51:25.427832",
    "csv_source": "merged_Admission_Courses.csv"
  }
}