{
  "course_code": "C09129",
  "course_name": "Bachelor of Mathematical Sciences (Honours)",
  "credit_points": "48 Credit points",
  "cricos_code": "106662C",
  "overview": "The Bachelor of Mathematical Sciences (Honours) is an introduction into research training and advanced study in the areas of mathematics, statistics, data science, finance, and industrial optimisation. There is a focus on independent learning fostering professional skills such as effective time management through the hands-on experience of managing a creative project. The course challenges students to exercise more initiative and independence, and to develop greater depth of knowledge and advanced analytical skills, all attributes that are highly sought after by employers.\n\nThis course focuses on the application of cutting-edge mathematical techniques to real-world problems through the completion of student led learning. Students who complete the honours degree are well prepared to enter the workforce at a high level or to undertake graduate studies.",
  "awards": [
    "Bachelor of Mathematical Sciences (Honours)"
  ],
  "faculty": [
    "Science"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "2",
  "course_fee": "21770",
  "course_intake": "Feb/ Jul",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate appraisal and interpretation of mathematical and statistical principles and concepts, with a focus on applying methodologies to solve complex problems. "
    },
    {
      "number": 2,
      "text": "Tackle the challenge of complex real-world problems in the areas of mathematical and statistical modelling by evaluating and analysing information and solutions. "
    },
    {
      "number": 3,
      "text": "Engage in work practices that demonstrate an understanding of confidentiality requirements, ethical conducts, data management, and organisation and collaborative skills in the context of applying mathematical and statistical modelling. "
    },
    {
      "number": 4,
      "text": "Find and reflect the value, integrity, and relevance of multiple sources of information to derive creative solutions, innovation and application of technologies in evaluating solutions to contemporary mathematics problems. "
    },
    {
      "number": 5,
      "text": "Identify, present complex ideas and justifications using appropriate communication approaches from a variety of methods (oral, written, visual) to communicate with mathematicians, data analysts, scientists, industry, and the general public. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nThe honours program is normally open to students who have attained at least a credit average over the final two-thirds of the undergraduate program.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Career options include data scientist, statistician, data analyst, financial analyst, market analyst, quantitative analyst (finance), mathematical modeller, business analyst, programmer in diverse industries including the financial sector, marketing, non-profit organisations, and government at local, state, and federal levels.",
  "course_structure": "The honours course requires completion of 48 credit points, consisting of advanced coursework subjects in mathematics, statistics, data science, finance, and industrial optimisation, together with a substantial research project. The project involves a major piece of independent study, providing students with the opportunity to apply the skills developed in their coursework.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09129.html",
    "crawled_at": "2025-11-10T05:11:10.863850",
    "csv_source": "merged_Admission_Courses.csv"
  }
}