{
  "course_code": "C10229",
  "course_name": "Bachelor of Games Development",
  "credit_points": "144 Credit points",
  "cricos_code": "057197M",
  "overview": "This course offers a sound education in all aspects of information technology and develops the diverse skills necessary for a career in computer games development.\n\nGraduates gain an enhanced work-ready expertise in games development, iterative design processes, team project planning and management, and games-specific technology. In doing so, graduates are equipped with a wide range of skills that can be applied to a range of IT careers, such as practical problem-solving skills, the application of theory and cutting-edge research to a real-world context, programming across a variety of languages, professional verbal and written communication, entrepreneurship, life-long learning, and an awareness of the principles of ethics in the IT sector.",
  "awards": [
    "Bachelor of Games Development (BGameDev)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": "6 Year(s)",
  "duration_sessions": "6",
  "course_fee": "25200",
  "course_intake": "Feb",
  "uac_codes": [
    "603225",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Graduates are eligible to apply for professional-level membership of the Australian Computer Society.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f645543547e07e10413994ed036d43e6"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nCurrent school leavers are advised to complete the Year 12 Engineering and IT Questionnaire. The questionnaire allows applicants to demonstrate their strong motivation to study engineering or IT at UTS and may assist applicants whose ATAR falls short of the required cut-off by up to three points.\n\nNon-current school leavers are advised to complete the employment question on their UAC application as adjustment factors may be applied on the basis of relevant work experience.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Career options include computer game developer, data analyst, game/interaction designer, generalist programmer, graphics engine specialist, IT project manager, network specialist, software engineer, web developer.",
  "course_structure": "Students are required to complete 144 credit points, comprising:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10229.html",
    "crawled_at": "2025-11-10T04:38:33.351363",
    "csv_source": "merged_Admission_Courses.csv"
  }
}