{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "040706A",
  "overview": "The Bachelor of Medical Science (Honours) includes an additional research year on top of the standard Bachelor of Medical Science curriculum, which combines the study of health science with technical, professional and communication-centric subjects taught by leading researchers and medical science practitioners\n\nAvailable to high-performing students, this leading qualification is comprised of a year-long original research project in a professional medical science environment. Students can further develop their expertise in this specialist discipline and build high-level science research skills that are highly valued by employers.\n\nWhy UTS Science? UTS Science, one of Australia’s leading university science faculties, is committed to scientific advancement that creates a more sustainable world. When students study with UTS, they join a university that delivers global impact in STEM education and research and a faculty that produces scientists with the power to transform the profession.\n\nCourse features Students complete a year-long medical science research project in a UTS laboratory or with one of the university’s numerous industry partners. They work under the guidance of leading academics and practitioners, developing research skills with real relevance to industry. They also learn to engage, partner and collaborate with working scientists and develop a range of professional capabilities, including report writing and presentation skills, that have immediate utility in a vast range of medical science and similar roles.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "2",
  "course_fee": "23220",
  "course_intake": "Feb/ Jul",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree in a relevant discipline at an appropriate level.\n\nThe honours program is normally open to students who have attained at least a credit average over the final two-thirds of the undergraduate program.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): n/a ; Admission requirements for Chinese students (Gaokao score out of 750): n/a ; Admission requirements for students with GCE A Levels: n/a ; Admission requirements for Hong Kong students (HKDSE): n/a ; Admission requirements for Indian students (AISSC): n/a ; Admission requirements for Indian students (ISC): n/a ; Admission requirements for students with IB or Predicted IB: n/a ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): n/a ; Admission requirements for Singaporean students (A Level): n/a ; Admission requirements for USA students (SAT 1): n/a ; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Graduates emerge with an industry-recognised qualification that offers both expanded career opportunities within the medical science field (see the Bachelor of Medical Science course listing for examples) and the option to pursue postgraduate research, including a master’s by research or a PhD.",
  "course_structure": "The major component of the course is a research project that extends over the full duration of the course and normally takes the form of an experimental or analytical investigation, undertaken either in the laboratory or the field. Candidates may also be required to undertake one or more critical reviews of the scientific literature in designated areas and to attend formal classes devoted to advanced coursework. The results of the project are presented in an oral seminar and in a written thesis, both of which are formally assessed.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09031.html",
    "crawled_at": "2025-11-10T13:36:47.114309",
    "csv_source": "merged_Admission_Courses.csv"
  }
}