{
  "course_code": "C10122",
  "course_name": "Bachelor of Nursing",
  "credit_points": "144 Credit points",
  "cricos_code": "019877B",
  "overview": "The UTS Bachelor of Nursing course prepares students for the exciting and challenging role of the Registered Nurse. This course is comprised of a comprehensive range of theoretical and clinical nursing subjects that together provide the knowledge, skills and professional values graduates require to provide safe, effective and compassionate nursing care. Our graduates are well prepared for clinical practice and are highly sought after for employment in a wide range of healthcare settings across Australian and internationally.\n\nThe Bachelor of Nursing course is a three year full-time (or equivalent part-time) course consisting of both theoretical and practical components. Clinical learning is a key element of the course and clinical placements in health care settings begin in the Spring session of first year and continue every session thereafter. Simulation-based learning opportunities are integral to the course and designed to assist students in preparing for clinical placements and their future role as a registered nurse. In their final year of study students can choose a clinical specialty elective, for example paediatrics, critical care, peri operative, palliative care or drug and alcohol nursing.",
  "awards": [
    "Bachelor of Nursing (BN)"
  ],
  "faculty": [
    "Health"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": "6 Year(s)",
  "duration_sessions": "6",
  "course_fee": "22460",
  "course_intake": "Feb",
  "uac_codes": [
    "606004",
    "Enrolled Nurse",
    "Autumn Session606000",
    "FT",
    "Autumn Session606001",
    "PT",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course is accredited by the Australian Nursing and Midwifery Accreditation Council (ANMAC) and approval by the Nursing and Midwifery Board of Australia (NMBA). See the faculty rules for more information.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate an ability to plan and provide safe, holistic and compassionate person-centred nursing care in partnership with individuals, respecting their lived experiences and advocating for their needs and cultural values. "
    },
    {
      "number": 2,
      "text": "Understand and apply appropriate professional codes and standards, demonstrating accountability to and responsibility for ethical, equitable, sustainable and legal nursing practice. "
    },
    {
      "number": 3,
      "text": "Source and critically analyse a range of best available evidence, including clinical expertise and individual needs, values and preferences to inform nursing practice. "
    },
    {
      "number": 4,
      "text": "Critically reflect on and learn from previous experiences to improve practice in addressing novel and emergent healthcare problems. "
    },
    {
      "number": 5,
      "text": "Effectively communicate and collaborate with individuals, peers and other professionals to facilitate person- centred care. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Nursing Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Accelerated Program (Enrolled Nurse), Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0bd963e247e76250413994ed036d4305"
    },
    {
      "name": "Accelerated Program (Enrolled Nurse), Autumn commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/87d963e247e76250413994ed036d430b"
    },
    {
      "name": "Standard Program, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8fd923e247e76250413994ed036d43d8"
    },
    {
      "name": "Standard Program, Autumn commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/cbd923e247e76250413994ed036d43fa"
    }
  ],
  "notes": "Students admitted to the Bachelor of Nursing (standard and accelerated program) before 2022 should refer to the course description in the 2020 handbook or the course description in the 2021 handbook.\n\nBachelor of Nursing course is accredited by the Australian Nursing and Midwifery Accreditation Council (ANMAC) and approval by the Nursing and Midwifery Board of Australia (NMBA). See the faculty rules for more information\n\nFor course specific information see the Nursing Inherent (Essential) Requirements Statement.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe requirements specified above apply to the standard, three-year mode of the course. The accelerated program has the following requirements.\n\nHospital-trained enrolled nurses are not eligible for the accelerated course.\n\nSuccessful applicants are given advanced standing (eight subjects = 48 credit points) for their previous studies and are able to complete the course in two years full time with no pre-session or summer schools. Students who receive block credit of 48 credit points are not eligible for any further credit reduction against their course of study.\n\nAs part of its duty of care to patients and clients receiving health care in NSW, anyone who works in a NSW public health facility must first undergo a criminal record check. You must provide UTS with either evidence that a criminal record check has been conducted on you in your country, or a statutory declaration that you have no criminal record in your country of residence or in any country you have resided in. Participation in screening and vaccination against infectious diseases are prerequisites for students undertaking clinical placements in health facilities.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a minimum score of 7.0 in each subset; or TOEFL: internet based: 94 overall, reading 24, listening 24, speaking 23, writing 27; or PTE: 65-72 overall with a minimum score of 65 in each subset; or OET: minimum score of B in each of the 4 components (listening, reading, writing and speaking).\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 70; Admission requirements for Chinese students (Gaokao score out of 750): 455; Admission requirements for students with GCE A Levels: 7; Admission requirements for Hong Kong students (HKDSE): 14; Admission requirements for Indian students (AISSC): 9; Admission requirements for Indian students (ISC): 76; Admission requirements for students with IB or Predicted IB: 24/29 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 5; Admission requirements for Singaporean students (A Level): 7; Admission requirements for USA students (SAT 1): 1090; Admission requirements for UTS Foundation Studies students: 6.2",
  "career_options": "Career options for registered nurses include diverse specialty clinical areas such as community health, critical care, general practice, aged care, mental health, operating theatres and paediatrics. Career progression opportunities include working as a clinical nurse consultant, clinical nurse specialist, nurse educator, nurse manager, nurse practitioner or rural and remote practice nurse and nurse academic and researcher (clinical and non-clinical). Note: postgraduate study is required for some of these career paths.",
  "course_structure": "The course comprises 144 credit points, made up of nursing theory, science and clinical practice in a range of health facilities. Full-time students study four subjects per session and part-time students study two subjects per session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10122.html",
    "crawled_at": "2025-11-10T04:25:55.510955",
    "csv_source": "merged_Admission_Courses.csv"
  }
}