{
  "course_code": "C10348",
  "course_name": "Bachelor of Economics",
  "credit_points": "144 Credit points",
  "cricos_code": "086359B",
  "overview": "The Bachelor of Economics offers students the analytical and quantitative skills required for an in-depth understanding of key economic principles. The degree complements this knowledge with the option of majors across selected business disciplines.\n\nThe course provides thorough training in economic analysis and its applications to economic and business policy. Throughout the course, students develop knowledge of microeconomics, macroeconomics, econometrics, behavioural economics, game theory, and other fields of Economics. A capstone subject of the degree synthesises knowledge from these areas of economics to study policy-making in real-world settings.",
  "awards": [
    "Bachelor of Economics (BEcon)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "3 Year(s)",
  "duration_parttime": "6 Year(s)",
  "duration_sessions": "6",
  "course_fee": "22460",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "601090",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Critically analyse economic problems in Australian and global society using and justifying appropriate economic concepts and frameworks "
    },
    {
      "number": 2,
      "text": "Communicate information clearly in a form appropriate for its audience "
    },
    {
      "number": 3,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal "
    },
    {
      "number": 4,
      "text": "Analyse and discuss the intended and unintended effects of economic decisions on social welfare, equity, and the environment "
    },
    {
      "number": 5,
      "text": "Combine economic analysis, data and econometric techniques to address typical complex problems faced by economists in diverse work environments "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8fcae32f47b22650a31de422036d4316"
    },
    {
      "name": "Autumn commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/cbcae32f47b22650a31de422036d4342"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/43cae32f47b22650a31de422036d4339"
    },
    {
      "name": "Spring commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0bcae32f47b22650a31de422036d4374"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 77; Admission requirements for Chinese students (Gaokao score out of 750): 478; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 16; Admission requirements for Indian students (AISSC): 11.5; Admission requirements for Indian students (ISC): 81; Admission requirements for students with IB or Predicted IB: 26/31 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1130; Admission requirements for UTS Foundation Studies students: 6.7",
  "career_options": "The Bachelor of Economics allows for a large spectrum of career options and employment opportunities in such roles as business consultant, data analyst, economist, economic analyst, econometrician, market analyst, policy analyst and researcher in various industries including banking, consulting, finance, insurance, public sector, resources sector, health, education, and others.",
  "course_structure": "The course comprises a total of 144 credit points. The study components for course completion are:\n\nStudents can choose any of the following as a second major: Finance, Human Resource Management, Management, Marketing, Business Law or Information Technology.\n\nElectives can be taken from any faculty in the university, with the approval of the owning Faculty. For more information on business electives, please see the Business Electives page.\n\nStudents have an option to undertake an internship program (26600 Business Internship) as an elective within the business major or as a free elective. Students should not enrol in internship subject in the last session of study to ensure that completion of required hours of work does not impact graduation and/or international students' visa conditions.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10348.html",
    "crawled_at": "2025-11-10T03:11:48.023283",
    "csv_source": "merged_Admission_Courses.csv"
  }
}