{
  "course_code": "C09162",
  "course_name": "Bachelor of Information Technology Bachelor of International Studies (Honours)",
  "credit_points": "240 Credit points",
  "cricos_code": "106917G",
  "overview": "The Bachelor of Information Technology Bachelor of International Studies (Honours) is an exit-point for students who have completed the International Honours pathway within the Bachelor of Information Technology Bachelor of International Studies (C10239).\n\nThis course integrates a professional degree in information technology with the study of a language and culture other than English and the opportunity for students to study overseas for up to an academic year, pursuing a major research project in a field of their choice, depending on their chosen pathway.\n\nThe information technology component provides a sound education in all aspects of computing and information technology for a career in the profession.\n\nThe international studies component offers an in-depth understanding of diverse cultures through academic learning at UTS and the host institution during study abroad.\n\nStudents choose an IT major and are allocated to a country major as part of the Bachelor of International Studies.\n\nIn the fourth year of the combined degree, International Honours students spend an academic year studying in the local language at a university in the country of their major and also complete an honours level research project under the supervision of a relevant UTS academic.\n\nEntry to the International Honours pathway is dependent on students maintaining a credit average (or higher) in both their International Studies and professional degree in their first three years of study, and on the availability of placements in particular majors.\n\nThe course adopts a practice-based approach to IT education and the course content is designed with a mix of theory and practice. As well as gaining strong technical skills in IT, students gain skills in business analysis, problem-solving, teamwork and communication. Employers look for graduates with industry experience and, in this course, students are exposed to real IT problems.\n\nThe international studies component of this course means that graduates have the added advantage of being well prepared to participate in a global workforce and a diverse range of IT careers and companies.",
  "awards": [
    "Bachelor of Information Technology (BIT) Bachelor of International Studies (Honours) (BIntSt(Hon))"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "TechnologyArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Graduates are eligible to apply for professional-level membership of the Australian Computer Society.",
  "learning_outcomes": [
    {
      "number": 7,
      "text": "Understand and engage with cultural diversities and employ effective strategies to operate within varied professional and everyday settings in Australia and internationally. (BIntStudies(Hons)) "
    },
    {
      "number": 8,
      "text": "Apply research methods and advanced theoretical knowledge to evaluate findings of complex problems in contemporary societies and cultures and conduct an independent research project. (BIntStudies(Hons)) "
    },
    {
      "number": 9,
      "text": "Communicate effectively and appropriately in an additional language for everyday and professional purposes. (BIntStudies(Hons)) "
    },
    {
      "number": 10,
      "text": "Engage critically with current issues to act in socially responsible ways in Australian and international settings. (BIntStudies(Hons)) "
    },
    {
      "number": 11,
      "text": "Communicate clearly and effectively in written and spoken language using diverse digital technologies. (BIntStudies(Hons)) "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.\n\nFor course specific information see the Bachelor of International Studies Diploma in Languages Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Depending on the major selected, career options include business analyst, network engineer, network specialist, software developer, software engineer or web developer. Graduates of this course are in high demand with technology companies and industries that use IT such as banking, construction, energy, finance, government, manufacturing, retail and transport. Options are enhanced by international experience, making students more marketable to prospective employers, including multinational companies.",
  "course_structure": "Students are required to complete 240 credit points, comprising:\n\nInformation Technology (96 credit points)\n\nThe sub-major(s) must be taken in a different field to that of the major.\n\nThe IT major is selected at the time of admission.\n\nInternational Studies (96 credit points)\n\nThe Bachelor of International Studies is completed over a minimum of three years and is not offered as a separate degree; it is completed only in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09162.html",
    "crawled_at": "2025-11-10T17:28:07.099296",
    "csv_source": "merged_Admission_Courses.csv"
  }
}