{
  "course_code": "C09091",
  "course_name": "Bachelor of Communication in Digital and Social Media Bachelor of Laws (Honours)",
  "credit_points": "240 Credit points",
  "cricos_code": "116583H",
  "overview": "This course aims to develop digital communications practitioners or lawyers who can produce high-quality outcomes in complex collaborative digital environments, especially social media contexts. It examines a communications environment where diverse media converge, and mobile and social platforms are ubiquitous, and success for individuals and organisations depends largely on their capacity to creatively adapt to the challenges of continuous transformation.\n\nThe course provides full-time study for students wishing to obtain a professional legal qualification that satisfies the academic requirements for admission as a lawyer together with the study of creative writing as a professional practice. Honours relates to the law component only and students must successfully complete both of the research subjects: 76090 Research Methodology and 76040 Research Thesis. Strong research skills are valued highly in contemporary professional practice.\n\nThe course develops a broad range of capabilities for professional practice in information and law. It is particularly relevant for imaginative, synthetic and analytical thinking and communication, as well as practical skills in digital communication across diverse technological platforms and environments. Students learn to be technologically literate, culturally sophisticated, innovative and resourceful leaders with legal knowledge and skills for the rapidly evolving digital communications industries.\n\nStudents have the opportunity to engage in deeper study of the law by studying 76090 Research Methodology and undertaking 76040 Research Thesis. This course can be a pathway to higher degree research programs.",
  "awards": [
    "Bachelor of Communication in Digital and Social Media (BCommDigSocMed) Bachelor of Laws (Honours) (LLB(Hons))"
  ],
  "faculty": [
    "LawArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission to the Supreme Court of NSW as a lawyer, provided students complete a practical legal training program, such as the Graduate Certificate in Professional Legal Practice (C11232).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and transform an advanced body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to critically analyse and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Formulate appropriate responses to problems and questions in law and execute a piece of legal scholarship, using advanced skills in legal research, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "Generate solutions to complex legal issues through effective collaboration and communicate accurately and persuasively with a variety of audiences. "
    },
    {
      "number": 5,
      "text": "Critically reflect on ethical Indigenous research practices to work with and for Indigenous peoples across the legal and community sectors. "
    },
    {
      "number": 6,
      "text": "Apply theoretically informed understandings of communication industries to independent and collaborative projects across a range of media. "
    },
    {
      "number": 7,
      "text": "Act as reflexive critical thinkers and innovative communication practitioners who can thoughtfully evaluate and analyse their own and others’ work. "
    },
    {
      "number": 8,
      "text": "Demonstrate a strong awareness, knowledge of, and sensitivity to, diversity and equity in global contexts. "
    },
    {
      "number": 9,
      "text": "Apply knowledge and skills related to Indigenous Australian contexts to inform capabilities to work for and with Indigenous Australians within communication industries. "
    },
    {
      "number": 10,
      "text": "Reflect upon and act ethically in the personal, political and professional contexts of civil society. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Arts and Social Sciences Communication Inherent (Essential) Requirements Statement and the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include specialist social media lawyer, media lawyer, intellectual property lawyer, solicitor, social media manager, barrister, digital and social media coordinator, digital consultant, communications officer, digital channels strategist, marketing technologist, legal adviser within a government department, lawyer in corporate and commercial sector, librarian, media researcher, project manager, web designer, and other diverse roles particularly in legal and business contexts.",
  "course_structure": "The course comprises 240 credit points and allows students to graduate with the separate degrees of Bachelor of Communication (Digital and Social Media) and Bachelor of Laws. The study components for course completion are as follows.\n\nThe law component of 144 credit points is made up of:\n\nThe communication component of 96 credit points is made up of:\n\nFor a current listing of subjects in each course refer to the study package directory.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c09091.html",
    "crawled_at": "2025-11-10T17:03:37.966251",
    "csv_source": "merged_Admission_Courses.csv"
  }
}