{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "102566B",
  "overview": "The Bachelor of Communication (Writing and Publishing) Master of Teaching in Secondary Education (English) offers students the knowledge and practical hands-on experience required to teach over 72,000 secondary school pupils studying English in NSW (NSW Education Standards Authority, 2021 HSC Enrolments by Course, 2021). Depending on the stream taken, students may also be able to teach the 4500 students studying Society and Culture in NSW or English language to the 25% of Australian students that have English as an Additional Language or Dialect (EALD) (NSW Education Standards Authority, 2021 HSC Enrolments by Course, 2021).\n\nThe combined \"Vertical Stack\" course (undergraduate + postgraduate degree) enables students to gain a greater depth of disciplinary knowledge in Communications (Writing and Publishing) before commencing their teaching subjects in the Master of Teaching from their second year of study. Gaining a wider and deeper understanding in their field of study gives students more confidence when they commence teaching. They enter the classroom up to date on the most current developments in the discipline, and this is highly valued by schools.\n\nThe unique vertical structure of this combined course means students do not need to meet the standard three Band 5 HSC results, including English, for admission to an initial teacher education course.\n\nTo ensure that a high quality of teachers is maintained in the education sector, students need to achieve a Credit average in the first two years of their university studies before progressing into the final years of the program.\n\nIf students do not meet the Credit average, they can still continue in the Bachelor of Communications (Writing and Publishing) and graduate with that qualification.\n\nStudents spend 80 days in one of more than 200 secondary schools across NSW. This practical experience with a trusted UTS partner school helps them gain the skills and confidence in curriculum and classroom management required for effective teaching in English (and EALD or Society and Culture if relevant), and also helps them develop personal and professional networks within and beyond education for their future career path.\n\nNot only are students accelerated in their career pathway to secondary teaching by achieving two qualifications, including one at postgraduate level, within the duration of a single undergraduate degree, they also have the benefits of a range of career options.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "8",
  "course_fee": "20200",
  "course_intake": "Feb",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "This course is accredited by the NSW Education Standards Authority (NESA) as a recognised secondary school teaching qualification. To gain employment as a teacher in NSW schools, graduands must meet the requirements of NESA, including language proficiency.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Communication Inherent (Essential) Requirements Statement and the BABEd (Primary and Secondary) and MTeach (Secondary) (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This new course replaces the Bachelor of Arts Bachelor of Education (Secondary) from 2021. Students may use the 2020?selection rank for the Bachelor of Communication (Creative Writing) as a guide. The lowest selection rank for Autumn 2020 intake was 72.95. ?",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nApplicants must submit a personal statement as part of their application.\n\nApplicants should also review the inherent requirements to ensure they are able to complete this course.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.5 overall, with a minimum of 8.0 in both the speaking and listening modules, and a reading and writing score of 7.0; or TOEFL: paper based: 610-633 overall with TWE of 5.0, internet based: 102-109 overall with a writing score of 27; or PTE: 73-78 overall with a 79 in both the speaking and listening, and a reading and writing score of 65; or C1A/C2P: 191-199 overall with 200 in both the speaking and listening, and a reading and writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 70; Admission requirements for Chinese students (Gaokao score out of 750): 455; Admission requirements for students with GCE A Levels: 7; Admission requirements for Hong Kong students (HKDSE): 14; Admission requirements for Indian students (AISSC): 9; Admission requirements for Indian students (ISC): 76; Admission requirements for students with IB or Predicted IB: 24/29 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 5; Admission requirements for Singaporean students (A Level): 7; Admission requirements for USA students (SAT 1): 1090; Admission requirements for UTS Foundation Studies students: n/a",
  "career_options": "Secondary teacher in English or EALD or Society and Culture in a public or private school, locally or internationally (subject to meeting relevant employer requirements). Graduates may also seek work as a fiction and non-fiction writer, editor, publisher, scriptwriter, literary agent, communication coordinator, arts and cultural administrator, copywriter, feature writer, publications officer, freelance writer, book marketing coordinator, digital content producer, marketing content producer for government, NGOs and cultural groups, video game writer, writer for media organisations.",
  "course_structure": "Students must complete 96 credit points of disciplinary content subjects in the Bachelor of Communication (Writing and Publishing) consisting of 24 credit points of core subjects and a 48 credit points major. Students who selected the English/Society and Culture teaching area at application undertake 24 credit points of specific subjects from the Society and Culture stream, while those who chose the English or English/English as an Additional Language/Dialect teaching areas, complete 24 credit points of Communication electives.\n\nIn the Master of Teaching in Secondary Education component students complete 96 credit points comprising 42 credit points of core subjects focused on the foundation education disciplines of learning, motivation and adolescent psychology as well as addressing the education of students with special needs; and 54 credit points of teaching methods and professional experience relating to the teaching area/s chosen at application, as well as elective subjects or, for those undertaking English/EALD, additional subjects contributing to their second teaching area.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10405.html",
    "crawled_at": "2025-11-10T13:34:31.710806",
    "csv_source": "merged_Admission_Courses.csv"
  }
}