{
  "course_code": "C10322",
  "course_name": "Bachelor of Design in Interior Architecture Bachelor of Creative Intelligence and Innovation",
  "credit_points": "240 Credit points",
  "cricos_code": "079752G",
  "overview": "With a strong emphasis on creativity and technology, the Bachelor of Design in Interior Architecture is the first university program of its kind in Australia. The course focuses on design studios that incorporate advanced communication and technology skills with innovative design thinking and practice. While interior design is an established profession, spatial design encompasses a range of connected practices that engage directly and creatively with space, from designing an exhibition to directing a performance.\n\nTaking a transdisciplinary approach, the Bachelor of Creative Intelligence and Innovation utilises multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals, equipping graduates to address the wicked problems, complex challenges and untapped opportunities in today's world.\n\nThe course equips graduates with critical thinking, spatial intelligence, creativity and the skills to practise in the expanded field of interior architecture, to take up leading roles in industry. Students focus on the complex relationships between people and space, and collaborate with architects, artists and creative directors on the spatial design of a wide range of environments including urban, retail, commercial and residential interior design.\n\nBy focusing on the high-level conceptual thinking and problem-solving practices that lead to the development of innovative, creative and entrepreneurial outcomes, students of the combined degree also gain leading edge capabilities that are highly valued in the globalised world including dealing with critical and creative thinking, invention, complexity, innovation, future scenario building and entrepreneurship, and the ability to work on their own across disciplines. These creative intelligence competencies enable graduates to navigate in a rapidly changing world.",
  "awards": [
    "Bachelor of Design in Interior Architecture (BDesign) Bachelor of Creative Intelligence and Innovation (BCIInn)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "BuildingTD",
    "School"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "8*",
  "course_fee": "20730",
  "course_intake": "Feb",
  "uac_codes": [
    "609550",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Design Institute of Australia; International Federation of Interior Architects/Designers; Interior Design/Interior Architecture Educators Association (IDEA)",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate autonomous responsibility for actions and decisions while developing an informed and ethical stance towards social, technical, and environmental practices, and recognising the importance of cultural diversity, including Indigenous, gender, and multicultural perspectives. "
    },
    {
      "number": 2,
      "text": "Collaborate effectively within teams, demonstrating leadership and the ability to communicate ideas through diverse presentation methods, contributing constructively to peer learning and critique. "
    },
    {
      "number": 3,
      "text": "Apply experimental thinking to develop an individual design approach, understand and generate design propositions for various scenarios, and initiate self-directed iterative processes. "
    },
    {
      "number": 4,
      "text": "Use communication techniques and representational methods to apply spatial design knowledge practically, with a commitment to ongoing professional development. "
    },
    {
      "number": 5,
      "text": "Independently conduct research using appropriate methodologies, analyse complex ideas, and contextualise design work within the discipline, while reflecting on and challenging theoretical speculation. "
    },
    {
      "number": 6,
      "text": "Ability to recognise cultural diversity, including Indigenous, gender and multicultural perspectives. "
    },
    {
      "number": 7,
      "text": "Identify and evaluate complex challenges by analysing system dynamics, constraints, and potential leverage points, using disciplinary perspectives, evidence, and diverse viewpoints. "
    },
    {
      "number": 8,
      "text": "Identify, create, and employ a range of appropriate creative intelligence methods and boundary-crossing methodologies to construct and solve problems and generate transformative possibilities. "
    },
    {
      "number": 9,
      "text": "Practice mutual, responsible value creation, including the implementation of sustainable and entrepreneurial innovation. "
    },
    {
      "number": 10,
      "text": "Communicate transdisciplinary ideas and solutions succinctly and persuasively using appropriate modalities. "
    },
    {
      "number": 11,
      "text": "Develop reflexive connection with an evolving self, demonstrating ethical and intellectual positions that reflect well-considered values that enable greater purpose and inclusivity. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Architecture stream - Autumn commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f2f5cd1f838c3290fed7d4326daad3d5"
    },
    {
      "name": "Interior Architecture stream - Autumn commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8ff5015f838c3290fed7d4326daad318"
    },
    {
      "name": "Landscape Architecture stream - Autumn commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/c7f5cd1f838c3290fed7d4326daad3f1"
    }
  ],
  "notes": "The minimum selection rank requirements for the Bachelor of Design in Interior Architecture Bachelor of Creative Intelligence and Innovation increased in 2022 as a result of the introduction of the Early Entry Program and special provisions for COVID-impacted HSC cohorts. Note that selection ranks are reflective of the demand for that year and may differ from year to year. The published ranks should be used an indicative guide only for 2023 intake.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nAdmission to the combined degree is on merit according to the admissions policy for the Bachelor of Design in Interior Architecture.\n\nUTS: Design, Architecture and Building may consider applications based on the results of the Special Tertiary Admissions Test (STAT) if students lack academic qualifications but have extensive professional experience. The STAT is conducted through the Universities Admissions Centre.\n\nStudents must refer to the inherent requirements for all degrees offered by Design and Architecture in the Faculty of Design, Architecture and Building.\n\nNon-current school leavers are selected on the basis of academic merit or on the basis of portfolio and interview rank.\n\nStudents must refer to the portfolio eligibility for the faculty’s consideration in order to get a place.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 80; Admission requirements for Chinese students (Gaokao score out of 750): 487; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13; Admission requirements for Indian students (ISC): 83; Admission requirements for students with IB or Predicted IB: 28/33 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 10; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1160; Admission requirements for UTS Foundation Studies students: 6.9",
  "career_options": "Career options include commercial and residential interior design, interactive and responsive environment design, museum and exhibition design, production design for film and television, theatre and performance design, and visual and spatial branding.\n\nBy being creative thinkers, initiators of new ideas, scenario planners, global strategists, open network designers or sustainable futures innovators within their chosen field of study, graduates maximise the potential of their chosen profession, making them highly sought after graduates with the ability to identify and develop solutions to some of the most complex issues that face their disciplines and society.",
  "course_structure": "Students must complete 240 credit points, comprising 144 credit points in interior architecture and 96 credit points in creative intelligence and innovation. The creative intelligence and innovation subjects are undertaken in accelerated form within July and Summer sessions during the first three years of study, and through one full year of study after completion of the professional degree. The Bachelor of Creative Intelligence and Innovation is not offered as a separate degree, but is completed only in combination with the professional degree program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10322.html",
    "crawled_at": "2025-11-10T03:57:53.337402",
    "csv_source": "merged_Admission_Courses.csv"
  }
}