{
  "course_code": "C10163",
  "course_name": "Bachelor of Medical Science Bachelor of Business",
  "credit_points": "192 Credit points",
  "cricos_code": "040712C",
  "overview": "The Bachelor of Medical Science Bachelor of Business is designed to produce graduates who are prepared for scientific practice or business and management in health and medical businesses or institutions. Medical Scientists with Business strengths are the leaders of creating, and developing and taking to the public or market, solutions to health and medical problems. Medical Scientists careers are dynamic and involve an exciting range of professions from research and development, business, writing and implementing policy and practice in the medical and health sciences, and communicating science. In the medical scientists component of this degree students choose to major in Medical and Health-related Sciences or Pathology, allowing them to have speciality relevant to their career choices and interests. In the Medical and Health-related Science major students learn the body through the study of tissues, organs and cellular facets both in health and disease, medical devices, how medicines work, as well as public health policies and clinical trials. In the Pathology major students learn how diseases trigger biochemical or cellular changes in the body and how to best diagnose and treat these diseases. Students learn by applying and investigating scientific approaches in world class laboratories with up-to-date scientific technologies and equipment in line with those used in the industry. This hands-on learning is accompanied by development of professional skills such as communication, problem solving, critical thinking, and innovation that means the students are ideally placed for a range of professions.\n\nThe aim of this combined degree is to produce graduates with professional qualifications in both medical science and business, to enable them to practise in both areas. Graduates who can cross the divide between medical science and business are highly sought after by employers because they not only have scientific and business skills, but also have transferable skills such as analytical, critical thinking and communication skills.",
  "awards": [
    "Bachelor of Medical Science",
    "in (name of major) Bachelor of Business (BBus)"
  ],
  "faculty": [
    "Science",
    "Business"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8**",
  "course_fee": "23220",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609175",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Depending on disciplines chosen, students may be eligible for entry to the relevant professional associations. Refer to the Bachelor of Business (C10026) for details on professional recognition of that award.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Explain how diseases arise and disrupt normal physiological function and appraise the technologies used to diagnose, treat, and cure diseases. "
    },
    {
      "number": 2,
      "text": "Collect, accurately record, interpret, and draw conclusions from data to solve real-world medical problems, and infer how the results of medical research can be translated to improve patient outcomes. "
    },
    {
      "number": 3,
      "text": "Evaluate ethical, social, and cultural issues in medical science in local and global contexts and work responsibly, safely and with respect to diversity and regulatory frameworks. "
    },
    {
      "number": 4,
      "text": "Reflect upon, independently evaluate, and critically appraise current evidence-based literature to identify medical problems or unmet medical needs and creatively translate medical research results to improve the clinical care of patients. "
    },
    {
      "number": 5,
      "text": "Effectively communicate medical science knowledge and research information, and the importance thereof, to a range of audiences using a variety of modes, independently and collaboratively. "
    },
    {
      "number": 6,
      "text": "Acquire or Develop knowledge of Indigenous Australian contexts to inform professional cultural capability to work effectively with and for, Indigenous Australians within the medical science context. "
    },
    {
      "number": 7,
      "text": "Apply evidence, creativity and critical reasoning to solve business problems "
    },
    {
      "number": 8,
      "text": "Communicate information clearly in a form appropriate for its audience "
    },
    {
      "number": 9,
      "text": "Demonstrate ability to work independently and with others as a member of a team to achieve an agreed goal "
    },
    {
      "number": 10,
      "text": "Make judgements and business decisions consistent with the principles of social responsibility and inclusion "
    },
    {
      "number": 11,
      "text": "Apply technical and professional skills to operate effectively in business "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Medical and Health-related Sciences, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b14de36b47f22650a31de422036d437b"
    },
    {
      "name": "Pathology, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/b54de36b47f22650a31de422036d4365"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 80; Admission requirements for Chinese students (Gaokao score out of 750): 487; Admission requirements for students with GCE A Levels: 9; Admission requirements for Hong Kong students (HKDSE): 17; Admission requirements for Indian students (AISSC): 13; Admission requirements for Indian students (ISC): 83; Admission requirements for students with IB or Predicted IB: 28/33 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 10; Admission requirements for Singaporean students (A Level): 9; Admission requirements for USA students (SAT 1): 1160; Admission requirements for UTS Foundation Studies students: 6.9",
  "career_options": "Graduates are able to tap into both industries and job markets. Examples include hospital scientist, lab and medical pathologist, medical research and development, medical and pharmaceutical business roles, clinical trial and tissue bank roles, medical or science writer, marketer, analyst, and economist. Potential employers include IT companies, business consultancy firms, financial institutions, market research firms, risk management organisations, government, and regulatory agencies.",
  "course_structure": "Students are required to complete 192 credit points of study, comprising 96 credit points of medical science subjects and 96 credit points of business subjects. Refer to the Bachelor of Business (C10026) entry for the major areas of study.\n\nGraduation from the medical science component of the combined degree is not possible prior to completion of all components of the combined degree. Students wishing to graduate with a Bachelor of Medical Science prior to completion of the business component of the combined degree must apply for transfer to the Bachelor of Medical Science (C10184) single degree program where they must complete all requirements for the stand-alone single degree version.\n\nSimilarly, if a student wishes to graduate from the business component of the combined degree prior to completion of the science component they must apply for transfer to the Bachelor of Business (C10026) single degree program where they must complete all requirements for the stand-alone single degree version.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10163.html",
    "crawled_at": "2025-11-10T03:24:19.090944",
    "csv_source": "merged_Admission_Courses.csv"
  }
}