{
  "course_code": "C10399",
  "course_name": "Bachelor of Science Bachelor of Sustainability and Environment",
  "credit_points": "192 Credit points",
  "cricos_code": "102816M",
  "overview": "The Bachelor of Science Bachelor of Sustainability & Environment combines a focus on ecosystem protection and management with broad knowledge and professional skills to work within the social, economic and regulatory systems that intersect with and impact ecosystems. Students choose a major in either environmental or marine biology. Studies focus on the foundational components of natural systems, how these systems work, and how detrimental impacts on them can be assessed and recovered.\n\nThis course gives students a thorough understanding of the way living organisms function in terrestrial and aquatic environments, acquisition of skills to study them and the ability to detect and assess detrimental effects on the environment such as climate change, pollution and human resource use. Students learn these skills and concepts through a dynamic combination of theory, field and laboratory experiences. Excursions and studios with industry and community partners undertaken the latter years of study provide opportunities to consolidate knowledge, apply new skills to creative solutions and learn through experience.",
  "awards": [
    "Bachelor of Science (BSc) Bachelor of Sustainability and Environment (BSustEnv)"
  ],
  "faculty": [
    "ScienceArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8",
  "course_fee": "23220",
  "course_intake": "Feb",
  "uac_codes": [
    "609803",
    "Autumn Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate theoretical and technical knowledge of broad science concepts and explain specialised disciplinary knowledge. "
    },
    {
      "number": 2,
      "text": "Evaluate scientific evidence and apply effective experimental design and/or mathematical reasoning, analysis, and critical thinking to apply science and/or mathematic methodologies to real world problems. "
    },
    {
      "number": 3,
      "text": "Work autonomously or in teams to address workplace or community problems utilising best scientific practice, with consideration to safety requirements and ethical guidelines. "
    },
    {
      "number": 4,
      "text": "Design creative solutions to contemporary or complex scientific issues by incorporating innovative methods, reflective practices, and self-directed learning. "
    },
    {
      "number": 5,
      "text": "Present and communicate complex ideas and justifications using appropriate communication approaches from a variety of methods (oral, written, visual) to communicate with discipline experts, scientists, industry, and the general public. "
    },
    {
      "number": 6,
      "text": "Develop knowledge of Indigenous Australian contexts to inform professional cultural capabilities to work effectively with and for, Indigenous Australians within scientific contexts. "
    },
    {
      "number": 7,
      "text": "Work individually and in multi-disciplinary teams to design, implement, and evaluate sustainability initiatives. "
    },
    {
      "number": 8,
      "text": "Devise creative and evidence-based solutions to environmental, economic and social sustainability issues through critical research. "
    },
    {
      "number": 9,
      "text": "Synthesise knowledge from different geographical and socio-political scales and systems to understand sustainability issues across time and potential futures "
    },
    {
      "number": 10,
      "text": "Apply knowledge and skills relating to Indigenous Australian contexts to inform ethical professional practices to work for and with Indigenous Australians within sustainability and environmental professions. "
    },
    {
      "number": 11,
      "text": "Demonstrate ethically engaged citizenship by actively advocating for and implementing sustainability practices in both professional and personal contexts. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of Global Studies, Bachelor of Sustainability and Environment and Bachelor of Criminology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Environmental Biology, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/033eb47147e47e10413994ed036d4349"
    },
    {
      "name": "Marine Biology, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/833eb47147e47e10413994ed036d4391"
    }
  ],
  "notes": "This is a new course from 2021. Students may use the 2020 selection rank for the Bachelor of Science as a guide. The lowest selection rank for Autumn 2020 intake for the Bachelor of Environmental Biology was 73.40 and the Bachelor of Marine Biology was 79.90.",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Careers are usually determined by the professional degree and span roles in industry, science, public and private sectors, academia, business. Roles include Sustainability Project Officer, Sustainability Consultant, Environmental Scientist, Sustainability Director, Social and Environmental Impact Lead, Corporate Social Responsibility Manager, Communication and Stakeholder Engagement Lead, Business Analyst, Environmental Compliance Specialist, Environmental Planner, Sustainability Evaluation Lead",
  "course_structure": "Students are required to complete a total of 192 credit points, comprising 96 credit points of science subjects and 96 credit points of Sustainability and Environment subjects.\n\nGraduation with a Bachelor of Sustainability and Environment is only possible as part of a combined degree. Students may apply for an Internal Course Transfer to graduate with a Bachelor of Science, but they must satisfy all applicable course requirements.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10399.html",
    "crawled_at": "2025-11-10T05:21:20.253931",
    "csv_source": "merged_Admission_Courses.csv"
  }
}