{
  "course_code": "C10412",
  "course_name": "Bachelor of Management Bachelor of Sustainability and Environment",
  "credit_points": "192 Credit points",
  "cricos_code": "102819H",
  "overview": "The Bachelor of Management Bachelor of Sustainability and Environment provides students with a strong foundation in management studies while developing key skills required to operate successfully in contemporary organisations. These attributes include collaborative teamwork, business design, innovation, and entrepreneurship, as well as the multidisciplinary knowledge base required to understand sustainability within the green economy. During the first two years, students explore management studies from professional and industry perspectives while building their knowledge of sustainability as a scientific, legal, social, and ethical domain. Across the remaining years of this degree, students develop in-depth knowledge in one of the management majors (Events, Sport Business, or Digital Creative Enterprise) while working with industry and community partners in studio subjects to address real-world sustainability issues.\n\nStudents develop a combination of professional business skills and knowledge on environmental, economic, social, and cultural sustainability through a business specialisation, internship-like experiences and problem-based learning within the Sustainability and Environment core subjects.",
  "awards": [
    "Bachelor of Management (BM) Bachelor of Sustainability and Environment (BSustEnv)"
  ],
  "faculty": [
    "BusinessArts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Undergraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": "8 Year(s)",
  "duration_sessions": "8",
  "course_fee": "21550",
  "course_intake": "Feb/ Jul",
  "uac_codes": [
    "609801",
    "Autumn Session, Spring Session"
  ],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply critical thinking skills to analyse contemporary managerial challenges, enabling the development of creative solutions relevant to professional practice "
    },
    {
      "number": 2,
      "text": "Develop effective communication skills to enable cogent knowledge transfer with colleagues to achieve productive project outcomes relevant to professional practice "
    },
    {
      "number": 3,
      "text": "Evaluate and implement ethical principles in respect of managing for social responsibility, including knowledge of cultural diversity, economic equity, and environmental sustainability as they relate to professional practice "
    },
    {
      "number": 4,
      "text": "Execute managerial capabilities and technical skills that are critical to professional practice in a specialised industry sector "
    },
    {
      "number": 5,
      "text": "Acquire and apply knowledge of Indigenous Australian contexts to inform professional capabilities to work with and for Indigenous Australians across management professions "
    },
    {
      "number": 6,
      "text": "Work individually and in multi-disciplinary teams to design, implement, and evaluate sustainability initiatives. "
    },
    {
      "number": 7,
      "text": "Devise creative and evidence-based solutions to environmental, economic and social sustainability issues through critical research. "
    },
    {
      "number": 8,
      "text": "Synthesise knowledge from different geographical and socio-political scales and systems to understand sustainability issues across time and potential futures. "
    },
    {
      "number": 9,
      "text": "Apply knowledge and skills relating to Indigenous Australian contexts to inform ethical professional practices to work for and with Indigenous Australians within sustainability and environmental professions "
    },
    {
      "number": 10,
      "text": "Demonstrate ethically engaged citizenship by actively advocating for and implementing sustainability practices in both professional and personal contexts. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Bachelor of Global Studies, Bachelor of Sustainability and Environment and Bachelor of Criminology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Bachelor of Management major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/89d217854789be90413994ed036d43f3"
    },
    {
      "name": "Event major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/1dd257854789be90413994ed036d431a"
    },
    {
      "name": "Bachelor of Management, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/e5d257854789be90413994ed036d43c8"
    },
    {
      "name": "Event Major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f1d257854789be90413994ed036d43e3"
    },
    {
      "name": "Sport Business major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/d5d257854789be90413994ed036d4365"
    },
    {
      "name": "Sport Business major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/61d257854789be90413994ed036d43d6"
    },
    {
      "name": "Strategic Innovation and Entrepreneurship major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/11d257854789be90413994ed036d438b"
    },
    {
      "name": "Strategic Innovation and Entrepreneurship major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f1d257854789be90413994ed036d43fd"
    },
    {
      "name": "Sustainability and Social Impact major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/add257854789be90413994ed036d43af"
    },
    {
      "name": "Sustainability and Social Impact major, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/75d297854789be90413994ed036d430a"
    }
  ],
  "notes": "This is a new course from 2021. Students may use the 2020 selection rank for the Bachelor of Management as a guide. The lowest selection rank for Autumn 2020 intake for the respective majors are:\n\n80.40 (Digital Creative Enterprise); 81.15 (Events); 80.00 (Sport Business)",
  "admission_requirements": "Applicants must have completed an Australian Year 12 qualification, Australian Qualifications Framework Diploma, or equivalent Australian or overseas qualification at the required level.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): 75; Admission requirements for Chinese students (Gaokao score out of 750): 471; Admission requirements for students with GCE A Levels: 8; Admission requirements for Hong Kong students (HKDSE): 15; Admission requirements for Indian students (AISSC): 11; Admission requirements for Indian students (ISC): 80; Admission requirements for students with IB or Predicted IB: 25/30 ; Admission requirements for Malaysian students (STPM with 3 AL Subjects): 8; Admission requirements for Singaporean students (A Level): 8; Admission requirements for USA students (SAT 1): 1120; Admission requirements for UTS Foundation Studies students: 6.6",
  "career_options": "Career options include digital and creative technologies entrepreneur, digital marketing director, digital strategist, digital channel management, digital content management, online community management, digital project management, digital marketing director, digital and creative industry business analyst, event and festival management, conference and meeting management, sport event management, event marketing, public relations and sponsorship management, venue management, event planning, sport management and marketing, sport event management, venue and facility management, sports development, sport for development, sports administration, athlete development, sport media management, sport sponsorship and promotions, operations management, destination and marketing management in government agencies (local, state, national and international levels), private sector management.\n\nStudy in Sustainability and Environment provides graduates with an edge in their chosen field of professional specialisation. Specialist knowledge on sustainability and environment and skills in sustainability planning, evaluation and innovation, maximise their potential for employment as companies increasingly consider issues of sustainability across their business functions. It also opens up careers in companies and government agencies engaged specifically with issues of environmental, cultural and social sustainability, climate, and sustainable development. Specialist roles across industry and public and private sectors include Sustainability Project Officer, Sustainability Consultant, Sustainability Director, Corporate Social Responsibility Manager, Communication and Stakeholder Engagement Lead, Sustainability Evaluation Lead.",
  "course_structure": "The course comprises a total of 192 credit points, allowing students to graduate with the separate degrees of Bachelor of Management and Bachelor of Sustainability and Environment (graduation with a Bachelor of Sustainability and Environment is only possible as part of a combined degree). The study components for course completion are as follows.\n\nThe Management component of 96 credit points comprises:\n\nStudents can choose any one of the following as a Management major: Events, Sport Business or Digital Creative Enterprise.\n\nThe Sustainability and Environment component of 96 credit points comprises:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c10412.html",
    "crawled_at": "2025-11-10T03:34:17.386908",
    "csv_source": "merged_Admission_Courses.csv"
  }
}