{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The UTS Executive MBA is designed for experienced professionals and aspiring change makers, innovators, start-up founders and indigenous leaders. It is for those who are looking to further develop their strategic leadership skills, confidence and innovation management capabilities to respond to complex challenges and lead sustainable economic development.\n\nThe EMBA features:\n\nThe program provides an integrative experience that facilitates students’ transition from tactical to strategic roles and builds their professional capabilities, networks and the confidence to create their next career chapter.\n\nThe EMBA emphasises applied and work-integrated learning that allows students to apply what they learn directly to their specific work context.\n\nThe program is designed and delivered in close collaboration with industry partners ensuring that the curriculum is relevant and aligned with leading business practices and the requirements of contemporary executive leadership.\n\nThe EMBA offers candidates the ability to customise the duration and content of their learning experience to their needs and career objectives. Students benefit from personalised and peer-learning in a small and flexible cohort experience.\n\nStudents have access to a project space, a coaching and mentor program and events with industry partners, entrepreneurs and alumni to supplement their classroom study.\n\nThe flexible modular structure of the program allows students to study the program in stages, leveraging online and immersive, interaction-rich in-class learning.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nProfessional Experience Requirement: At least six years full-time, or part-time equivalent, professional work experience.\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service, confirming the dates of employment, and the position held within the organisation.\n\nInterview Requirement: Attend an interview with the director of the EMBA.\n\nStudents who complete the UTS Graduate Certificate in Executive Business Practice (C11327) or Graduate Certificate in Executive Management (C11338) require at least a credit average for admission into the EMBA program.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 6.5; or TOEFL: paper based: 584-609 overall, internet based: 94-101 overall with a writing score of 24; or AE6: Pass; or PTE: 65-72 overall with a writing score 58; or C1A/C2P: 185-190 with a writing score 176.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include senior general management roles in private, public and non-profit organisations, start-ups and SMEs. Graduates can be the founders and co-founders of new businesses or be employed as senior unit managers or executive managers, business strategists, corporate transformation and innovation specialists, and management consultants.",
  "course_structure": "Students must complete a total of 72 credit points, comprising ten core disciplinary-based subjects (30 credit points), one study pathway in corporate transformation or entrepreneurship or Indigenous leadership (24 credit points), an experiential studio (12 credit points) and two electives (6 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04424.html",
    "crawled_at": "2025-11-10T15:41:14.028748",
    "csv_source": "merged_Admission_Courses.csv"
  }
}