{
  "course_code": "C04435",
  "course_name": "Executive Master of Technology Management",
  "credit_points": "72 Credit points",
  "cricos_code": "None",
  "overview": "The Executive Master of Technology Management is designed for future-focused professionals who aspire to become growth-oriented technology leaders and want to develop enterprise leadership and organisational acumen to enable a sustainable, technology-driven future.\n\nThe portfolio consists of masters level subjects focused on leadership and organisational-acumen, supporting skills and knowledge development in technology, data, and process management.\n\nThe Masters students complete two industry-focused projects in which technological, leadership, business, and strategic thinking skills are applied to enterprise challenges and opportunities. Students build on the communication, critical thinking, and leadership skills that inform strategic thinking and change management in technology rich enterprises. They build capacity to lead the implementation of technology-lead initiatives, innovation, and transformation: solving problems in technological lag and designing technology solutions for enterprise operations. The program is also designed to enrich technical knowledge and understanding of how technologies interact with each other and are applied across business operations, empowering informed discourse and decision making in and across technical teams. The executive masters is suitable for a C-suite bound tech professional with advanced professional capability. This course offers an accelerated pathway and focuses on providing strategic and leadership skills within cutting edge leadership subjects focused on technology and enterprises.\n\nDelivered fully online, with part-time study, this course enables students to work full time while attaining the technology management skills to take control of their career. Customising learning to meet career goals, students can immediately apply what they learn to make a greater impact in their current role and prepare for a technology-driven future.\n\nThe Executive Master of Technology Management allows students to customise their learning to meet their professional aspirations and upskilling needs. Students engage and learn with globally connected teaching staff involved in cutting-edge research from Australia’s #1 ranked university for Computer Science and Engineering.\n\nStudents have access to YourCall, which is a capability and learning log unique to the Faculty of Engineering and IT. YourCall will help students plan, record, and share their learning throughout the course.\n\nUnique to UTS Online, this course is designed with busy full-time working professionals in mind. Studying this fully online course helps students to feel accomplished and supported at the same time.",
  "awards": [
    "Executive Master of Technology Management (MTechMgtExec)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is offered fully online.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIt is a requirement that the degree be in Computer Science, Information Technology, Information Systems, Business Data Analytics, Software Engineering or another comparable field.\n\nIn addition to the outlined qualifications, applicants need to satisfy minimum professional practice requirements of at least five years full time (or equivalent) by providing materials substantiating their work experience (or alternative experience through their contributions to organisations and/or communities and/or start-ups and/or entrepreneurship). This will be supported by submission of:\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates from the Executive Master of Technology Management have a variety of roles available to them and are well equipped to lead and implement technology-led initiatives and transformation. Career options may include roles such as Group Head of IT and Operations, Global Head of IT and Operations, Head of Group Data Platforms, Chief Information Officer (CIO), Director of Technology/Digital Products, Chief Technology Officer (CTO).",
  "course_structure": "Students are required to complete 72 credit points, comprising of 12 credit points of technology and enterprise core subjects, 12 credit points of research project core subjects and 48 credit points of professional-focused electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04435.html",
    "crawled_at": "2025-11-10T15:50:13.196577",
    "csv_source": "merged_Admission_Courses.csv"
  }
}