{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Executive Master of Strategic Communication provides advanced study for communication professionals working in corporate, government, organisational or marketing communication, advertising, or public relations. The course is open to applicants with a minimum of three years experience in professional public communication and an undergraduate degree. Students can select corporate and marketing communication or government communication streams, and the course culminates with a practice-related project relevant to the student's field of interest. Course content addresses up-to-date issues, such as audience insights, through data analysis, digital communication, and strategic communication informed by research and evaluation.\n\nThe world of public communication is changing rapidly through digitalisation, 'big data' analysis, new platforms and channels and shifting attitudes and concerns. These are leading to changing practices and challenges, and new ethical concerns. The UTS Executive Master of Strategic Communication is based on the latest research and is taught by a combination of senior academic researchers and leading industry professionals.\n\nAll applicants need to have completed a minimum of three years' relevant work experience in the communication industry. Those who do not meet this requirement may wish to consider the Master of Strategic Communication (C04385).",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "Programs in the public communication discipline at UTS are accredited by the Public Relations Institute of Australia (PRIA). Students have access to free student membership of the PRIA and graduates have an accelerated path to professional membership of the PRIA.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "The intake for this course has been suspended.\n\nCurrent students are strongly advised to follow the typical course program because of subject availability.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAll applicants need to have completed a minimum of three years' relevant work experience in the communication industry and must demonstrate this by submitting a personal stastement and a recent curriculum vitae.\n\nIf applicants do not submit these documents, their application may not be considered.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates of this course are equipped to work in senior strategic planning and management roles in corporate, government, political, organisational, or marketing communication, advertising, public relations, or integrated communication, including positions related to marketing and promotion, stakeholder engagement, employee communication, community relations, media relations and public affairs.",
  "course_structure": "This course totals 72 credit points of study consisting of three core subjects (24 credit points) and a major project (16 credit points), and four stream subjects (32 credit points).\n\nFull-time students are required to undertake 24 credit points a session. Part-time students should undertake 8 or 16 credit points a session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04384.html",
    "crawled_at": "2025-11-10T15:31:00.558058",
    "csv_source": "merged_Admission_Courses.csv"
  }
}