{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The UTS Online Graduate Certificate in Operations and Supply Chain Management is a specialist postgraduate qualification that develops holistic knowledge of operations and supply chain management concepts with technical and commercial capabilities that will prepare you to lead effective operations.\n\nThe Graduate Certificate subjects are designed to ensure 'relevance to workplace', instantly adding value to careers and organisations with the capability to stay relevant and successful paving the pathway to a career in supply chain management, procurement and logistics.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is offered fully online.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAll applicants who do not meet the academic requirement may still be considered on the basis of:\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service, confirming the dates of employment and the position held within the organisation.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Completing the program could lead to roles such as Procurement Lead, Procurement Manager, Operations Coordinator, Supply Chain Manager, Production Manager and Logistics Manager.",
  "course_structure": "The course comprises a total of 24 credit points.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11359.html",
    "crawled_at": "2025-11-10T19:09:14.005621",
    "csv_source": "merged_Admission_Courses.csv"
  }
}