{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Editing and Publishing is part of an articulated program designed to meet a range of needs for those who want to start a career in writing, editing and/or publishing, and for experienced writers who want to develop and enhance their existing knowledge and skills.\n\nStudents are taught by industry practitioners who are currently working in the industry and can offer advice and guidance on how to secure a job in publishing.\n\nGraduates are able to develop and critically revise their own and others' work, and are aware of the role of writers and writing in culture, society and industry. They leave with high-level editorial skills that enable them to work as freelancers or in-house in the publishing or communications industry, as well as a robust understanding of the publishing industry.\n\nThis course is part of an articulated program comprising the Graduate Certificate in Editing and Publishing, the Graduate Diploma in Creative Writing (C06041), and the Master of Arts in Creative Writing (C04109). Students who successfully complete this course and who are admitted to the graduate diploma or master's course, are eligible for recognition of prior learning for completed subjects.\n\nDownload the Creative Writing flyer",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Applications for this course may only be submitted for Spring session 2023.\n\nStudents are strongly advised to follow the typical course program because of subject availability.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants who have not completed a bachelor's, master's, graduate diploma or graduate certificate qualification in any field of study (or overseas equivalent) must provide:\n\nIf applicants do not submit these documents, their application may not be considered.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates work in the editing and publishing industry for magazines, book publishers and literary journals. They also work in corporate communications, public relations and advertising.",
  "course_structure": "This course totals 24 credit points, consisting of two 8-credit-point core subjects and one 8-credit-point subject from a specified list.\n\nPart-time students should undertake 8 or 16 credit points a session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11071.html",
    "crawled_at": "2025-11-10T18:06:14.851649",
    "csv_source": "merged_Admission_Courses.csv"
  }
}