{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "UTS is a world-leading provider of postgraduate language and literacy courses, with academics who are published authors and internationally recognised. UTS is a leading provider of postgraduate TESOL and applied linguistics courses, with academics who are well connected in the English language and literacy teaching fields in Australia and overseas. The staff are published authors and internationally recognised experts in the field. This course meets the professional development needs of a wide range of English language and literacy teachers in Australia and provides a recognised qualification for teaching English as an additional; language and literacy to children, teenagers and adults. The course features flexible study options, with classes held at times suitable for students working standard full-time hours. Credit recognition may be available. This course is designed to meet the specialist requirements for English language teachers of adults in the Australian vocational education and training sector and the ELICOS sector. This program is also suitable for qualified school teachers seeking a specialist qualification in EAL/D teaching.\n\nThe course enables students to gain a recognised specialist teaching qualification in one of three streams. The first stream focuses on teaching English for academic purposes (EAP) where graduates teach English to international students who are studying or seeking to study university courses in institutions where English is the medium of instruction. The second stream is designed for teaching adults who are developing their English language, literacy and/ or numeracy skills as part of a migrant education and settlement program; a ‘second chance’ education program; a job-seeker, vocational or workplace program; or a community education program. The third stream is for qualified school teachers who work in Australia or overseas, and who wish to add specialisation in teaching English as an additional language and literacy to primary or secondary school students. Graduates of the course can expect to have their qualifications recognised for teaching EAP in English Language Intensive Courses for Overseas Students (ELICOS) colleges; teaching in government funded adult migrant English programs, job-seeker programs and community-based English language, literacy and numeracy courses in vocational education and training (VET) and community colleges; or for teaching EAL/D and literacy in primary or secondary schools, depending on their specialist stream.\n\nRead what our graduates say about our TESOL and Applied Linguistics courses\n\nDownload a TESOL and Applied Linguistics flyer",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the TESOL and Applied Linguistics Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "There are a limited number of Commonwealth Supported Places (CSPs) within this course. Applicants are strongly encouraged to submit their full application by Sunday 19 June 2022 to be considered for a Commonwealth Supported Place. Eligible applicants must accept their offer by the lapse date in order to retain their place.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIf applying with no prior Bachelor degree or Master degree, applicants are assessed by the Faculty, via the assessment of a compulsory personal statement and CV. The personal statement is used to outline the applicant’s interest in and understanding of the course.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include teacher of English as an additional language, adult literacy and numeracy/foundation skills in Australia or overseas (applicants are advised to check with potential employing bodies regarding employment requirements).",
  "course_structure": "Students must complete 48 credit points, comprising 30 credit points of core subjects, one spesialist stream (12 credit points) and one elective (6 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06116.html",
    "crawled_at": "2025-11-10T16:10:39.925418",
    "csv_source": "merged_Admission_Courses.csv"
  }
}