{
  "course_code": "C11270",
  "course_name": "Graduate Certificate in Planning",
  "credit_points": "24 Credit points",
  "cricos_code": "096458E",
  "overview": "The Graduate Certificate in Planning offers an entry pathway to the Master of Planning (C04007) for students who have professional experience in planning but do not have an appropriate undergraduate qualification, or have a bachelor's degree in an unrelated field.\n\nThe degree enables professionals to change careers due to the multidisciplinary nature of the learning.",
  "awards": [
    "Graduate Certificate in Planning (GradCertPlan)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "Building"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": "1 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate reflective practice and ethical responsibility in evaluating complex problems and addressing social inequality through planning. "
    },
    {
      "number": 2,
      "text": "Communicate effectively and manage conflicts within diverse professional and cultural contexts. "
    },
    {
      "number": 3,
      "text": "Apply relevant design strategies, tools, techniques and sustainability principles to develop plans that are appropriate to diverse contexts. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/7f8ba36347f22650a31de422036d43e6"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nPathway 1\n\nApplicants must have completed a UTS-recognised academic qualification or an equivalent as follows:\n\nPathway 2\n\nFor applicants with no Bachelor degree but holding a Graduate Certificate or Graduate Diploma not listed under pathway 1:\n\nPathway 3\n\nApplicants who do not satisfy the academic requirements listed in pathway 1 may be considered on the following:\n\n* Work experience is not restricted to Australia. It can be for anywhere in the world within the relevant cognate field.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates are employed in strategic planning on major developments and projects, master planning with financial analysis, and the increasingly important area of sub-regional planning.",
  "course_structure": "Students must complete 24 credit points made up of three core subjects and one elective subject.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11270.html",
    "crawled_at": "2025-11-10T18:30:48.641830",
    "csv_source": "merged_Admission_Courses.csv"
  }
}