{
  "course_code": "C11341",
  "course_name": "Graduate Certificate in Technology Management",
  "credit_points": "24 Credit points",
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Technology Management provides foundational knowledge and know-how across the major areas of technology leading business innovation, transformation, and competitiveness.\n\nStudents are introduced to the terminology, key skills, and trends in information technology, and strategies for leading and governing IT solutions in enterprises and organisations. The learning in the Certificate provides the insights, tools, and conceptual learning that students need to progress as a professional working across technical teams and implementing business solutions.\n\nThe Certificate provides a foundation for progressing their technology and digital transformation leadership in the Technology Management Masters program.\n\nThe Graduate Certificate in Technology Management is designed for future-focused professionals who aspire to become growth-oriented technology leaders and want to develop enterprise leadership and organisational acumen to enable a sustainable, technology-driven future.\n\nDelivered fully online, with part-time study, this course enables students to work full time while attaining the technology management skills to take control of students career. Customising learning to meet career goals, students can immediately apply what they learn to make a greater impact in their current role and prepare for a technology-driven future.\n\nThe Graduate Certificate in Technology Management allows students to customise their learning to meet their professional aspirations and upskilling needs. Students engage and learn with globally connected teaching staff involved in cutting-edge research from Australia’s #1 ranked university for Computer Science and Engineering.\n\nStudents have access to YourCall, which is a capability and learning log unique to the Faculty of Engineering and IT. YourCall helps students plan, record, and share their learning throughout the course.\n\nUnique to UTS Online, this course is designed with busy full-time working professionals in mind. Studying this fully online course helps students to feel accomplished and supported at the same time.",
  "awards": [
    "Graduate Certificate in Technology Management (GradCertTechMgt)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is offered fully online.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIn addition to the outlined qualifications, applicants must have at least one year full-time (or equivalent) experience through their contributions to organisations and/or communities and/or start-ups and/or entrepreneurship. For those applicants interested in the masters who do not meet the additional requirements for admission, this is an alternative entry point. This will be supported by submission of:\n\nAlternative admission pathway:\n\nApplicants who do not meet the outlined academic requirements and additional requirements but have professional practice (5-year minimum) and a general capacity to undertake tertiary education may be considered. This will be supported by submission of:\n\nAssessment of other criteria:?\n\nDemonstrates experience in a technology or enterprise management or professional role work integrated learning and contextualisation of academic qualifications.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates from the Graduate Certificate in Technology Management have a variety of job roles available to them and are well equipped to lead and implement technology-led initiatives and transformation. Career options may include roles such as IT Project Manager, Head of Product, IT, Technology Project Manager, Digital Product Owner, Integration Lead, Tech Consultant, Technology Lead (start-up).",
  "course_structure": "Students must complete 24 credit points, comprising of contemporary technology foundation subjects in IT projects and functions within tech organisations.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11341.html",
    "crawled_at": "2025-11-10T18:59:15.344557",
    "csv_source": "merged_Admission_Courses.csv"
  }
}