{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Employment Law and Practice is a specialist course for law and non-law professionals that seeks to develop subject expertise and practical skills in the field of labour law. The course is intended to educate professionals in the general area of employment law as well as specialist themes, including workplace culture and work health and safety.\n\nAs a professional working in, or alongside, the area of employment law and/or practice (including HR managers and those working in industrial relations and employee relations), this course expands and deepens student knowledge of relevant law, policy and contemporary issues as well as their professional skills, particularly in relation to analysis, communication and collaboration. If students are aiming to extend their knowledge and skills, or move into the area of employment law as a specialist, in either employment law or management, this course provides a suite of subjects with a focus on real-world experiences and practices. Students learn from expert academics and practising specialists in a professional environment that blends intensive collaborative study and online discussion and reflection.\n\nThis course is offered through a combination of online and face to face delivery, and it is intended to educate professionals in the general area of employment law as well as specialist themes, including workplace culture and work health and safety. Professionals are likely to be those who wish to expand or deepen their knowledge and skills in the area, as specialists in either employment law or management.\n\nStudents have the opportunity to network with educators, practitioners and colleagues in subjects that are timetabled to suit their professional life. The course offers flexibility for students to study part-time or full-time in a dynamic and supportive environment.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "Students from a non-common law background are also required to enrol in the subject 79708 Contemporary Business Law.\n\nAutumn intake is available for international students, Spring intake is not available for international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nPrevious qualifications can be in any discipline.\n\nIf you do not have an undergraduate or postgraduate degree you must provide the following:\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The course enables graduates to work in employment law and practice and to develop an expertise in the area. Graduates are equipped to move into careers as employment lawyers or workplace managers including HR managers and in the field of industrial relations and employee relations.",
  "course_structure": "Students in this course undertake three core subjects and one elective or non-common Law subject from choice block CBK92183 (totalling 24 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11354.html",
    "crawled_at": "2025-11-10T19:05:29.017096",
    "csv_source": "merged_Admission_Courses.csv"
  }
}