{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Medical Laboratory Science encompasses a broad range of biomedical science disciplines and is designed to open new career prospects for science graduates in medical diagnostic laboratories and to enhance the knowledge and skills of established medical laboratory scientists. The Graduate Diploma builds on the Graduate Certificate to develop associated workplace attributes. Core subjects have been co-developed with industry experts and include the areas of Medical Microbiology, Diagnostic Pathology and Biomolecular Science to meet the specific areas of expertise required of this field.\n\nThis program is co-developed and co-directed with industry and is offered as an immersive online learning experience. The flexible online learning environment permits remote, rural, and regional access for job seekers and existing workforce, or those seeking to transition career into medical testing laboratories. In this industry co-developed course, students are able to extend their skills through authentic work-integrated learning experiences to build skills that enhance their employability and career pathways.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Commonwealth Supported Places (CSP) are ONLY available for C11342 Graduate Certificate in Medical Laboratory Science.\n\nPart-time and fully online study is available.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\nThe program is online, with an option to undertake one elective subject on City Campus. Applicants must choose \"Internal\" attendance mode in the UTS Online Application System.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in hospital laboratories, diagnostic medical laboratories, pharmaceutical companies, biomedical and biotechnology industries, biomedical science information dissemination and education.",
  "course_structure": "Students must complete 48 credit points made up of 18 credit points of core subjects and 30 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06143.html",
    "crawled_at": "2025-11-10T16:20:06.438270",
    "csv_source": "merged_Admission_Courses.csv"
  }
}