{
  "course_code": "C06149",
  "course_name": "Graduate Diploma in Psychology (Advanced)",
  "credit_points": "48 Credit points",
  "cricos_code": "None",
  "overview": "The UTS Online Graduate Diploma in Psychology (Advanced) is a contemporary, practical course that has been developed by leading academics and experienced practitioners at the forefront of psychological science.\n\nThis course is for career builders in psychology who seek powerful and positive change to serve the lives of communities, organisations, individuals, and themselves. Students prepare for a rich career in psychology by honing their skills as a scientist-practitioner and researcher in the framework of social responsibility and leadership.\n\nFollowing a modern curriculum guided by the latest American Psychological Association Guidelines and the Australian Indigenous Psychology Education Project, students of this course are part of an emerging mental health workforce that works effectively with, and for, Indigenous Australians.\n\nThe course has been developed by experienced practitioners and academics at the leading-edge of research, technology, and innovation in psychological science – so everything that students learn reflects the latest in psychological science.\n\nThe Graduate Diploma in Psychology (Advanced) is delivered 100% online, allowing students to fast-track their journey towards becoming a psychologist or researcher.",
  "awards": [
    "Graduate Diploma in Psychology (Advanced)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This UTS program is accredited with conditions by the Australian Psychology Accreditation Council (APAC).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate advanced knowledge and skills required for research and professional practice that is sensitive to diversity of individuals and culturally appropriate, while critically reflecting on the impacts of ongoing colonisation on the health and wellbeing of Indigenous Australians. "
    },
    {
      "number": 2,
      "text": "Justify the application of psychological science to personal, professional, and societal goals. "
    },
    {
      "number": 3,
      "text": "Apply advanced knowledge and skills in psychology to reflexivity and self-directed pursuit of scholarly inquiry and professional development. "
    },
    {
      "number": 4,
      "text": "Design, analyse and critique advanced theory and research in psychology. "
    },
    {
      "number": 5,
      "text": "Employ advanced interpersonal, teamwork, and communication skills appropriate to psychological practice and research. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is offered fully online.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have one of the UTS recognised qualifications:\n\nAll applicants must have completed the following in the last 10 years:\n\nPsychology qualifications from overseas must be assessed by the Australian Psychological Society (APS) as equivalent to an APAC accredited level 1 program in Psychology. This assessment must be included in the application.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a minimum score of 7.0 in each subset; or TOEFL: internet based: 94 overall, reading 24, listening 24, speaking 23, writing 27; or PTE: 65-72 overall with a minimum score of 65 in each subset; or OET: minimum score of B in each of the 4 components (listening, reading, writing and speaking).\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The UTS Online Graduate Diploma in Psychology (Advanced) is suitable for professionals who want to prepare for a rich career in psychology – whether it be in a clinical, educational or business setting, or community and support services. Studying this course may lead to a range of roles such as psychologist, clinical psychologist, counsellor, therapist or researcher.\n\nRegistration pathways and requirements to becoming a psychologist An APAC accredited Level 1 program (e.g., the Graduate Diploma in Psychology) is the first step in the pathway towards registration as a psychologist in Australia. The second step is as an APAC accredited Level 2 program (e.g., the Graduate Diploma in Psychology (Advanced)). The third step is an APAC accredited Level 3 program (e.g., Master of Clinical Psychology). Once enrolled in a Level 3 program, students will apply for provisional registration.\n\nThe requirements for general registration as a psychologist are determined by the Psychology Board of Australia (PsyBA) under the Australian Health Practitioner Regulation Agency (AHPRA). Please review the following for more information on requirements and registration:",
  "course_structure": "This course comprises a total of 48 credit points. Students must complete a total of four core coursework subjects and two research project subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06149.html",
    "crawled_at": "2025-11-10T16:25:09.081588",
    "csv_source": "merged_Admission_Courses.csv"
  }
}