{
  "course_code": "C06122",
  "course_name": "Graduate Diploma in Migration Law and Practice",
  "credit_points": "36 Credit points",
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Migration Law and Practice develops subject expertise and practical skills in the niche field of migration law. This course is developed by migration experts and is offered entirely online, giving students the flexibility to study when and where they choose. All lectures, tutorials, course materials and assessments are available via a range of web-based technologies and electronic media.\n\nOn completion of this course, students intending to work in the area of migration practice have the required knowledge and skills to provide immigration assistance, and are eligible to sit a capstone exam approved and facilitated externally by the Office of Migration Agents Registration Authority to satisfy the prescribed knowledge requirements for registration as an Australian migration agent.",
  "awards": [
    "Graduate Diploma in Migration Law and Practice (GradDipMigLawPrac)"
  ],
  "faculty": [
    "Law"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": "5 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The prescribed knowledge requirements for registration as a migration agent with the Office of the Migration Agents Registration Authority in Australia can be fulfilled by completing all accredited subjects in this course and passing an external capstone exam approved and facilitated externally by the Office of Migration Agents Registration Authority (OMARA).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate a specialised understanding of a complex body of legal knowledge within the context of migration law and practice in the Australian legal system, the principles and values of ethical practice, and contemporary developments in migration law and its professional practice. "
    },
    {
      "number": 2,
      "text": "Demonstrate an advanced understanding of the principles and approaches to ethical decision-making and professional responsibility in migration law and practice including the ability to respond independently to ethical challenges, demonstrating professional judgment. "
    },
    {
      "number": 3,
      "text": "Formulate appropriate responses to problems and questions in migration law and practice, using advanced skills in legal research, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "A well-developed understanding of Indigenous perspectives informed by a commitment to build Indigenous professional capability, to work for and with Indigenous peoples. Identify and challenge the deficit narratives and biases of Anglo-Australian laws towards Indigenous Australians, particularly in relation to access to the law. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/5ce7c43b83e4a210fed7d4326daad327"
    }
  ],
  "notes": "This course is only available by distance mode in the Summer, Autumn and Spring sessions. International students are not eligible for a student visa to study this course in Australia.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nPrevious qualifications can be in any discipline.\n\nIf you do not have an undergraduate or postgraduate degree, you need to submit:\n\nIf an applicant does not formally meet the selection criteria but the Faculty deems the applicant to be eligible based on evidence of prior learning and demonstrated capability, the Faculty reserves the right to make an offer to the appropriate course.\n\nApplicants may be asked to provide additional information to assist in the assessment of their application for admission.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include registration as a migration agent and specialist work in the migration advice and policy industry, provided non-lawyer graduates also pass a capstone exam approved and facilitated externally by Office of Migration Agents Registration Authority, and fulfil all other prescribed requirements for registration. Holders of unrestricted legal practising certificates can give immigration assistance without OMARA registration, and by successfully completing this Program, they gain the skills and knowledge necessary to advise migration clients.",
  "course_structure": "The course comprises a total of 36 credit points of compulsory core law subjects (six subjects).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06122.html",
    "crawled_at": "2025-11-10T16:12:43.986676",
    "csv_source": "merged_Admission_Courses.csv"
  }
}