{
  "course_code": "C06109",
  "course_name": "Graduate Diploma in Environmental Engineering Management",
  "credit_points": "48 Credit points",
  "cricos_code": "116226G",
  "overview": "This exit-only program is designed to enable engineers and other technical specialists to take a leadership role in the field of environmental engineering and management. The course deals with the broad aspects of environmental management relevant to practising professionals in engineering science, planning, architecture, law, surveying, health and building. Engineers, scientists, town planners and other professionals working in this field have a compelling duty to ensure that the adverse effects of development on the total environment are minimised.\n\nThe course combines a set of key subjects that contain information on the nature of environmental problems together with engineering techniques for their solution. This is supplemented by management and policy subjects to empower the engineer, or technical specialist, to lead multidisciplinary teams working in the field of environmental engineering and management.",
  "awards": [
    "Graduate Diploma in Environmental Engineering Management (GradDipEnvEM)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": "2 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course is of relevance to practising professionals in architecture, building, engineering science, health, law, planning and surveying. Career options include positions in government agencies or private corporations, or as consultants.",
  "course_structure": "Candidates complete coursework subjects totalling 48 credit points of study.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06109.html",
    "crawled_at": "2025-11-10T16:07:24.455056",
    "csv_source": "merged_Admission_Courses.csv"
  }
}