{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Behavioural Economics provides a thorough understanding of the basic principles of behavioural economics. This course provides a foundation in standard economic theory and builds the behavioural models on this foundation. This includes heuristics and biases in individual decision making and their implications in strategic interactions. Students are also given a grounding in fundamental tools of applied behavioural science, such as causal inference and trial design.\n\nThis course is designed to provide skills that students could apply in existing roles or in managing behavioural science practitioners.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAll applicants who do not meet the academic requirement may still be considered on the basis of:\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service, confirming the dates of employment and the position held within the organisation.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include management-level positions in industry or government.",
  "course_structure": "Students must complete a total of 24 credit points made up of eight subjects (3 credit points each).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11299.html",
    "crawled_at": "2025-11-10T18:41:05.499195",
    "csv_source": "merged_Admission_Courses.csv"
  }
}