{
  "course_code": "C06108",
  "course_name": "Graduate Diploma in Engineering",
  "credit_points": "48 Credit points",
  "cricos_code": "109000F",
  "overview": "This exit-only program allows students to gain in-depth knowledge and skills in the particular major that they undertook as part of their undergraduate engineering studies. The course provides an opportunity for engineers to deepen the knowledge and skills gained in their first degree while expanding their managerial and professional engineering knowledge.\n\nThis program allows students to choose a program of study that deepens the body of knowledge acquired in their first degree as well as expands knowledge boundaries into policy and engineering management areas. It also provides an opportunity to deepen their knowledge and gain practical skills in a particular major.",
  "awards": [
    "Graduate Diploma in Engineering (GradDipE)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": "2 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Students who hold an undergraduate engineering degree are able to enhance their knowledge and ability in their respective majors, enabling them to gain and hold employment in relevant engineering fields.",
  "course_structure": "Candidates complete coursework subjects totalling 48 credit points of study.\n\nSome postgraduate program majors may require students to complete a number of prescribed subjects with or without opportunity for electives. Subjects are selected from postgraduate programs offered by the Faculty of Engineering and Information Technology.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06108.html",
    "crawled_at": "2025-11-10T16:06:30.843123",
    "csv_source": "merged_Admission_Courses.csv"
  }
}