{
  "course_code": "C06145",
  "course_name": "Graduate Diploma in Urban Planning (Online)",
  "credit_points": "48 Credit points",
  "cricos_code": "None",
  "overview": "The UTS Online Graduate Diploma in Urban Planning is designed for professionals who want to develop their knowledge and practical skills to become effective planners with an integrated approach to creating sustainable urban environments. Students proactively explore and engage with the various elements of urban planning, including the environment, legislation, and social sustainability.\n\nThe course provides a practical approach to urban planning across an array of subject areas. Students learn the foundation on how to apply sustainable planning practices and urban design principles and develop the analytic skills to create integrated planning solutions.\n\nDelivered fully online, this course enables students to work full-time while gaining a holistic understanding of the environmental, policy and economic considerations that ensure good planning outcomes.",
  "awards": [
    "Graduate Diploma in Urban Planning (GradDipUrbPlan)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "Building"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": "2 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate reflective practice and ethical responsibility in evaluating complex problems and addressing social inequality through planning. "
    },
    {
      "number": 2,
      "text": "Communicate and collaborate effectively in diverse contexts. "
    },
    {
      "number": 3,
      "text": "Apply innovative and creative problem-solving skills to urban design, informed by research, evaluation, and urban design principles. "
    },
    {
      "number": 4,
      "text": "Investigate and articulate the evolution and future of urban planning and design, employing a range of analytic tools to assess environmental, social, and economic dynamics. "
    },
    {
      "number": 5,
      "text": "Design and conduct research to evaluate risks, spatial relationships, and alternative strategies, using evidence to develop coherent arguments and assess the impacts of proposals. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.\n\nThis course is not offered to international students.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Graduate Diploma in Urban Planning is for those with a background in a non-planning field, enabling professionals to change careers due to the multidisciplinary nature of the learning. It is also for those built environment professionals who aim to strengthen their current skills through engaging with up-to-date and ground-breaking planning approaches.\n\nGraduates are in public sector positions, including working for state and local government, and in private consulting and property development firms. Completing a Master of Urban Planning could lead to roles such as:",
  "course_structure": "Students must complete 48 credit points of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06145.html",
    "crawled_at": "2025-11-10T16:22:21.576101",
    "csv_source": "merged_Admission_Courses.csv"
  }
}