{
  "course_code": "C11369",
  "course_name": "Graduate Certificate in Sustainable Practice",
  "credit_points": "24 Credit points",
  "cricos_code": "None",
  "overview": "Sustainable practice is a priority across all facets of operations for industry, government, and non-profit organisations alike. The program builds skills and advanced knowledge of sustainability practice including policy, climate science, sustainable practices, and energy sources.\n\nStudents develop forward-looking and specialised knowledge to become valued, solutions-focused experts for organisations and communities focussed on increasing their sustainability.",
  "awards": [
    "Graduate Certificate in Sustainable Practice (GradCertSustPrac)"
  ],
  "faculty": [
    "Science"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Critically appraise and apply advanced skills and knowledge relevant to sustainable practices. "
    },
    {
      "number": 2,
      "text": "Analyse data and information to design appropriate independent research to solve complex sustainability problems. "
    },
    {
      "number": 3,
      "text": "Develop, prepare, and engage in work practices demonstrating awareness of health and safety requirements, ethical conduct, risk management, organisation, and governance or regulatory requirements in the context of sustainability. "
    },
    {
      "number": 4,
      "text": "Critically reflect on their own and others' practices in relation to sustainable practices, seek and act on feedback to develop professional practice and learning. "
    },
    {
      "number": 5,
      "text": "Communicate complex ideas using various communication approaches from a variety of methods (oral, written, digital and visual) to broad audiences around sustainable practices. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include sustainability consultant, climate change and sustainability consultant, sustainability officer, practice manager, head of environment & climate change, sustainable practices manager, environmental coordinator, sustainability project coordinator, sustainable development specialist, green initiatives manager, corporate sustainability analyst, sustainable supply chain coordinator, sustainability reporting specialist, sustainable product manager, sustainability educator, renewable energy coordinator, waste management specialist, water conservation officer, sustainable transportation planner, ecosystem restoration specialist, environmental compliance officer, sustainable packaging specialist, social impact coordinator, sustainability advocate.",
  "course_structure": "The course comprises a total of 24 credit points and consists of four compulsory core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11369.html",
    "crawled_at": "2025-11-10T19:13:28.352634",
    "csv_source": "merged_Admission_Courses.csv"
  }
}