{
  "course_code": "C11238",
  "course_name": "Graduate Certificate in Engineering Studies",
  "credit_points": "24 Credit points",
  "cricos_code": "081084J",
  "overview": "This course qualifies individuals who apply a body of knowledge in a range of contexts to undertake professional work and provides a pathway for further learning in engineering. Students with a bachelor's degree in a non-cognate engineering field can apply to this course. All applications are assessed individually and the course structure is tailor-made based on the basic qualifications that students possess.\n\nApplicants without a degree but who have a TAFE diploma or equivalent qualification in engineering and significant related work experience are also considered.\n\nThis course creates a pathway for students from a different engineering background to explore their potential to undertake postgraduate studies in engineering. Once students complete the course, individual assessment is undertaken to articulate either 12, 18 or 24 credit points towards a master's course.",
  "awards": [
    "Graduate Certificate in Engineering Studies (GradCertESt)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": "1 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must hold a qualification in an engineering field, and are required to specify on their application which new or varied field of engineering they wish to pursue.\n\nApplicants who do not satisfy the above academic requirements may be considered on one of the following:\n\nand\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course allows professionals who are currently employed, or would like to pursue employment in engineering organisations, to understand and gain advantage in securing and retaining employment.",
  "course_structure": "Students are required to complete 24 credit points, comprising professional engineering (6 credit points), review (12 credit points), and an elective (6 credit points). Program details vary according to the interests of the student and are determined prior to enrolment as well as in consultation with, and with the approval of, an academic adviser designated by the Director, Teaching and Learning.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11238.html",
    "crawled_at": "2025-11-10T18:21:04.188433",
    "csv_source": "merged_Admission_Courses.csv"
  }
}