{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Media Practice and Industry is for creative media graduates or experienced industry practitioners seeking to advance their skills and employability in a hybrid and dynamic media environment. The course is focused towards media industry transformations with respect to ethics, social justice, technology and sustainability. Students select subject choices which share entrepreneurial, collaborative and iterative approaches to the ideas, practices and audiences for screen, digital media and emerging platforms. Curation, design thinking and project-based work are key aspects of the course, which aims to produce graduates who can provide leadership to harness and shape opportunities in the field.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "None",
  "course_structure": "Students complete 48 credit points of study made up of two core subjects and four electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c07140.html",
    "crawled_at": "2025-11-10T16:44:51.047109",
    "csv_source": "merged_Admission_Courses.csv"
  }
}