{
  "course_code": "C11343",
  "course_name": "Graduate Certificate in Urban Planning and Design (Online)",
  "credit_points": "24 Credit points",
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Urban Planning and Design is a foundation course that provides a pathway to study the Master of Urban Planning or the Master of Urban Design. This degree is designed for students who have professional experience in planning but do not have an appropriate undergraduate qualification, or have a bachelor's degree in an unrelated field.\n\nThe degree enables professionals to change careers due to the multidisciplinary nature of the learning.",
  "awards": [
    "Graduate Certificate in Urban Planning and Design (GradCertUrbPlanDes)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "Building"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Evaluate and reflect on the historical, social, and ethical dimensions and professional responsibilities of urban planning and design. "
    },
    {
      "number": 2,
      "text": "Apply a range of analytical tools and urban design principles to develop creative and sustainable solutions for complex urban problems. "
    },
    {
      "number": 3,
      "text": "Communicate and collaborate effectively in diverse contexts. "
    },
    {
      "number": 4,
      "text": "Analyse and synthesise data from multiple sources to prepare and critique urban and regional plans. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Session 5 commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/05d1d70747bfa610413994ed036d43bb"
    }
  ],
  "notes": "This course is not offered to international applicants.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants with one of the following qualifications will receive an offer:\n\nApplicants without any of the above qualifications, but who meet the following criteria, may also be considered:\n\nApplicants who do not meet the above criteria may be considered on the following:\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates are usually employed in entry-level roles in public sector positions, including working for state and local government, and in private consulting.",
  "course_structure": "Students must complete 24 credit points of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11343.html",
    "crawled_at": "2025-11-10T19:00:20.315531",
    "csv_source": "merged_Admission_Courses.csv"
  }
}