{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Forensic Science is suitable for those seeking a scientific qualification to assist them to gain entry into further forensic science studies, as well as for those who are already employed in a scientific field but wish to gain new specialised skills to advance their area of expertise.\n\nThe course enhances career prospects by providing opportunities to extend knowledge beyond a first degree. It provides the opportunity to extend or renew scientific knowledge and professional skills that are important to career advancement.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nEntry into the course requires the completion of a bachelor's, master's, graduate diploma or graduate certificate qualification in chemical sciences, biochemistry and cell biology, human biology, forensic science or medical science.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The course provides a backbone of skills important to a professional forensic scientist; be they engaged in research, science business, industries or government organisations.",
  "course_structure": "The course requires 24 credit points of study, with 16 credit points chosen from the core discipline subjects and 8 credit points from the professional stream subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11287.html",
    "crawled_at": "2025-11-10T18:39:46.337467",
    "csv_source": "merged_Admission_Courses.csv"
  }
}