{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "At the heart of the Fourth Industrial Revolution are human-centric skills, technical know-how and business acumen that can transform problems into opportunities for improved performance and positive social change.\n\nThe Graduate Certificate in Business Consulting and Technology Implementation, designed with industry partners including Microsoft, is an online course that prepares you to work in the high-demand professional field of Functional Consulting. The course aims to provide students with a research-informed toolkit of skills, knowledge and methodologies to facilitate the co-design and implementation of valued-added processes and technological solutions.\n\nThe Graduate Certificate in Business Consulting and Technology Implementation incorporates a unique breadth of studies and interdisciplinary perspectives with subjects drawn from the Faculty of Arts and Social Sciences and UTS Business School. Core subjects focus on equipping students with skills and knowledge in stakeholder engagement, storytelling, problem solving, business processes, specific Microsoft applications and their implementation, while electives allow students to specialise in two areas from business analytics, accounting, supply chain, and sales and marketing.\n\nThe Graduate Certificate in Business Consulting and Technology Implementation culminates in an experiential and applied learning studio where students work on real client challenges with industry feedback. Students are connected to leading global consultancy firms with opportunities to showcase their learning.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAcademic qualifications considered include a Bachelors degree, Graduate Certificate, Graduate Diploma and Masters degree.\n\nApplicants without an academic qualification will be considered for admission if they have a minimum of four (4) years full-time, or equivalent, relevant post-secondary work experience and a general capacity to undertake tertiary education.\n\nRelevant work experience is defined from within the ANZSCO groups – 01 Managers, 02 Professionals, 03 Technicians and Trades Workers, 04 Community and Personal Service Workers, 05 Clerical and Administrative Workers, 06 Sales Workers AND demonstrated through a C.V. and a Statement of Service confirming the dates of employment, and the position held within the organisation.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Completing this course may lead to roles such as: Business Consultant, Cutsomer Engagement - Tech, Functional Consultant, Senior Application Consultant, Solution/Technical Architect, Supply Chain Consultant, Technical Delivery Manager, and Technology Consultant.",
  "course_structure": "Students must complete 24 credit points made up of 18 credit points of core subejcts (two 6cp subjects and two 3cp subjects) and 6 credit points of electives (two 3cp subjects)",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11355.html",
    "crawled_at": "2025-11-10T19:05:36.192451",
    "csv_source": "merged_Admission_Courses.csv"
  }
}