{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "Unique in Australia, the Master of Design responds to the global need for graduates with skills in social and service design and design leadership, who can create and manage high level service experiences and lead social, community and organisational change. This comprehensive and integrated program has been developed in collaboration with industry leaders including the Design Innovation Research Centre situated in the School of Design at UTS.\n\nThe program focuses on and integrates research, industry collaboration, internationalisation and a design culture through the delivery of specialist, core and transdisciplinary subjects. It provides a postgraduate education that is flexible in both its practice orientation and research integration.\n\nWith a focus on design evolution, innovative integration of new technologies, practice and student experimentation, the course is delivered by experienced studio leaders who are acknowledged leaders in their industries and professions.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.\n\nThis is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. Check with your faculty's student centre.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates' careers are enhanced by high-level professional knowledge and skills for the workplace, with possession of specialised knowledge in advanced textiles, space and materials, interaction, sustainable design and innovation.",
  "course_structure": "Students must complete 48 credit points of subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c07119.html",
    "crawled_at": "2025-11-10T16:36:10.127840",
    "csv_source": "merged_Admission_Courses.csv"
  }
}