{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Palliative Care is designed for registered health professionals with substantial clinical, policy or educational health experience who are looking to extend their palliative care capabilities to become future palliative care experts in their field.\n\nThis course delivers sustainable, high-quality interdisciplinary education, developed and delivered in collaboration with leading contemporary experts in the field. Each of the eight subjects comprises a mix of theory, evidence-based and clinical practice, and can be completed in part-time mode. Subjects include a range of current healthcare contexts (including complex communication, social justice, law and ethics, and public health) so students can practise safely and proficiently to provide person-centred health care and contribute to quality outcomes for those in their care.\n\nThe course prepares students for advanced practice as registered health professionals with skills in palliative care clinical performance capabilities, and critical decision-making and leadership skills.\n\nThis diploma has strong links to industry and is firmly grounded in contemporary and best evidence-based, person-centred healthcare practices. The course closely integrates theory and practice-based learning and assessment in a combination of online learning, classroom, state-of-the-art simulation laboratories and authentic clinical settings. Guest presenters include industry-based health practitioners and other experts from a range of clinical settings to ensure that knowledge and skills are evidence-based and clearly reflect advanced practice as it is today. Presenters adopt a range of teaching and learning strategies to enhance the student experience, such as participatory online and real-time learning activities, communities of practice, media resources, podcasts and case-based scenarios. These course features ensure that graduates are practice-ready, able to work in dynamic and changeable healthcare environments, and prepared to make significant contributions to positive patient outcomes.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course offers a mid-year intake for local students.\n\nAll subjects in the course are delivered by distance (online).\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have:\n\nRegistered health professionals who do not meet the admission criteria for a threshold offer – such as applicants who do not have an undergraduate degree but have recent relevant work experience – may be considered eligible. Applicants must present evidence of a capacity to undertake tertiary study via submission of a CV, which should include details of completion of hospital or college certificates and professional or staff development. The Faculty reviews and determines if the applicant is eligible based on evidence of prior learning and demonstrated capability.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The course is ideally suited to health professionals who envisage a future in palliative care and are committed to driving international, national and local palliative carer reforms designed to improve patients' and families' end-of-life care experiences. The interdisciplinary course is nested with the Master of Palliative Care (C04365) and equips health professionals with the necessary clinical capabilities to assess and manage within their scope of practice palliative care patients' and families' complex needs. Bringing together the nursing, medical and allied health disciplines, this course focuses on the effective management of interdisciplinary care in the context of prescribing and referral practices, diagnostic investigations and developing comprehensive treatment plans.\n\nCareer options include working in palliative care policy at a state or national level, and providing palliative care in a variety of clinical areas such as emergency, critical care, surgical and medical specialties, community-based care, mental health, specialist palliative care, paediatrics, aged care, chronic disease management and primary health care.",
  "course_structure": "Students must complete 48 credit points made up of 36 credit points of core subjects and 12 credit points of electives offered by UTS: Health.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c07131.html",
    "crawled_at": "2025-11-10T16:39:52.109291",
    "csv_source": "merged_Admission_Courses.csv"
  }
}