{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Financial Planning is a unique modular experience designed for financial planners with a degree in unrelated fields who want to improve their professional skills and satisfy the Financial Adviser Standards and Ethics Authority (FASEA) qualification requirements.\n\nThe course has been designed to suit the needs of professionals who currently work full time: most subjects are delivered in a mix of online learning and face-to-face interaction over two weekends. The block mode structure means that students can cover the content and complete the assessments for each subject in a six-week period. This combines the convenience of online learning with the rich experience of class interaction with a group of highly motivated and engaged peers.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "The Graduate Diploma in Financial Planning is a Financial Adviser Standards and Ethics Authority (FASEA) approved degree. Visit Treasury’s Financial Adviser Standards website at fas.treasury.gov.au for more information.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The course is intended for aspiring financial planners looking enrich their professional skillset and satisfy the required educational standards. The program has been approved by the Financial Adviser Standards and Ethics Authority (FASEA).",
  "course_structure": "The course totals 48 credit points and comprises eight core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c07142.html",
    "crawled_at": "2025-11-10T16:45:53.437957",
    "csv_source": "merged_Admission_Courses.csv"
  }
}