{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "This course is designed for university academics and locates teaching and learning in the shifting and increasingly complex, connected and uncertain higher education context. Internationalisation, globalization, technological advancements and imperatives to balance ‘job ready’ graduates with education for social good and citizenship have effects upon how learning and teaching is theorised, practised and evidenced.\n\nThis course invites university academics to examine their purpose, values and approaches to teaching and learning, enhance their practice as well as develop their careers. It balances theory from key research in learning and curriculum, with practical skills and strategies. Through a practice based, dialogic approach participants engage in critical and self-directed inquiry as well as work collaboratively with colleagues, course teams, students, and professional practitioners to enable them to develop their professional judgment and scholarly teaching repertoire.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Education Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is offered to local students and international students with a current visa that extends until or beyond the minimum completion time for this course (1 year).",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must be full-time or fractional higher education academics at UTS, or casual higher education teachers who can provide evidence of ongoing teaching during course enrolment at UTS, or enrolled in a UTS higher research degree AND teaching at UTS, with a support letter from their principal supervisor. Upon meeting the selection criteria and being offered and accepting admission into the course, participants will be exempt from paying course fees through sponsorship by the University.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course is designed to support participants wishing to advance their careers as teaching and research or education-focused academics or casual university teachers.",
  "course_structure": "The course consists of 24 credit points of study, comprising of three core subjects and a range of elective options.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11228.html",
    "crawled_at": "2025-11-10T18:15:17.734504",
    "csv_source": "merged_Admission_Courses.csv"
  }
}