{
  "course_code": "C11292",
  "course_name": "Graduate Certificate in Vision Science",
  "credit_points": "24 Credit points",
  "cricos_code": "098504K",
  "overview": "Students enrolled in the Master of Orthoptics (C04299) can apply to transfer into this exit-only course after completing 24 credit points of specified study and gain a graduate certificate qualification.",
  "awards": [
    "Graduate Certificate in Vision Science (GradCertVisSc)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": "1 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Apply knowledge of ocular anatomy and physiology to vision science concepts. "
    },
    {
      "number": 2,
      "text": "Collaborate with peers, utilising accurate communication of concepts in vision science. "
    },
    {
      "number": 3,
      "text": "Identify ethical behaviour and apply evidence-based approaches in vision science. "
    },
    {
      "number": 4,
      "text": "Discuss health systems and concerns, in national and global communities. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This is an exit-only course. There is no direct admission to it. Current UTS students may be able to submit an Internal Course Transfer (Graduating) application to exit with this course. See the Course transfer page for further details.",
  "admission_requirements": "None; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "None",
  "course_structure": "This course comprises a total of 24 credit points.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11292.html",
    "crawled_at": "2025-11-10T18:40:49.359430",
    "csv_source": "merged_Admission_Courses.csv"
  }
}