{
  "course_code": "C11038",
  "course_name": "Graduate Certificate in Event Management",
  "credit_points": "24 Credit points",
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Event Management is suited to both those wishing to enter the events sector, and to those currently working in events who are seeking a formal qualification. The course is designed to introduce students to cutting edge knowledge and theories and to develop their skills and knowledge relating to the planning and management of various event forms.\n\nThe course is designed to expose students to best practice, current issues, and emerging trends in event management. Industry experts are engaged throughout course and assessment design, as well as in subject delivery, to ensure the integration of real-world practice against cutting edge theory. Research-inspired course content is delivered by world-leading academics and industry partners.",
  "awards": [
    "Graduate Certificate in Event Management (GradCertEvM)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": null,
  "duration_parttime": "1 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Develop solutions addressing community and business needs within an events context "
    },
    {
      "number": 2,
      "text": "Communicate clearly and effectively with a range of event stakeholders "
    },
    {
      "number": 3,
      "text": "Work effectively in teams to deliver project outcomes in a timely manner "
    },
    {
      "number": 4,
      "text": "Implement event management decisions to create positive outcomes for society and the environment "
    },
    {
      "number": 5,
      "text": "Use event management concepts and technological skills to demonstrate professional expertise in event management "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/ac208e01473ee610a31de422036d4350"
    },
    {
      "name": "Spring commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/14208e01473ee610a31de422036d434d"
    }
  ],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAll applicants who do not meet the academic requirement may still be considered on the basis of:\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service confirming the dates of employment, and the position held within the organisation.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include festival organiser, conference organiser/meeting planner, charity event coordinator, sport event manager, exhibition organiser, venue manager and event creative assistant.",
  "course_structure": "Students must complete a total of 24 credit points made up of four core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11038.html",
    "crawled_at": "2025-11-10T18:04:49.973861",
    "csv_source": "merged_Admission_Courses.csv"
  }
}