{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Diploma in Mathematics for Secondary Education is designed to re-train approved secondary school teachers, and approved primary school teachers with sufficient undergraduate mathematics studies, in teaching secondary mathematics. It comprises mathematics teaching methods and content that includes statistics, algebra, discrete mathematics and calculus.\n\nStudents benefit from the collaboration between mathematics specialists in the Faculty of Science, and Teacher Education academics in the School of International Studies and Education, and engage with core teaching methods and professional experience subjects specifically designed for teaching mathematics in years 7-12.\n\nThe program offers flexible modes of study enhancing opportunities for teachers working and studying locally or distantly and provides opportunities for all levels of study as defined by the NSW Department of Education. The program may also be relevant to teachers wishing to re-train in other State jurisdictions, but interstate candidates should check that the course meets the requirements of the Education Department in the relevant State.\n\nUpon completion, graduates are qualified to teach secondary mathematics up to NSW Higher School Certificate level. However, the NSW Department of Education has stipulated differing conditions in relation to the levels of studies required based upon the graduates' prior undergraduate studies in mathematics. Students should check the teach.NSW website to ensure they are studying at the appropriate level to meet their career aspirations.\n\nThe course is offered in a flexible mixed mode, with a large proportion of the course delivered online, and a small number of subjects requiring block attendance on campus.\n\nThis course incorporates flexible, part-time study to allow teachers in the workforce who wish to upgrade or enhance their skills to take up that opportunity without overloading their schedule. The teaching pedagogy reflects and scaffolds relevant types of remote or online learning that support the teachers in achieving the required learning outcomes.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Suspension of intake from Autumn Session 2023.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nPrevious qualification must be in teaching or education (FOE 070103 Teacher Education: Primary or 070105 Teacher Education: Secondary)\n\nAND\n\nApplicants must have a professional teaching qualification OR be eligible to seek provisional accreditation as per NESA guidelines.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course provides career opportunities for accredited teachers to develop skills and expertise in mathematics to enhance their career prospects. The NSW government has identified mathematics as a high-demand subject area and offers scholarships through teach.NSW to support retraining. Candidates should check the teach.NSW website for further information.",
  "course_structure": "Students must complete 48 credit points of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c06132.html",
    "crawled_at": "2025-11-10T16:17:53.026734",
    "csv_source": "merged_Admission_Courses.csv"
  }
}