{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Graduate Certificate in Mental Health is an interdisciplinary course designed to support learners who wish to expand their knowledge and understanding in mental healthcare. Students develop skills and strategies in supporting people who are impacted by mental health issues, including consumers, their families, carers, and communities. The course provides the opportunity to share and reflect upon personal perspectives and experiences and critically examine their application to principles, frameworks and evidence that underlie contemporary mental health care. The course encourages students to apply their learning to their own professional practice contexts while working through authentic and engaging content and assessments that challenge them to develop their own evidence informed practice.\n\nEducation should be transformational, it is more than obtaining a qualification to meet a career goal, it is about putting the student, at the centre of their learning experience and inspire them through their life long journey of learning and enquiry. The courses employ a co-design approach which bring together content and learning design experts to create high engaging and high-quality learning experiences. Developed in consultation with industry stakeholders, national and international experts in the field, the Graduate Certificate in Mental Health is contemporary and responsive, ensuring that graduates are well prepared to meet the current and future needs of the healthcare system.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include clinical nurse specialist, education and leadership roles.",
  "course_structure": "The course comprises 24 credit points, made up entirely of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11333.html",
    "crawled_at": "2025-11-10T18:52:22.916516",
    "csv_source": "merged_Admission_Courses.csv"
  }
}