{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "Technologies and practices in Medical Science are innovating at a rapid rate. The UTS Graduate Certificate in Medical Science Innovation is an advanced program designed for individuals seeking career progression or those looking to equip themselves with contemporary knowledge about advancements in the sector.\n\nThe program delivers up-to-date content about the latest innovations in precision medicine, medical technologies, big data and health systems. Students develop forward-looking and specialised knowledge to become valued, solutions-focused experts for organisations and communities.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.5; or TOEFL: internet based: 79-93 overall with a writing score of 24; or AE5/AE6: Pass; or PTE: 58-64 overall with a writing score of 58; or C1A/C2P: 176-184 overall with a writing score of 176.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include clinical operations manager, clinical trial administrator, medical advisor, medical science communication, medical science liaison.",
  "course_structure": "The course comprises a total of 24 credit points and consists of five compulsory core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c11364.html",
    "crawled_at": "2025-11-10T19:10:40.230928",
    "csv_source": "merged_Admission_Courses.csv"
  }
}