{
  "course_code": "C04250",
  "course_name": "Juris Doctor Master of Business Administration",
  "credit_points": "192 Credit points",
  "cricos_code": "074765J",
  "overview": "The Juris Doctor Master of Business Administration gives students exposure to theoretical learning and professional practice in the disciplines of law and business. It is an Australian Qualifications Framework Level 9 master's qualification that provides an alternative pathway to a legal career for graduates of disciplines other than law.\n\nStudents study industry informed, academically rigorous and highly practical law subjects, preparing them for a legal career or for roles in other sectors where legal expertise is of value. In the MBA, they combine the study of fundamental business concepts, such as accounting, economics, management and marketing, with a choice of major, sub-major or electives.\n\nUpon graduation, students are effective, adaptable and ready to operate in a global legal or business environment. This course meets the academic requirements for admission to practise law in NSW. Practical legal training – the practical requirement for admission as a lawyer in NSW – can also be completed at UTS.",
  "awards": [
    "Master of Business Administration (MBA) Juris Doctor (JD)"
  ],
  "faculty": [
    "Law",
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "4 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course satisfies the requirements for admission as a lawyer to the Supreme Court of NSW, provided students undertake a PLT program, such as the Graduate Certificate in Professional Legal Practice (C11232).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Synthesise a complex body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to critically reflect upon and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Generate appropriate theoretical and practical responses to problems and questions in law, applying advanced legal research skills, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "Generate solutions to complex legal issues through effective collaboration and communicate accurately and persuasively in multidisciplinary contexts with a variety of audiences and in a range of specialised and technical formats. "
    },
    {
      "number": 5,
      "text": "Critically reflect on the intersection between Indigenous perspectives, legal processes and professional practice to build capacity to work for and with Indigenous Australians in a professional context. "
    },
    {
      "number": 6,
      "text": "Synthesise critical thinking and advanced analytical skills to develop creative solutions that address strategic business issues in complex contexts. "
    },
    {
      "number": 7,
      "text": "Communicate business information effectively to various stakeholders to achieve desired business outcomes. "
    },
    {
      "number": 8,
      "text": "Interact and collaborate with colleagues and stakeholders to work effectively to achieve desired business outcomes. "
    },
    {
      "number": 9,
      "text": "Evaluate and apply principles of ethics, sustainability, social responsibility, and Indigenous values, to decision-making in business. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/d93c860483ecba10fed7d4326daad3cc"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/193cc60483ecba10fed7d4326daad322"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nPrevious qualifications must be in a discipline other than law or a law qualification from an overseas jurisdiction.\n\nIf an applicant does not formally meet the selection criteria but the Faculty of Law deems the applicant to be eligible based on evidence of prior learning and demonstrated capability, the Faculty reserves the right to make an offer to the appropriate course.\n\nApplicants may be asked to provide additional information to assist in the assessment of their application for admission.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include, but are not limited to, lawyer within a private firm, government department or community law centre, regulatory affairs and policy adviser in the public or private sector or legal specialisation related to students' previous degree or enhanced career options within an existing professional sphere.",
  "course_structure": "The course comprises a total of 192 credit points. The study components for course completion are as follows:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04250.html",
    "crawled_at": "2025-11-10T14:40:49.495250",
    "csv_source": "merged_Admission_Courses.csv"
  }
}