{
  "course_code": "C04364",
  "course_name": "Juris Doctor Graduate Certificate in Trade Mark Law and Practice",
  "credit_points": "156 Credit points",
  "cricos_code": "None",
  "overview": "UTS has established expertise and a reputation for providing courses relevant to the needs of the patent and trade marks professions. This course reflects the range of topics required for registration as a trade marks attorney in Australia under the relevant regulations. The Juris Doctor (JD) is a graduate law degree that builds on the established reputation of UTS: Law to provide high-calibre, graduate-level education in the theory and practice of the law. It is specifically designed for graduates of disciplines other than law.\n\nThis trade mark law component of the course provides graduates with an understanding of the principles of the registered trade mark system, the protection of unregistered marks and related forms of protection against misleading or unfair trading conduct in Australia. The unique feature is that it may be undertaken entirely online, removing the need for students to attend face-to-face classes.\n\nThe Juris Doctor component qualifies as an Australian Qualifications Framework level 9 master's degree. The flexible nature of the JD allows students to work while they study and to tailor their workload to suit professional and personal commitments.",
  "awards": [
    "Juris Doctor (JD) Graduate Certificate in Trade Mark Law and Practice (GradCertTMLP)"
  ],
  "faculty": [
    "Law"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The Juris Doctor component of the course satisfies the requirements for admission as a lawyer to the Supreme Court of NSW, provided students undertake a PLT program, such as the Graduate Certificate in Professional Legal Practice (C11232).\n\nSubject to final board approval, where applicants have a requisite tertiary qualification as stipulated by the Trans-Tasman IP Attorneys Board for Patent and Trade Marks Attorneys, this course provides the accredited subjects which satisfy the educational requirements necessary for registration as a Trade Marks Attorney in Australia and New Zealand. Prospective students should check with the Trans-Tasman IP Attorneys Board for specific subjects required to be completed for registration.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Synthesise a complex body of legal knowledge to demonstrate an understanding of the broader contexts in which legal issues arise, and the law operates. "
    },
    {
      "number": 2,
      "text": "Demonstrate professional integrity and accountability through the ability to critically reflect upon and respond to ethical challenges in legal practice. "
    },
    {
      "number": 3,
      "text": "Generate appropriate theoretical and practical responses to problems and questions in law, applying advanced legal research skills, critical analysis and evaluation. "
    },
    {
      "number": 4,
      "text": "Generate solutions to complex legal issues through effective collaboration and communicate accurately and persuasively in multidisciplinary contexts with a variety of audiences and in a range of specialised and technical formats. "
    },
    {
      "number": 5,
      "text": "Critically reflect on the intersection between Indigenous perspectives, legal processes and professional practice to build capacity to work for and with Indigenous Australians in a professional context. "
    },
    {
      "number": 6,
      "text": "Demonstrate understanding of a body of legal knowledge relating to trade marks law and practice and contemporary developments in law and its professional practice. "
    },
    {
      "number": 7,
      "text": "Apply principles and approaches to ethical decision-making and professional responsibility in professional practice. "
    },
    {
      "number": 8,
      "text": "Apply skills in legal research, critical analysis and evaluation to problems and questions in trade marks law and practice. "
    },
    {
      "number": 9,
      "text": "Reflect on the limitations of trade mark law for advancing Indigenous interests to inform future practice as trade mark professionals. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/6749e76fc3beee50020e061ad00131e6"
    }
  ],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nFor this course the equivalent qualification required is a bachelor's degree or a law qualification from an overseas jurisdiction.\n\nIf an applicant does not formally meet the selection criteria but the Faculty deems the applicant to be eligible based on evidence of prior learning and demonstrated capability, the Faculty reserves the right to make an offer to the appropriate course.\n\nApplicants may be asked to provide additional information to assist in the assessment of their application for admission.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options also include, but are not limited to, lawyer within a private firm, government department or community law centre, trade marks attorney, regulatory affairs and policy adviser in the public or private sector or legal specialisation related to students' previous degree or enhanced career options within an existing professional sphere.",
  "course_structure": "The course comprises a total of 156 credit points. The study components for course completion are as follows:\n\nSubjects are timetabled annually, but not all subjects are offered every session. The UTS Timetable Planner enables current and future UTS students to view subject timetables.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04364.html",
    "crawled_at": "2025-11-10T15:19:16.825259",
    "csv_source": "merged_Admission_Courses.csv"
  }
}