{
  "course_code": "C04427",
  "course_name": "Master of Education (Learning and Leadership)",
  "credit_points": "72 Credit points",
  "cricos_code": "None",
  "overview": "As demand for education and learning professionals grows, leading learning and innovation is becoming critical to meeting contemporary and emerging issues in diverse workplaces.\n\nThe Master of Education (Learning and Leadership), offered fully online, is designed for professionals who are looking to lead and support learning innovation in their practice or organisation, whether in corporate, health, public sector, school, higher education or community settings.\n\nThe course aims to provide students with a robust and flexible toolkit of research-informed skills and knowledge to enhance and innovate learning practices.\n\nThe Master of Education (Learning and Leadership) allows students to customise their learning and assessments to meet specific professional aspirations and upskilling needs. With a focus on fostering learning practices, investigating learning and innovation, and leading learning and innovation, the course aims to provide students with specialised knowledge, skills and opportunities to shape learning within a professional context.\n\nStudents engage and learn with globally connected teaching staff who are actively involved in cutting-edge research using award winning approaches to teaching and learning.\n\nUnique to UTS, this course is designed with busy full-time working professionals in mind. Being fully online, the course helps students feel accomplished and supported at the same time.",
  "awards": [
    "Master of Education (Learning and Leadership)"
  ],
  "faculty": [
    "Arts",
    "and",
    "Social",
    "Sciences"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Synthesise advanced knowledge of complex concepts to make research and theory informed judgements about a broad range of professional learning and / or leading practices. "
    },
    {
      "number": 2,
      "text": "Lead, develop and/or evaluate innovative learning technologies and approaches in professional contexts. "
    },
    {
      "number": 3,
      "text": "Apply research skills to investigate complex learning, leading or innovation practices. "
    },
    {
      "number": 4,
      "text": "Apply and critically evaluate principles of social justice, impact and engagement within local, national and global contexts as responsible, ethical and accountable learning professionals. "
    },
    {
      "number": 5,
      "text": "Apply effective communication and interpersonal skills to engage diverse audiences around complex professional practice issues. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Education Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Session 2 commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/ef65006e471c2e10413994ed036d434c"
    }
  ],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates of the Master of Education (Learning and Leadership) are well equipped to lead innovative learning across diverse environments in the context of rapidly evolving digital technologies and work practices. Career options include Corporate Learning and Development, School Leadership/Learning and Development, Nurse/health educator, Learning Designer/Technologist, Training/Learning Consultant, Adult Community Educator, Coaching/Mentoring, Organisational Development, Capability Manager, and Trainer/Facilitator.",
  "course_structure": "Students must complete 72 credit points made up of nine core and three elective subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04427.html",
    "crawled_at": "2025-11-10T15:44:06.652951",
    "csv_source": "merged_Admission_Courses.csv"
  }
}