{
  "course_code": "C04426",
  "course_name": "Master of Finance (Offshore)",
  "credit_points": "72 Credit points",
  "cricos_code": "None",
  "overview": "The Master of Finance provides a comprehensive range of skills and expertise expected of leading practitioners in the banking and finance sectors. The finance program provides participants with the opportunity to acquire knowledge of finance theory and techniques for leading-edge professional practice purposes.\n\nThe Master of Finance is recognised by the China Ministry of Education and there is no need for further public examination and assessment when applying for jobs in China. Face-to-face intensive teaching by leading academics from UTS as well as access to the same high-quality teaching resources as Sydney-based UTS students are offered. The practical course design allows students to study and work at the same time, matching the knowledge and skills learned to the opportunities and channels for work promotion and advancement.",
  "awards": [
    "Master of Finance (MFin)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "China"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "Modern Standard Chinese",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Critically analyse and apply innovative and integrated solutions to address complex business decisions "
    },
    {
      "number": 2,
      "text": "Communicate financial information and decisions clearly in an appropriate form to business stakeholders "
    },
    {
      "number": 3,
      "text": "Interact with colleagues and stakeholders to work effectively in teams and deliver agreed project outcomes "
    },
    {
      "number": 4,
      "text": "Critically evaluate and apply sustainability principles to decisions in business contexts "
    },
    {
      "number": 5,
      "text": "Lead ethical principles in professional financial practice "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is only offered offshore. It is available in Shanghai. The language of tuition is Modern Standard Chinese.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include management-level positions in industry or government.",
  "course_structure": "Students must complete 72 credit points made up of 12 six-credit-point subjects, with the first four subjects comprising the Graduate Certificate in Finance (C11334).\n\nSix 12-week teaching sessions are scheduled over two years. Two subjects are delivered concurrently during each teaching session. The subjects are delivered in combined block-mode lectures and weekly tutorials, and self-directed study. The student engagement in each teaching session is as follows:",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04426.html",
    "crawled_at": "2025-11-10T15:43:11.082156",
    "csv_source": "merged_Admission_Courses.csv"
  }
}