{
  "course_code": "C04315",
  "course_name": "Master of Property Development and Investment",
  "credit_points": "96 Credit points",
  "cricos_code": "089510J",
  "overview": "This course is designed for both property and real estate investment practitioners, and graduates in related fields who wish to extend their qualifications and expertise in property development and investment. Graduates have a commitment to professionalism in the property and real estate investment sectors.\n\nThis course is for property and investment professionals who want to upgrade their qualifications or expertise or for those who wish to enter the property and real estate investment industries. In the first year students develop an understanding of how to balance private and public interests in urban development, how to evaluate real estate assets, and how to assess development feasibility.",
  "awards": [
    "Master of Property Development and Investment (MPropDevInv)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "Building"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Communicate and collaborate effectively in property development, investment, and scholarly contexts. "
    },
    {
      "number": 2,
      "text": "Analyse and integrate ethical considerations and diverse perspectives in property development, investment, and scholarly contexts. "
    },
    {
      "number": 3,
      "text": "Apply technical and analytic skills to a professional standard to different types of asset classes, such as income-producing and development projects, to understand risks and make appropriate decisions and recommendations. "
    },
    {
      "number": 4,
      "text": "Determine the legal and policy context within which property development occurs, the nature of land rights and claims of Indigenous peoples in Australian cities, and the role of various levels and agencies of government. "
    },
    {
      "number": 5,
      "text": "Employ research principles and methods to generate and critically evaluate ideas and concepts in property development, investment, and scholarly contexts. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/72420ec3833b2e10fed7d4326daad3eb"
    },
    {
      "name": "Spring commencing, Full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f972464347b7a610413994ed036d4301"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have one of the following:\n\nAbove applicants need to provide:\n\nApplicants who do not satisfy the academic and additional requirements above may be considered on a UTS recognised bachelor's degree, or higher qualification in an unrelated field, along with:\n\n*Work experience from within the following ANZSCO Occupation descriptors will be deemed as relevant. • 61. Real Estate, 31. Building and Surveying Eng, 23, 26, 31.Engineers, 13, 14, 22, 61. Manager\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in banking and government instrumentalities, real estate finance, property management and development, and real estate investment.",
  "course_structure": "Students must complete 96 credit points made up of 84 credit points of core subjects and 12 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04315.html",
    "crawled_at": "2025-11-10T15:09:43.315614",
    "csv_source": "merged_Admission_Courses.csv"
  }
}