{
  "course_code": "C03029",
  "course_name": "Master of Science (Research)",
  "credit_points": null,
  "cricos_code": "030869J",
  "overview": "The Master of Science (Research) provides an opportunity for students to acquire research skills and deepen their knowledge in an area of science.\n\nStudents work under the guidance of a supervisor who is a full-time academic staff member of the faculty. Students are examined through the presentation of a thesis, and may be required to take prescribed subjects in research methodology or any other subject deemed necessary by their principal supervisor. In addition, students are expected to undertake extra activities in consultation with their supervisor to enhance and develop their skills as a researcher, where these activities are documented each year in the form of a study plan.",
  "awards": [
    "Master of Science (Research)"
  ],
  "faculty": [
    "Science"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Research degrees are offered on a sponsored, scholarship, faculty part-sponsored or full-fee-paying basis. Contact UTS: Science or the UTS: Graduate Research School for further details.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include environmental consultant, medical scientist, researcher, resource manager, scientist or technologist.",
  "course_structure": "Students work under the guidance of a supervisor who is a member of the full-time academic staff of the University. The degree is examined through presentation of a thesis. Students may be required to take a prescribed subject in research methodology or any other subject deemed necessary by their principal supervisor or the Faculty Research Committee.\n\nStudents are required to discuss their study plan with their supervisor(s) before the commencement of their research degree.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03029.html",
    "crawled_at": "2025-11-10T14:06:21.139281",
    "csv_source": "merged_Admission_Courses.csv"
  }
}