{
  "course_code": "C04252",
  "course_name": "Master of Pharmacy",
  "credit_points": "120 Credit points",
  "cricos_code": "074915M",
  "overview": "The Master of Pharmacy is an accredited two-year graduate-entry degree leading to eligibility for registration as a pharmacist. Innovative and practice-based in approach, the course builds on students' strong scientific foundation to provide specialist, comprehensive knowledge relevant to contemporary pharmacy practice. In addition to the pharmaceutical sciences, this includes professional pharmacy services, integrated therapeutics and the unique capstone subject, 96014 Molecule to Market, supported by industry leader Adjunct Professor John Montgomery. Two elective subjects provide students with the opportunity to individualise their studies with their choice of any available postgraduate subject offered at UTS.\n\nDeveloped by leading pharmacy academics and an expert educational designer, the course's subject matter is delivered in an integrated, student-focused manner, making use of cutting-edge technologies and strong links with the pharmacy profession. Expert guest lecturers and practitioner teachers are utilised throughout the course to ensure relevance and real-world application of content.\n\nStudents undertake clinical practice in a wide variety of settings sourced by UTS throughout the degree. This includes a guaranteed hospital pharmacy placement for eligible students. On-campus learning takes place in the Graduate School of Health's state-of-the-art education and research facility, which opened in 2019.",
  "awards": [
    "Master of Pharmacy (MPharm)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This program has been granted accreditation by the Australian Pharmacy Council and is approved by the Pharmacy Board of Australia as a qualification leading to registration as a pharmacist in Australia.\n\nUpon completion of the degree, graduates must complete a compulsory pre-registration training period and Intern Training Program in order to be eligible for registration.\n\nInternational students\n\nInternational students intending to apply for registration with the Pharmacy Board of Australia must meet the Pharmacy English Language Skills Registration Standard.",
  "learning_outcomes": [
    {
      "number": 2025,
      "text": "International students can apply immediately. It is recommended to apply early, as applications and eligibility for interviews are assessed on a rolling basis. Applications close once all places have been filled. There are a… For more content click the Read More button below. The next available intake for this course is February"
    },
    {
      "number": 1,
      "text": "Demonstrate safe and competent operational, interpersonal and clinical skills for the benefit and care of patients and the wider community. "
    },
    {
      "number": 2,
      "text": "Reflect on knowledge, skills and attributes required for the evaluation and integration of emerging evidence into practice, promoting the growth of personal and professional learning and the education of others. "
    },
    {
      "number": 3,
      "text": "Analyse and synthesise knowledge of health science concepts and theory, and apply skills of scientific research and clinical reasoning to support decision-making in pharmacy practice. "
    },
    {
      "number": 4,
      "text": "Effectively engage in diverse healthcare teams, optimise patient outcomes through interprofessional collaboration, and capably communicate with patients, carers and colleagues. "
    },
    {
      "number": 5,
      "text": "Demonstrate sound ethical, compassionate and respectful patient-focused care, uphold professional codes of conduct, and take responsibility for personal health and wellbeing. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/4bf41145c33e2250020e061ad00131c9"
    }
  ],
  "notes": "It is recommended that domestic and international students apply before 31 October. Applications will close once all places have been filled. It is recommended to apply early, as applications and eligibility for interview will be assessed on a rolling basis.\n\nIndigenous applicants should apply via UTS Student Portal and will be contacted by the Indigenous Student Liaison Officer with further information. Indigenous applicants are welcome to submit cultural and/or community referees to accompany their application.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nEntry is competitive and assessment is based on grade point average (GPA). Applicants must have also completed the following subjects at a tertiary level within the last 10 years and must provide relevant subject outlines with their application:\n\nFor prerequisite checking, students must submit a completed Prerequisite Assessment Table with their application. Prerequisite subject approvals are subject to change as they undergo an annual academic review (a new assessment is required for each new intake). Prior to applications opening, the Prerequisite Assessment Table may be submitted to GSH.Future@uts.edu.au for pre-assessment. A pre-reassessment is not required to apply and will not be conducted once applications open.\n\nPrerequisites may be completed as non-award units at a recognised tertiary institution if students did not complete them as part of their undergraduate degree. Please note, all prerequisite subjects must be assessed and approved by the school. Prior to commencing a subject to fulfil this requirement, please request a pre-assessment by emailing gsh.future@uts.edu.au.\n\nSelected applicants are required to undertake a short interview with a panel. Applicants are assessed in the areas of communication skills, interpersonal skills, interest in pharmacy, and commitment to pharmacy as a career.\n\nProfessional and clinical requirements\n\nAll successful applicants are required to:\n\nUpon completion of this degree, graduates must complete a compulsory pre-registration training period and Intern Training Program in order to be eligible for registration as a pharmacist in Australia. Applicants who have already completed a pharmacy degree overseas are also required to submit a personal statement stating their motivation for wanting to repeat a pharmacy qualification.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: minimum 7.0 overall with a minimum of 7.0 in each subtest; or TOEFL: internet based: minimum 94 overall with a minimum score of 24 for reading and listening, 23 for speaking and 27 for writing; or PTE: minimum 65 overall with a minimum score of 65 in each subtest.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include: community pharmacy; professional pharmacy services; hospital pharmacy; drug research, design and development; professional roles in pharmaceutical industry; primary health care; consultancy; education; government and policy; the armed forces; and non-profit organisations.",
  "course_structure": "This course comprises a total of 120 credit points. Students undertake a total of 16 6-credit-point subjects and four 6-credit-point clinical subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04252.html",
    "crawled_at": "2025-11-10T14:42:58.783442",
    "csv_source": "merged_Admission_Courses.csv"
  }
}