{
  "course_code": "C04296",
  "course_name": "Master of Information Technology (Extension)",
  "credit_points": "96 Credit points",
  "cricos_code": "084254E",
  "overview": "This course is designed to enable students to achieve a comprehensive and greater understanding of information technology in specialised technical or management areas for the IT professional. The wide range of specialisations allows students to tailor the course to satisfy and to broaden their career development needs.\n\nIt is essential to keep IT knowledge and skills up to date. This course provides students with an enhanced understanding of the business context and technical developments shaping contemporary information and communications technology (ICT), and equips them to meet the challenges of working in the IT industry, as well as providing the opportunity to develop skills in alternative IT disciplines.\n\nStudents who wish to undertake a substantial research project have the opportunity to transfer to the Master of Information Technology (Advanced) (C04297).",
  "awards": [
    "Master of Information Technology in (name of IT major) (MIT)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "Graduates are eligible to apply for professional-level membership of the Australian Computer Society.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Business Information Systems major, Internetworking sub-major, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/89392f6347b22650a31de422036d43ac"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIt is a requirement that the bachelor's degree be in information technology, with no more than 25 per cent of subjects failed. Applicants are required to have satisfactorily completed subjects in programming, data modelling, and networking equivalent to the Professional stream (IT) component of the Master of Information Technology (C04295).\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Depending on the major selected, career options include a wide variety of positions in the IT industry, including business intelligence expert, e-business developer, games developer, information systems manager, IT security analyst, IT security manager, ICT security analyst, IT security consultant, pen testing, IT project manager, movie animator, software architect, software quality/testing specialist and systems analyst.",
  "course_structure": "Students are required to complete 96 credit points, comprising:\n\nThe sub-major must be taken in a different field to that of the major.\n\nThe number of electives depends on whether students choose a 6-credit-point or 12-credit-point project.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04296.html",
    "crawled_at": "2025-11-10T15:02:26.121246",
    "csv_source": "merged_Admission_Courses.csv"
  }
}