{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Behavioural Economics provides thorough training in behavioural economics and its application in the industry and government. This course provides a foundation in standard economic theory and builds the behavioural models on this foundation. This includes heuristics and biases in individual decision making and their implications in strategic interactions. Students are also provided with a grounding in fundamental tools of applied behavioural science, such as causal inference, trial design and ethical review.\n\nStudents are given the opportunity to apply behavioural economics concepts in different decision-making environments, including financial decision making, health, education, and the environment. The Master includes hands-on training where students develop their own research project or work on an applied question for an actual industry or government organisation.\n\nThis course is designed to train a well-rounded behavioural economist to take leading positions in behavioural units or other relevant professions (e.g. consultancy, management, marketing).",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include working as behavioural economics practitioners in industry or government.",
  "course_structure": "The course totals 72 credit points and consists of a combination 3 and 6 credit points subjects (60 credit points) and 12 credit points of research or internship project.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04440.html",
    "crawled_at": "2025-11-10T15:50:36.449799",
    "csv_source": "merged_Admission_Courses.csv"
  }
}