{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Science Master of Business Administration produces ‘lab to leadership' professionals who can operate at the cutting edge of business practice and scientific innovation. Drawing on the world-leading curriculum of these two flagship UTS degrees, this one-of-a-kind qualification equips students with expertise in their chosen area of science; core business skills such as finance, marketing and change management; and specialist business-science knowledge that plays a key role in realising research impact.\n\nSupported by teaching excellence, industry collaboration and access to cutting-edge facilities and technologies in both the Faculty of Science and the UTS Business School, students gain the theoretical, practical and professional expertise to deliver meaningful impact in the global science sector and in other industries where science has the power to drive change. Graduates emerge as scientific leaders, strategic thinkers and creative problem solvers, ready to lead where science and business meet.\n\nScience\n\nStudents select one of five specialisations from the Master of Science, building high-level expertise in their chosen scientific domain:\n\nBusiness\n\nStudents complete a mix of core and elective business and business-science subjects:",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nAll applicants: the degree must be in an area related to their chosen major in the Master of Science component of the course.\n\nApplicants with a bachelor's degree must also satisfy one of the following:\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service, confirming the dates of employment and the position held within the organisation.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "As demand for qualified STEM professionals continues to grow, graduates emerge ready to integrate their scientific expertise into a range of crucial business functions, including upscaling; identifying new market sectors; and preparing for major business transformations informed by scientific thinking. These skills offer real value to organisations across almost any sector, particularly those operating in the technical and product development, manufacturing, medical science, environmental science, energy and transport domains.",
  "course_structure": "Students must complete 96 credit points made up of 36 credit points of core Business subjects and 6 credit points of core Science Business subjects, ensuring business administration principles are contextualised to science. A 48 credit point Science major of choice and a 6 credit point Business elective complete the program.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04448.html",
    "crawled_at": "2025-11-10T15:56:26.139812",
    "csv_source": "merged_Admission_Courses.csv"
  }
}