{
  "course_code": "C03051",
  "course_name": "Master of Analytics (Research)",
  "credit_points": "12 Credit points",
  "cricos_code": "075277F",
  "overview": "UTS is at the forefront of analytics education in Australia with its focus on practice-based, interdisciplinary analytics and decision-making research. Big data in the internet age is very complex and growing exponentially, posing greater challenges for organisations.\n\nIn this course, students can focus on real-world business problems in their own organisations and develop solutions as part of their research. This course enables graduates to extend and deepen their knowledge in a specialised area of analytics by undertaking research under the supervision of a member of academic staff.\n\nThe core program is supplemented by short courses, seminars and projects. These courses provide academic rigour while using cutting-edge technologies.\n\nThe course offers flexibility in the choice of research topics so that the research is closely aligned with the student's professional requirements. Students can undertake research in analytics to solve the problems that directly impact their organisations: research with a purpose.\n\nAdvanced analytics techniques and solutions are increasingly being used by industry to drive productivity, transform business and increase competitiveness. The demand for skilled analytics professsionals with the ability to work in both traditional and emerging industries continues to grow. With high-level analytics skills graduates are able to make a significant contribution to their organisation. Students also benefit from being able to work with world-leading researchers in this area.",
  "awards": [
    "Master of Analytics (Research)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nPrevious qualifications must have a major in analytics, computing, applied statistics or applied mathematics. Before submitting a formal application for admission, applicants should seek the approval of a potential supervisor for their proposed research work.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "There is a skills shortage of professionals with work-ready skills in analytics. The demand for skilled professionals in analytics crosses a range of industries from banking, e-commerce, education, finance, government, health, insurance, marketing, taxation, telecommunications and transport. In a knowledge economy there is significant demand for graduates in this area.",
  "course_structure": "Candidates are required to complete two subjects covering technology research preparation and technology research methods respectively (some candidates may be exempt from completing these subjects), and selected learning modules, seminars, projects and practice.\n\nThe degree is examined through presentation of a thesis.\n\nAll thesis students are required to submit, in consultation with their supervisor(s), a progress report at the end of each session. The UTS: Graduate Research School contacts each student and their supervisor(s) to initiate this process.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03051.html",
    "crawled_at": "2025-11-10T14:12:08.960325",
    "csv_source": "merged_Admission_Courses.csv"
  }
}