{
  "course_code": "C03056",
  "course_name": "Master of Orthoptics (Research)",
  "credit_points": null,
  "cricos_code": "086292E",
  "overview": "This course is intended for orthoptists, or students who have completed a relevant degree, who wish to pursue a career in research or gain a competitive advantage in their career by completing an additional postgraduate qualification. Students gain research skills and expertise in their area of research interest, and demonstrate their outstanding academic ability and commitment to orthoptics through the completion of the degree.\n\nThis course provides students the opportunity to work with leading national and international researchers in their area of interest to develop and complete an original research project which contributes to knowledge. Students gain research training and skills, as well as developing extensive knowledge and expertise in an area of research. Students are supported by a strong and vibrant research culture, both within the school and the university, and have access to other researchers, a wide variety of workshops, the university library and research facilities.",
  "awards": [
    "Master of Orthoptics (Research)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This course is excellent preparation for those students who wish to pursue doctoral research study, a career in research or higher level orthoptics positions. Career options include academic appointments, expanded practice roles, advisory positions and industry roles.",
  "course_structure": "This course consists of one thesis subject which is undertaken for the duration of the degree.\n\nStudents are required to undertake a candidature assessment at the end of the first two sessions for full-time students, and at the end of the first three sessions for part-time students. Students work closely with a principal supervisor and a supervisory panel, and are required to report on their progress each session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03056.html",
    "crawled_at": "2025-11-10T14:16:10.087073",
    "csv_source": "merged_Admission_Courses.csv"
  }
}