{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "This course provides an opportunity at master's level for professional engineers to explore specific aspects of engineering in depth by undertaking a substantial research study in their field of specialisation. Students undertake at least 48 credit points of coursework and a research project of 24, 36, or 48 credit points under the supervision of a member of academic staff.\n\nThe course follows an integrated approach to professional practice through professional engineering subjects, subjects relating to the chosen major, an independent research project in at least one field of engineering, and a set of electives.\n\nThis course is designed to create a pathway for eligible students into higher degree by research (HDR) programs such as the Doctor of Philosophy (PhD). Upon completion of this course, students seeking admission to an HDR program are required to follow the prescribed admission process.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "Admission to this course is restricted to students enrolled in the Master of Engineering (C04271) or Master of Engineering (Extension) (C04277) and is made by internal course transfer.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants are required to have: (i) completed 48 credit points in the Master of Engineering (C04271) or Master of Engineering (Extension) (C04277); and (ii) received approval from a member of academic staff to act as their research project supervisor.\n\nApplicants should contact the Faculty to request a copy of the research project application form. The completed form (signed by the potential supervisor) should be attached to the application for internal course transfer.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Students who hold an undergraduate engineering degree are able to enhance their knowledge and ability through postgraduate-level study in their respective majors, enabling them to gain and hold employment in relevant engineering fields. Students who are currently employed are able to enhance their opportunity to solve engineering problems encountered in their profession and thus may receive commendation for their achievement. There may be opportunities in the research and development areas related to their specific engineering field.",
  "course_structure": "Candidates complete coursework subjects and an independent graduate project totalling 96 credit points. The project component consists of a preparatory subject and a project (in the area of the major) which must be undertaken in successive sessions.\n\nSome majors may require students to complete a number of prescribed subjects with or without opportunity for electives. Subjects are selected from postgraduate programs offered by the Faculty of Engineering and Information Technology.\n\nA major is granted if subjects and project totalling at least 60 credit points are completed within one of the designated majors.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04278.html",
    "crawled_at": "2025-11-10T14:53:34.337677",
    "csv_source": "merged_Admission_Courses.csv"
  }
}