{
  "course_code": "C04238",
  "course_name": "Master of Professional Accounting",
  "credit_points": "72 Credit points",
  "cricos_code": "061285K",
  "overview": "The Master of Professional Accounting provides graduates with the necessary skills, knowledge, and expertise for a career in professional accounting practice, and meets the requirements for professional recognition, including CPA Australia (CPAA) and Chartered Accountants of Australia and New Zealand (CAANZ).\n\nThe subjects in this course are highly practical and focused on developing work-ready skills and competencies required in contemporary practice. The professional recognition of the course provides students with qualifications that enhance both their employment and promotion opportunities.",
  "awards": [
    "Master of Professional Accounting (MProfAcc)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": "3 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course meets educational membership requirements for entry into CPA Australia (CPAA), Chartered Accountants of Australia and New Zealand (CAANZ), Chartered Institute of Management Accountants (CIMA), Association of Chartered Certified Accountants (ACCA), and Institute of Public Accountants (IPA).",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Critically analyse, adapt, and apply accounting practices to address complex business problems "
    },
    {
      "number": 2,
      "text": "Communicate accounting information and decisions clearly in an appropriate form to business stakeholders "
    },
    {
      "number": 3,
      "text": "Collaborate with peers and stakeholders to achieve desired business outcomes "
    },
    {
      "number": 4,
      "text": "Evaluate and apply principles of social responsibility and cultural diversity to decisions in professional accounting practice "
    },
    {
      "number": 5,
      "text": "Apply ethical principles and professional integrity in the context of professional accounting practice "
    },
    {
      "number": 6,
      "text": "Demonstrate high level technical skills necessary to operate effectively in professional accounting practice "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/211dab27c3feee50020e061ad00131b5"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/251dab27c3feee50020e061ad00131b9"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include accounting and finance roles in commercial firms and professional accounting and advisory firms, and management-level positions in industry or government, as well as not-for-profit organisations. With the CPAA and CAANZ qualifications being recognised internationally, the prospect for overseas employment is also enhanced.",
  "course_structure": "The course totals 72 credit points, made up of 12 core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04238.html",
    "crawled_at": "2025-11-10T14:38:51.708660",
    "csv_source": "merged_Admission_Courses.csv"
  }
}