{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Creative Intelligence and Strategic Innovation (MCISI) is a new type of postgraduate product specifically positioned to transform organisational capacity to develop new ways to respond to the open, complex, dynamic and networked problems they now face in their work.\n\nThis course provides flexible transdisciplinary professional learning pathways that allow participants to traverse the boundaries between disciplines, professional fields and sectors to stimulate innovation. It also enables groups of participants from partner organisations to learn by immersing themselves in authentic transdisciplinary professional learning experiences, working with staff across UTS and international experts on the re-invention of their organisations, professions, and sectors based on emerging transdisciplinary ways of working.\n\nThe course has been designed to suit both the needs of partner organisations and individual participants’ aspirations by offering flexible, blended, and bespoke elements.\n\nThis course focuses on providing a flexible professional learning pathway for organisations and individuals to support them in developing their innovation profile and strategic leadership capacity. Participants are offered the flexibility to select subjects that are relevant to their practice, and personalise a master's-level program of study that is aligned with their organisation’s strategic goals and their personal career aspirations. It also enables participants to engage in a lifetime of learning that is relevant to the circumstances and stages in their professional lives.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the TD School Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is also available to international students by distance mode only. International students are not eligible for a student visa to study this course in Australia.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIn addition to the required academic qualifications, applicants need to have a minimum of two year's full-time (or equivalent part-time) work experience demonstrated through:\n\nApplicants who do not satisfy the minimum admission requirements listed above may be deemed eligible for admission if they:\n\nTo support their applications, those applicants must provide a one-page Personal Statement outlining the above.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include line managers, team leaders, middle and senior professionals.",
  "course_structure": "Students must complete 72 credit points made up of 18 credit points of core subjects, 18 credit points of key enabling methodology subjects, 6 credit points of studio choice and 30 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04403.html",
    "crawled_at": "2025-11-10T15:37:02.471613",
    "csv_source": "merged_Admission_Courses.csv"
  }
}