{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "Major regulatory changes and the emergence of new types of financial risk means that skilled quantitative finance professionals are more in demand than ever. The UTS postgraduate Quantitative Finance program is recognised in Australia and overseas as a leading qualification for aspiring and established quantitative finance professionals.\n\nDesigned by industry experts and leading UTS quantitative finance academics, the Master of Mathematics in Quantitative Finance has been designed to meet demand in this specialist field among graduates seeking to build their academic quantitative expertise. Through a combination of theoretical learning and hands-on experience, students gain the skills and professional competencies required to measure and manage risk in today’s complex financial markets.\n\nExplore our quantitative finance degrees UTS offers a suite of postgraduate quantitative finance degrees, each with a different area of focus. Students considering the Master of Mathematics and Quantitative Finance may also be interested in the following courses:\n\nCourse content is comprised of 14 subjects, including six from the internationally recognised UTS Master of Quantitative Finance. Students start by building core competencies in mathematics, statistics and computer programming before progressing to advanced concepts in financial market instruments, probability theory and risk management – crucial components of any quantitative finance career.\n\nThey also learn to apply their theoretical learning to industry-relevant assignments in areas such as derivative security pricing, valuation of financial instruments, and market and credit risk measurement and management.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Autumn intake is NOT available to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates are highly sought after by leading financial institutions, management consulting companies, energy and mining companies, regulatory bodies, government organisations and other organisations seeking advanced quantitative expertise.\n\nThey can work as quantitative analysts, risk management analysts, quantitative structurers, quantitative developers, forecasters, traders, investment analysts and financial engineers in organisations of all sizes, from multinationals to boutique firms.",
  "course_structure": "The course comprises 96 credit points of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04419.html",
    "crawled_at": "2025-11-10T15:40:03.818823",
    "csv_source": "merged_Admission_Courses.csv"
  }
}