{
  "course_code": "C04379",
  "course_name": "Master of Business Analytics (Extension)",
  "credit_points": "96 Credit points",
  "cricos_code": "0100411",
  "overview": "The Master of Business Analytics (Extension) is a unique transdisciplinary program of study in business analytics. With subjects drawn from UTS Business School, the Faculty of Engineering and Information Technology and the TD School, students are provided with a course structure which fits their background and experience, as well as flexible specialisations to meet new needs and career interests. The course is delivered in blended mode, combining contemporary online and face-to-face learning experiences in UTS's leading-edge facilities.\n\nThe course is suitable for students from both business and IT backgrounds who seek to upskill and develop the skills required to meet the growth in emerging careers in business analytics.",
  "awards": [
    "Master of Business Analytics (Extension)"
  ],
  "faculty": [
    "Business",
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Appraise the assumptions implicit in data and apply analytical techniques to create innovative business solutions in a range of contexts "
    },
    {
      "number": 2,
      "text": "Communicate complex data-informed decisions clearly in written, verbal and visual form to a broad range business stakeholders "
    },
    {
      "number": 3,
      "text": "Collaborate with colleagues and a broad range of stakeholders to deliver negotiated outcomes "
    },
    {
      "number": 4,
      "text": "Critically evaluate various data practices and use these insights to improve analytical processes which drive positive and equitable outcomes "
    },
    {
      "number": 5,
      "text": "Integrate advanced data analysis techniques with business practices to deliver new insights that drive effective decision-making in a range of local and international contexts "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/20692f6fc3beee50020e061ad00131ce"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/e0692f6fc3beee50020e061ad00131d3"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nMinimum Academic Requirement: The bachelor's degree should be in a related field within the business or information technology disciplines.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options are incredibly varied as virtually every company in every industry now collects huge amounts of data that needs to be interpreted and analysed to inform decision-making. Graduates from this program are able to provide valuable insights on matters such as fraud detection, logistics optimisation, customer acquisition and retention, and demand forecasting.",
  "course_structure": "The course totals 96 credit points and consists of a combination of core, including foundation streams, and elective subjects.\n\nStudents with a business background select STM91345 Foundation in IT stream (Business Analytics) (information technology foundation subjects) and students with information technology background select STM91344 Foundation in Business stream (Business Analytics) (business foundation subjects).\n\nStudents can also choose a specialisation from the following streams in CBK91806 Specialisation option (Business Analytics): Marketing Analytics (12 credit points), Financial Analytics (12 credit points), Business Services Analytics (12 credit points), Data Analytics (12 credit points), Software Development and Interaction Design (12 credit points), Internet (12 credit points), and Innovation (24 credit points) stream.\n\nElectives can be taken in one of two ways: as multiple specialisations (usually two subjects, totalling 12 credit points for each specialisation), or as two specialisations (total 24 credit points), plus four mixed electives (24 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04379.html",
    "crawled_at": "2025-11-10T15:27:36.925151",
    "csv_source": "merged_Admission_Courses.csv"
  }
}