{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Masters of Business (Research) is offered as a stand-alone degree and in conjunction with a PhD in Business. The degree develops student research capability and advanced knowledge in preparation to make a significant contribution of knowledge through original investigation.\n\nResearch capability is developed through intense instruction, study, and supervision. Skills and knowledge acquired in the chosen area of study are utilized in original research developed with academic supervision, culminating in a master’s thesis.\n\nThis degree provides the experience and expert knowledge to approach PhD studies and a research career confidently.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nEach applicant is required, prior to application, to complete an expression-of-interest application with the Business School.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 6.5; or TOEFL: paper based: 584-609 overall, internet based: 94-101 overall with a writing score of 24; or AE6: Pass; or PTE: 65-72 overall with a writing score 58; or C1A/C2P: 185-190 with a writing score 176.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Master of Business (Research) holders possess the experience and expert knowledge to pursue a research or management-level position in government and industry. The degree also develops research capabilities essential for the conduct of PhD level research for those interested in further developing research expertise for application in government or industry or in a career in academia.",
  "course_structure": "Students must complete 96 credit points comprised of roughly 1/3 each in expert discipline knowledge, research training, and a thesis. The exact breakdown depends on the discipline area. Required core subjects develop a foundation of advanced knowledge and research capabilities. Students will additionally choose from a range of electives subjects specific to their needs and research interests.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03069.html",
    "crawled_at": "2025-11-10T14:25:15.594630",
    "csv_source": "merged_Admission_Courses.csv"
  }
}