{
  "course_code": "C04235",
  "course_name": "Master of Architecture",
  "credit_points": "96 Credit points",
  "cricos_code": "061397B",
  "overview": "The Master of Architecture is a focused, professional degree and is required to become a practising architect. It is the second of two degrees, undertaken after the successful completion of the Bachelor of Design in Architecture (C10004) or equivalent.\n\nThis course is an innovative and flexible professional degree. Through a non-sequential structure, which allows students to select from a range of core and elective subjects, it gives students choice regarding their professional specialisation that can best serve them in their future careers. Architectural design subjects enhance a critical understanding of architecture as both a discipline with an existing body of knowledge and a set of practices that continuously challenge and add to that body of knowledge. Research is undertaken as a preliminary to design decision-making, during design and in reflection on design development. Architectural practice subjects prepare students for expanded practice in emerging media and markets, contemporary business practice and global economies and within challenging social, environmental, political and regulatory contexts. Students who complete a Master of Architecture and subsequent practical experience are eligible to become registered architects in New South Wales.",
  "awards": [
    "Master of Architecture (MArch)"
  ],
  "faculty": [
    "Design,",
    "Architecture",
    "and",
    "Building"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The Master of Architecture is a qualification accepted for candidates seeking to take the professional examination of the NSW Architects Registration Board and Royal Australian Institute of Architects (RAIA), as a prerequisite for registration under the provision of the Architects Act administered by the NSW Architects Registration Board, and to professional membership of the institute.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Cultivate an informed ethical position on social, technical and environmental practices, an appreciation of diversity and recognition of local and global cultural values. "
    },
    {
      "number": 2,
      "text": "Deliver effective communication through various mediums: written, oral, visual, physical and digital, for professional collaboration, demonstration of thought leadership and contribution to constructive peer learning. "
    },
    {
      "number": 3,
      "text": "Position work within a broader context by executing an architectural project based on research, analysis, synthesis and formulation of complex ideas, clear conceptual framing. "
    },
    {
      "number": 4,
      "text": "Generate inspirational and integrated architectural solutions by creatively employing disciplinary knowledge and relevant architectural advancements across technologies and materials. "
    },
    {
      "number": 5,
      "text": "Commit to ongoing personal development and engage in process methods that engages with emergent architectural practices and knowledge that challenge disciplinary conventions. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8b992d4d4704fe10413994ed036d4311"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/4f992d4d4704fe10413994ed036d4355"
    }
  ],
  "notes": "In normal circumstances Commonwealth Supported Places (CSPs) are available to all domestic students admitted to this course. CSPs provide significant savings compared to published full fees.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicant must have one of the following:\n\nApplicants with a completed UTS Bachelor of Design in Architecture, or UTS Bachelor of Design (Honours) in Architecture (Architectural Studies for Interior Architecture pathway), or UTS Bachelor of Design (Honours) in Architecture (Architectural Studies for Landscape Architects pathway) who have attained an overall minimum grade point average (GPA) of 5.50 or above will receive an offer.\n\nUTS students: GPA between 5.00 and 5.49\n\nApplicants with a completed UTS Bachelor of Design in Architecture, or UTS Bachelor of Design (Honours) in Architecture (Architectural Studies for Interior Architecture pathway), or UTS Bachelor of Design (Honours) in Architecture (Architectural Studies for Landscape Architects pathway) who attained a minimum grade point average (GPA) between 5.00 and 5.49 must provide the following additional material in order to be considered for a place:\n\nIf applicant possesses work experience:\n\nNon-UTS applicants: GPA 5.00 or above\n\nApplicants with a completed degree which is equivalent to the UTS Bachelor of Design in Architecture and who have attained a minimum grade point average (GPA) of 5.00 or above must provide the following additional material in order to be considered for a place:\n\nIf applicant possesses work experience:\n\nStudents must refer to the inherent requirements for all degrees offered by Design and Architecture in the Faculty of Design, Architecture and Building.\n\nInformation on how to calculate grade point averages (GPA) can be found at Calculating GPA.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include architect, designer, urban designer, architectural critic, journalist, exhibition designer, and more.",
  "course_structure": "This course comprises 96 credit points, made up of 72 credit points of core architectural practice subjects, 24 credit points of architectural electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04235.html",
    "crawled_at": "2025-11-10T14:35:29.799739",
    "csv_source": "merged_Admission_Courses.csv"
  }
}