{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Media Practice and Industry is for creative media graduates or experienced industry practitioners seeking to advance their skills and employability in a hybrid and dynamic media environment. The course is focused towards media industry transformations with respect to ethics, social justice, technology and sustainability. Students select from innovation, industry and production subject choices which share entrepreneurial, collaborative and iterative approaches to the ideas, practices and audiences for screen, digital media and emerging platforms. Curation, design thinking and project-based work are key aspects of the course which aims to produce graduates who can provide leadership to harness and shape opportunities in the field.\n\nThe Master of Media Practice and Industry is unique in integrating advanced media production practices and future-focused capabilities and technologies with social justice, ethics and sustainable industry practices. UTS's unique partnership with Compton School, Australia’s first Creative Business School to co-deliver the Advanced Creative Entrepreneurship core subject offers students an opportunity to build a viable business from scratch. Graduates from this course are highly sought after as leaders in a rapidly evolving media landscape.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nFor applicants with a bachelor's degree, master's, graduate diploma or graduate certificate:\n\nIf applicants do not submit these documents, their application may not be considered.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates are creative and cultural producers who can incubate, produce and post-produce for screen, digital and emerging media. Career options include directors, producers, multiplatform storytellers, advertising creatives, festival and digital channel curators and post-production specialists in screen and immersive media. Graduates have the capacity to generate and deliver sophisticated creative media industry prototypes, portfolios and projects.",
  "course_structure": "Students complete 72 credit points of study. All students are required to complete two core subjects that focus on vital transformative issues facing the current and future media and creative industries. Students select two subjects from each of the choices: Innovation, Industry, and Production, and select an additional subject from any of the choices.\n\nFull-time students are required to undertake 24 credit points a session. Part-time students should undertake 8 or 16 credit points a session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04394.html",
    "crawled_at": "2025-11-10T15:36:40.810015",
    "csv_source": "merged_Admission_Courses.csv"
  }
}