{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Finance Master of Financial Planning is a double degree that covers the distinct but connected domains of finance and financial planning. The discipline of finance covers the management, creation and study of money and investments. It addresses broad financing and investment issues relevant to individuals, companies and governments. It also incorporates the overall finance system and addresses issues such as the structure and regulation of markets. Financial planning is a related discipline that addresses personal finance decisions and determines how individuals will achieve strategic goals and objectives. It draws on many of the fundamental skills in mainstream finance and incorporates regulatory, legal and taxation concepts.\n\nThe double degree seeks to provide students with a depth and breadth of understanding in finance and financial planning. The double degree provides a well-rounded education and a more skilled financial practitioner. The skills complement each other and reinforce themes of market efficiency, integrity, ethical behaviour, sustainability, and stability.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "Completion of the Master of Finance meets the education requirements for Affiliate membership and, in conjunction with work experience, the requirements for Associate membership with the Financial Services Institute of Australasia (FINSIA).\n\nUTS is recognised as an affiliated university under the CFA® (Charted Financial Analyst®) University Affiliation Program based on the Master of Finance degree.\n\nThe Master of Financial Planning is a Financial Adviser Standards and Ethics Authority (FASEA) approved degree.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The course is intended for people who aspire to work in the finance industry and/or become financial planners. The career options include management-level positions in industry or government. The program has been designed to satisfy the academic qualification requirements according to the current regulatory framework.",
  "course_structure": "The course comprises 96 credit points, made up of seven core finance subjects (totalling 42 credit points) and eleven core financial planning subjects (totalling 54 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04438.html",
    "crawled_at": "2025-11-10T15:50:20.438355",
    "csv_source": "merged_Admission_Courses.csv"
  }
}