{
  "course_code": "C04386",
  "course_name": "Master of Speech Pathology",
  "credit_points": "96 Credit points",
  "cricos_code": "098167M",
  "overview": "The UTS Master of Speech Pathology is a two-year, graduate-entry course. Grounded firmly in the profession with an innovative and practice-based approach, the course enables students to actively participate in learning as they acquire the clinical and professional skills needed to enter the profession of speech pathology.\n\nThis postgraduate professional course prepares students with the knowledge, skills and confidence to work in speech pathology in the private and public sectors. Over the two-year course, students have the opportunity to use the latest digital technologies for health and education and learn about the business and professional aspects of speech pathology, including telepractice and telesupervision. They learn ways to prepare for changes to the workforce expected with the growth of the private practice sector, telehealth, the use of personal electronic health records, and the National Disability Insurance Scheme. Through a variety of learning experiences, students are immersed in meaningful interprofessional coursework, in-person and telepractice clinical work with children and adults, and clinical research.",
  "awards": [
    "Master of Speech Pathology (MSpPath)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "The Master of Speech Pathology program is fully accredited with Speech Pathology Australia. Graduates are qualified to practice as Speech Pathologists in Australia and are eligible to apply for certified practicing membership of Speech Pathology Australia.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate ethical conduct and adherence to evidence-based practices while providing safe, quality services, and maintaining high standards of communication and record-keeping. "
    },
    {
      "number": 2,
      "text": "Engage in ongoing professional development by demonstrating self-awareness, critical reflection, goal-setting, participating in professional development activities, and integrating knowledge from diverse sources. "
    },
    {
      "number": 3,
      "text": "Collaborate effectively with individuals, support networks, colleagues, and the community to develop a shared understanding of speech pathology needs, and implement appropriate interventions or service responses while advocating for optimal communication and swallowing. "
    },
    {
      "number": 4,
      "text": "Assess communication and swallowing needs, interpret and report on assessments accurately, and plan, implement, and evaluate interventions or service responses to support the development of the profession. "
    },
    {
      "number": 5,
      "text": "Contribute to the speech pathology evidence base and support the ongoing development of the profession through engagement in learning with colleagues, students, and the community. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/74696f6fc3beee50020e061ad0013121"
    }
  ],
  "notes": "It is recommended that domestic and international students apply before 31 October. Applications will close once all places have been filled. It is recommended to apply early, as applications and eligibility for interview will be assessed on a rolling basis.\n\nIndigenous applicants should apply via UTS Student Portal and will be contacted by the Indigenous Student Liaison Officer with further information. Indigenous applicants are welcome to submit cultural and/or community referees to accompany their application.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nIn addition to a completed bachelor's degree, applicants must have also completed the following subjects at a tertiary level within the last 10 years and must provide relevant subject outlines with their application:\n\nFor prerequisite checking, students must submit a completed Prerequisite Assessment Table with their application. Prerequisite subject approvals are subject to change as they undergo an annual academic review (a new assessment is required for each new intake). Prior to applications opening, the Prerequisite Assessment Table may be submitted to GSH.Future@uts.edu.au for pre-assessment. A pre-reassessment is not required to apply and will not be conducted once applications open. If the student has completed one subject that satisfies the pre-requisites for both anatomy and physiology this would also be acceptable.\n\nSelected applicants are required to undertake a short interview with a panel and final offers are dependent upon interview rank. Applicants are assessed in the areas of communication skills, interpersonal skills, interest in speech pathology, and commitment to speech pathology as a career.\n\nApplicants who have already completed a speech pathology/speech therapy degree overseas are also required to submit a personal statement to articulate their motivations for wanting to repeat a speech pathology qualification.\n\nProfessional and clinical requirements\n\nAll successful applicants are required to:\n\nThis degree leads to eligibility for membership of Speech Pathology Australia and to practice as a speech pathologist. Applicants who have already completed a speech pathology/speech therapy degree overseas are also required to submit a personal statement stating their motivation for wanting to repeat a speech pathology qualification.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Speech pathologists work with children and adults with communication and swallowing disability in a range of settings including hospitals, health centres, schools and private practices. With the constant advancements in information and communication technologies and digital health solutions, along with growth in the private sector and clinical research, speech pathologists have a diverse range of career trajectories. The UTS Master of Speech Pathology prepares students for a rewarding career that empowers individuals and communities towards improved communication and swallowing, for participation and inclusion in all aspects of society.",
  "course_structure": "This course comprises a total of 96 credit points. Students must complete a total of seven 6-credit-point coursework subjects, three 6-credit-point research subjects, three 6-credit-point clinical practice subjects and one 6-credit-point elective.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04386.html",
    "crawled_at": "2025-11-10T15:32:11.138198",
    "csv_source": "merged_Admission_Courses.csv"
  }
}