{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Landscape Architecture provides students with the opportunity to collaborate alongside celebrated practitioners from award-winning international design studios and leading experts in the area of urban design.\n\nStudents engage in a variety of projects that are based upon the big questions that face global contemporary cities and landscapes: urban densification, climate change, declining resource supply (land, food and water) and the loss of biological diversity through ecological fragmentation and habitat destruction.\n\nUsing the most relevant and up-to-date methodologies and technologies, students participate in practice-based studios to develop their complex problem-solving skills in order to address the critical role of landscape in the cities of the future.\n\nStudents who do not meet the admission requirement prerequisites below are encouraged to apply for the Graduate Certificate in Landscape Architecture, and progress to the Masters via the Graduate Diploma in Landscape Architecture.\n\nBy building advanced specialist knowledge, UTS students graduate with a range of advocacy, political and professional agency, project management and financial skills in order to tackle contemporary issues in local and global contexts.\n\nThe Master of Landscape Architecture offers the opportunity for students to actively and critically consider the agency of landscape in the future city and become active in the discourse of what future cities may become through an integrated design-focused approach. Graduates from the Master of Landscape Architecture are well-equipped to tackle contemporary issues in local and/or global contexts through an expanded understanding of the most relevant and up-to-date methodologies, tools and technologies.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "The course is accredited by the Australian Institute of Landscape Architects (AILA).",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "There are a limited number of Commonwealth Supported Places (CSPs) within this course. Applicants are strongly encouraged to submit their full application as soon as possible to be considered for a Commonwealth Supported Place.\n\nStudents who do not meet the admission requirements below may begin with the Graduate Certificate or Graduate Diploma and progress to the Master of Landscape Architecture.\n\nGraduate Certificate in Landscape Architecture --> Graduate Diploma in Landscape Architecture --> Master of Landscape Architecture",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must have one of the following:\n\nUTS students: criteria for a guaranteed offer\n\nApplicants with a UTS Bachelor of Landscape Architecture, or UTS Bachelor of Landscape Architecture (Honours), or UTS Bachelor of Design (Honours) in Architecture (Landscape Studies for Architects pathway) who have attained an overall minimum grade point average (GPA) of 5.00 or above will receive an offer.\n\nUTS students: GPA between 4.50 to 4.99\n\nApplicants with a UTS Bachelor of Landscape Architecture, or UTS Bachelor of Landscape Architecture (Honours) or equivalent, or UTS Bachelor of Design (Honours) in Architecture (Landscape Studies for Architects pathway) who have attained a minimum grade point average (GPA) between 4.50 and 4.99 must provide the following additional material and attend an interview with the course director to discuss the portfolio, in order to be considered for a place in the Master of Landscape Architecture:\n\nNon-UTS applicants: relevant field\n\nApplicants with a degree in a relevant field and who have attained a minimum grade point average (GPA) of 4.50 or above must provide the following additional material and attend an interview with the course director to discuss the portfolio, in order to be considered for a place in the Master of Landscape Architecture:\n\nInformation on how to calculate grade point averages (GPA) can be found at Calculating GPA.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include landscape architect, urban designer, researcher, land management professional, regional planner, educator and policymaker.",
  "course_structure": "Students must complete 96 credit points made up of 72 credit points of core subjects and 24 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04270.html",
    "crawled_at": "2025-11-10T14:48:41.314540",
    "csv_source": "merged_Admission_Courses.csv"
  }
}