{
  "course_code": "C04423",
  "course_name": "Master of Animation and Visualisation",
  "credit_points": "72 Credit points",
  "cricos_code": "092411G",
  "overview": "The Master of Animation and Visualisation has been developed in partnership with the industry-leading digital animation studio Animal Logic and is offered through the UTS Animal Logic Academy. The course develops creative professional practice, conceptual skills and technical dexterity in animation and visualisation production. Under the guidance and mentorship of practitioners and leaders from the industry, learning is modelled on real-world production work structures in a custom-built digital production studio, engineered to the highest industry standards with tools and technologies that are leading the animation and visualisation industries into the future.\n\nThe course provides challenges and opportunities that encourage exploration and skills-building across the spectrum of roles in digital production, 3D animation, digital asset creation, visual effects and emerging visualisation disciplines. Collaborative work practices guide the development of strong competencies in critical thinking, problem solving, teamwork, and effective communication in a production environment. Graduates are able to work productively and effectively in a professional-style workplace.",
  "awards": [
    "Master of Animation and Visualisation (MAnimVis)"
  ],
  "faculty": [
    "Engineering",
    "and",
    "Information",
    "Technology"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "1 Year(s)",
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Engineering & Information Technology Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course has an early, pre-session start date at end of January in the year of commencement.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants must provide the following documentation, substantiating their skills in at least one specialisation of digital production or visualisation, such as: animation, modelling, rigging, visual effects, compositing, surfacing, art/design, concept art, scenic art, storyboarding, character development, virtual reality, augmented reality, game design and production, production management and/or coding/programming:\n\nApplicants who do not satisfy the above academic requirements may be considered for admission based on one of the following:\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a score of 6.5 in listening, speaking and reading, and a score of 6.0 in writing; or TOEFL: internet based: 79-93 overall with a speaking score of  20-22, a listening score of 20-23, a reading score of 19-23 and a writing score of 21; or AE5/AE6: Pass; or PTE: 58-64 overall with a score of 58 in listening, speaking and reading, and a score of 50 in writing; or C1A/C2P: 176-184 overall with a score of 176 in listening, speaking and reading, and a score of 169 in writing.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates are able to enter industry with advanced knowledge, skills and collaborative large-project experience. In addition, they gain creative project development and presentation experience, and can contribute to the development of technology projects and industry sectors. They gain experience that can be applied across a range of roles, from story development, pre-visualisation, modelling, rigging, asset creation, 3D animation, visual effects and digital pipeline production, to creating immersive visualisation experiences and across emerging technologies such as virtual reality, augmented reality and real-time production.",
  "course_structure": "The course comprises a total of 72 credit points. Students undertake three studio subjects worth 24 credit points each.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04423.html",
    "crawled_at": "2025-11-10T15:41:06.844392",
    "csv_source": "merged_Admission_Courses.csv"
  }
}