{
  "course_code": "C04452",
  "course_name": "Master of Sustainable Leadership",
  "credit_points": "72 Credit points",
  "cricos_code": "None",
  "overview": "The global supply of energy is one of the greatest challenges facing the world today with impacts across social, technological and economic sectors. The Master of Sustainable Leadership focuses on equipping graduates with the knowledge and skills to address sustainability challenges and develop the capabilities to lead change and innovation across industries.\n\nThis program is for individuals who want to advance their understanding of sustainability and be recognized as leaders in this rapidly growing industry. Fully online delivery in accelerated mode provides opportunity for professionals nationwide to further their education while they navigate professional and personal commitments.",
  "awards": [
    "Master of Sustainable Leadership (MSustLdship)"
  ],
  "faculty": [
    "Science"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Critically appraise, synthesise and apply advanced skills and knowledge to contribute to professional practice and scholarship relevant to sustainability and leadership. "
    },
    {
      "number": 2,
      "text": "Analyse data and information to design, disseminate and conduct appropriate independent research to solve complex sustainability and leadership problems. "
    },
    {
      "number": 3,
      "text": "Develop, prepare, engage, lead, reflect and report upon work and leadership practices adhering to ethical conduct, risk management, organisation, and governance or regulatory requirements in the context of sustainability. "
    },
    {
      "number": 4,
      "text": "Critically reflect on self and others' practices related to sustainable leadership, seek and act on feedback and take responsibility for their professional practice and learning. "
    },
    {
      "number": 5,
      "text": "Present and justify complex ideas around sustainability and leadership independently or in collaborative contexts using various communication approaches from a variety of methods (oral, written, digital and visual) to discipline experts, policy makers, consumers, scientists, industry, and the community. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include IP and commercialisation officer / coordinator, renewable energy leader, sustainability manager, project co-ordinator, sustainability consultant, business development management (energy/sustainability), corporate sustainability consultant, senior sustainability consultant, team leader, strategist, technical director, design leader, planner, banking global practice specialist, project leader in decarbonisation, compliance manager, sustainability communications manager, corporate social responsibility manager, sustainable supply chain manager, sustainability analyst, green building consultant, sustainable development planner, sustainability director, sustainable business consultant, sustainability coordinator, corporate sustainability manager, circular economy strategist, sustainable development planner, clean technology entrepreneur, sustainable supply chain specialist, environmental conservationist, social impact consultant, sustainable transportation planner, energy efficiency specialist, sustainable business strategist, green infrastructure designer, sustainable product manager, sustainability educator.",
  "course_structure": "The course comprises a total of 72 credit points and consists of a combination of nine (9) compulsory core subjects (totalling 54 credit points) and 18 credit points of elective subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04452.html",
    "crawled_at": "2025-11-10T15:57:51.602445",
    "csv_source": "merged_Admission_Courses.csv"
  }
}