{
  "course_code": "C03024",
  "course_name": "Master of Laws (Research)",
  "credit_points": null,
  "cricos_code": "006407F",
  "overview": "The Master of Laws (Research) provides an opportunity for graduates to develop their research skills, deepen their knowledge in some area of the law and undertake original research. The degree is awarded to candidates who demonstrate competence in research, an understanding of research methods and an ability to make an original contribution to knowledge.\n\nThis course is suitable for students who have completed a coursework degree and wish to deepen their knowledge in a particular legal area by means of research. Students develop critical and analytical skills and advanced research skills to enable in-depth exploration of their chosen area. This degree is valuable for those wishing to pursue a career in research.",
  "awards": [
    "Master of Laws (Research)"
  ],
  "faculty": [
    "Law"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Law Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nPrevious qualifications must be in a relevant discipline, usually with honours or a distinction average.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in universities, undertaking research, contributions to public policy, or other academic work, including teaching, interest groups and legal publishing.",
  "course_structure": "Students are required to submit a thesis of approximately 40,000–60,000 words. As part of this course, students must also complete the subject 77697 Higher Degree Research Seminar.\n\nThe candidate is required to undertake all assessments as part of the faculty's Doctoral Framework three-stage program. In the first stage candidates must complete a formal candidature assessment, and in the second candidates must complete a progress confirmation, to ensure their progress is consistent with completion of the research program in the prescribed time and that they demonstrate potential to complete the work to standard.\n\nInformation regarding UTS: Law's key research areas and strengths, and the research interests of staff members, is available at postgraduate research degrees.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03024.html",
    "crawled_at": "2025-11-10T14:03:50.783740",
    "csv_source": "merged_Admission_Courses.csv"
  }
}