{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The UTS Online Master of Supply Chain Management is designed to advance technical, analytical and managerial capabilities to build resilient, sustainable and inclusive supply chains for the future.\n\nThe contemporary course content is informed by the latest trends in Supply Chain Management (SCM) and co-developed with industry partners. The course is practice-based and incorporates cohesive and innovative approaches, state-of-the-art technologies and provides relevant and practical skills demanded by employers globally.\n\nThe UTS Online SCM course content has been co-designed with UTS learning designers and SCM experts to ensure that learners get an engaging and high-quality 100% online learning experience. With personalised ongoing support and six study periods per year, students can study part-time or accelerate their studies in a flexible online learning environment.\n\nAs a pre-eminent subject design principle, the subjects are designed to ensure 'relevance to workplace’, instantly adding value to careers and organisations with the capability to transition to a new role or a job and gain the ability to stay relevant and successful.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "This course has been accredited to MCIPS standards by the Chartered Institute of Procurement and Supply (CIPS). Following the completion of the course and three years of relevant work experience, graduates are eligible to apply for MCIPS. Students who wish to apply for MCIPS must meet the following conditions:\n\nMore information is available on the CIPS website.\n\nCIPS offers complimentary student memberships to those undertaking an accredited program, for its duration whilst studying this program. Students are encouraged to apply for student membership and enrol immediately as they start this program.\n\nFor queries related to CIPS accreditation, contact Dr Sanjoy Paul, program director of Strategic Supply Chain Management Programs.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is offered fully online.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Online SCM program is widely recognised and transportable postgraduate degree and holds an authority and reputation that helps graduates rise into various managerial and leadership positions, as well as pivot learners into a new industry or area of business.\n\nCompleting the program may lead to roles such as: Production Manager, Procurement Manager/Lead, Purchasing/Logistics Officer/Manager, Logistics Manager, Inventory Manager, Supply Chain Manager, Service Design Manager, Service Supply Chain Designer, Supply Chain Manager - Network Design, Distribution & Inventory Control Analyst, Inventory Analyst, Supply Planning Analyst, Supply Chain Analyst, Logistics Analyst, Operations Coordinator.",
  "course_structure": "The course comprises a total of 72 credit points and consists of a combination of seven compulsory core subjects (42 credit points), three Supply Chain Management subjects (18 credit points), and two elective subjects (12 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04446.html",
    "crawled_at": "2025-11-10T15:55:22.795630",
    "csv_source": "merged_Admission_Courses.csv"
  }
}