{
  "course_code": "C04369",
  "course_name": "Master of Sport Management (Extension)",
  "credit_points": "96 Credit points",
  "cricos_code": "096872B",
  "overview": "The Master of Sport Management (Extension) provides advanced insights into the operation of the sport industry, both in Australia and internationally. The course is designed to develop professional skills and knowledge to equip students for collaborative and leadership positions in the fast growing, increasingly complex sport sector. With this in mind, the program includes subjects that develop a critical understanding of sport management across the areas of business, globalisation, governance, marketing, media, development, technology, innovation, and social impact. Importantly, the course is designed for students from diverse backgrounds and delivered using flexible learning methods, making it suitable for working professionals as well as domestic and international students.\n\nIn comparison to the standard Master's course, the additional elective subject choices in the extension program provide an opportunity to specialise more deeply in sports management and related fields, and further enhance students' business skills, professional practice, specialist knowledge and capabilities.",
  "awards": [
    "Master of Sport Management (MSportM)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Develop and justify innovative evidence-based solutions addressing that respond to community and business needs and emerging challenges within diverse sport contexts "
    },
    {
      "number": 2,
      "text": "Communicate information clearly and persuasively to a diverse range of sport stakeholders "
    },
    {
      "number": 3,
      "text": "Work effectively in teams and with sport stakeholders to deliver project outcomes that serve community and commercial interests "
    },
    {
      "number": 4,
      "text": "Implement and critically evaluate a range of sport management decisions to create positive outcomes for communities and the environment "
    },
    {
      "number": 5,
      "text": "Synthesise advanced knowledge of complex sport management concepts and technological skills to lead professional practice across community and commercial sport management contexts "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8259ab6fc3beee50020e061ad00131a1"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/9e59ab6fc3beee50020e061ad00131a6"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Graduates may pursue careers in such fields as sport marketing, sport event management, venue and facility management, sports development, international relations, sports administration, sport media management and operations management.",
  "course_structure": "Students must complete a total of 96 credit points made up of 15 subjects, comprising twelve core subjects (72 credit points), two electives subjects (12 credit points), and either Industry Research Project or Internship Experience (12 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04369.html",
    "crawled_at": "2025-11-10T15:21:38.806383",
    "csv_source": "merged_Admission_Courses.csv"
  }
}