{
  "course_code": "C03049",
  "course_name": "Master of Midwifery (Research)",
  "credit_points": "12 Credit points",
  "cricos_code": "052680G",
  "overview": "This degree is designed for registered midwives wanting to develop research skills that have practical application for innovations in the healthcare industry and scholarly understanding of midwifery practice. It enables informed participation in research endeavours and clinical practice innovation and improvement. Students extend and deepen their knowledge of a specialised area in midwifery through a program of supervised research.\n\nThis course assists students to complete original research that contributes to knowledge in their field within an international context. Research at UTS takes place in a dynamic and outcomes-oriented environment. The university attracts students who want to develop their knowledge and expertise within a professional and stimulating framework. Students are a part of a lively and vigorous research culture, working closely with academic staff and health industry partners.",
  "awards": [
    "Master of Midwifery (Research)"
  ],
  "faculty": [
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Practice woman-centred evidence-informed care. "
    },
    {
      "number": 2,
      "text": "Demonstrate comprehensive theoretical knowledge that is applied through sound clinical judgement and skills to optimise maternal and neonatal outcomes. "
    },
    {
      "number": 3,
      "text": "Communicates and collaborates respectfully and effectively in diverse contexts and interdisciplinary teams. "
    },
    {
      "number": 4,
      "text": "Makes informed and independent judgements to foster resilience and improve midwifery practice. "
    },
    {
      "number": 5,
      "text": "Actively contributes to the midwifery profession based on broad knowledge of the health system and a critical and evidence-informed approach to practice. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Research degrees are offered on a sponsored, scholarship or full-fee-paying basis. Contact the UTS: Health or the UTS Graduate Research School for further details.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nApplicants are required to have authorisation to practise as a registered midwife. Applicants are also required to submit a research proposal and have the agreement of a suitable supervisor at the time of application.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "This degree offers solid research training to registered midwives who are required to undertake research in their current employment or who aspire to such positions.",
  "course_structure": "This course is a structured program of study incorporating research preparation subjects undertaken in the first year and the production of a research thesis for examination.\n\nStudents are required to undertake a candidature assessment at the end of the first two sessions for full-time students, and at the end of the first three sessions for part-time students. Students work closely with a principal supervisor and a supervisory panel, and are required to report on their progress each session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03049.html",
    "crawled_at": "2025-11-10T14:09:59.571266",
    "csv_source": "merged_Admission_Courses.csv"
  }
}