{
  "course_code": "C04324",
  "course_name": "Master of Strategic Supply Chain Management",
  "credit_points": "72 Credit points",
  "cricos_code": "084678C",
  "overview": "The ever-growing interest among business managers and academics in supply chains, the emergence of advanced service economies, connected information systems including disruptive technologies, cloud computing and data analytics, new management practices and approaches, and the pressure of global competition has placed a premium on those who have a broad understanding of how to plan and manage complex business operations and related processes. Further, in today's volatile environment, risk and complexity in supply chains have been major issues faced by industry which encourages businesses to engender a more organic capability to deal with unexpected disruptions. The Master of Strategic Supply Chain Management is designed for those who wish to gain significant insight and skills in these areas.\n\nThe course is designed to cater for the needs of those employed in all business sectors, including private, public and not-for-profit, and who seek advanced knowledge of supply chain networks, procurement strategies, operations, and logistics management.",
  "awards": [
    "Master of Strategic Supply Chain Management (MStratSCM)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": "3 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "This course has been accredited to MCIPS standards by the Chartered Institute of Procurement and Supply (CIPS). Following the completion of the course and three years' of relevant work experience, graduates are eligible to apply for MCIPS. Students who wish to apply for MCIPS must meet the following conditions:\n\nMore information is available from CIPS website.\n\nCIPS offers complimentary student memberships to those undertaking an accredited program, for its duration whilst studying this program. Students are encouraged to avail student membership and enrol immediately as they start this program.\n\nFor queries related to CIPS accreditation, contact Dr Sanjoy Paul, program director of Strategic Supply Chain Management Programs.",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Develop and justify innovative solutions that respond to community and business needs within a strategic supply chain management context "
    },
    {
      "number": 2,
      "text": "Communicate information clearly and persuasively to a diverse range of stakeholders "
    },
    {
      "number": 3,
      "text": "Work effectively in teams and with supply chain stakeholders to deliver negotiated project outcomes "
    },
    {
      "number": 4,
      "text": "Implement and critically evaluate decisions to create positive outcomes for society and the environment as strategic supply chain managers "
    },
    {
      "number": 5,
      "text": "Integrate advanced knowledge of complex strategic supply chain management concepts and technological skills to lead professional practice in operations and supply chain management "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/5f1d2f27c3feee50020e061ad001318a"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/271d2f27c3feee50020e061ad0013190"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nMinimum Academic Requirement: The previous qualification must be in a related field within the business discipline.\n\nAll applicants who do not meet the minimum academic requirement may still be considered on the basis of:\n\nThe relevant work experience must be demonstrated through a C.V. and a Statement of Service, confirming the dates of employment and the position held within the organisation.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions in operations and quality management, inventory management, service and network management, supply chain management, risk management, logistics management, and strategic procurement in any business sector.",
  "course_structure": "Students must complete a total of 72 credit points made up of 11 subjects, comprising seven core subjects (42 credit points), three electives subjects (18 credit points), and one Industry Research Project or Internship Experience (12 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04324.html",
    "crawled_at": "2025-11-10T15:14:23.156437",
    "csv_source": "merged_Admission_Courses.csv"
  }
}