{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Advanced Journalism (Extension) is designed to meet the needs of mid-career journalists and graduates seeking a career change. It is a highly industry-focused course that equips students with deep knowledge of journalism, technical skills and the adaptive capacities needed in the current digital dominated media environment. Students who successfully complete the course have current, and forward-looking skills that allow them to operate in digital newsrooms and on other digital facing programs.\n\nClass seminars are conducted by journalism professionals and academics. Students gain hands on reporting, editing and other production experience with the opportunity to learn in a state-of-the-art 'live' newsroom under the tutelage of a highly experienced multimedia producer.\n\nStudents gain hands-on experience in reporting, editing and related production and design skills in a wide variety of text, audio and visual mediums like our award-winning UTS Central News platform or the Foreign Correspondent Study Tour, which is an exclusive partnership with SBS News and SBS Online, giving students the opportunity to file news stories on the ground with the chance of being published.\n\nStudents have the opportunity to use, experience and think about emerging areas of journalistic practice, including drones, virtual reality and computer-assisted reporting, and work with leading practitioners in investigative, sports and entrepreneurial journalism.\n\nThe overarching aim is to foster agility and innovation in the local, regional and global media landscape which is evidenced by UTS's students who gain internships at the Guardian or regional reporting assignments.\n\nThe Master of Advanced Journalism (Extension) is suitable for anyone interested in learning how to fully harness the power of journalism, from existing media professionals and journalism graduates needing to upgrade skills or try new things to people interested in realising the full potential of digital disruption.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "The intake for this course has been suspended.\n\nCurrent students are strongly advised to follow the typical course program because of subject availability.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nFor applicants with a bachelor's degree:\n\nFor applicants with a master's, graduate diploma or graduate certificate qualification, the qualification can be in any field of study.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include reporter, producer, presenter and editor across all types of private and public media, broadcast and publishing organisations including digital start-ups, the not-for-profit sector, content producer, content coordinator and non-media publishers.",
  "course_structure": "The Master of Advanced Journalism (Extension) totals 96 credit points of study, made up of 48 credit points of core subjects and 48 credit points of electives.\n\nFull-time students are required to undertake 24 credit points a session. Part-time students should undertake 8 or 16 credit points a session.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04397.html",
    "crawled_at": "2025-11-10T15:36:55.180040",
    "csv_source": "merged_Admission_Courses.csv"
  }
}