{
  "course_code": "C04409",
  "course_name": "Master of Health Services Management",
  "credit_points": "72 Credit points",
  "cricos_code": "None",
  "overview": "This is a comprehensive course in health services management and aims to expand students' knowledge and future career opportunities. The course develops students' knowledge and skills, leading to an enhanced capacity to manage health services in a diverse range of health settings.\n\nGraduates of this course are exposed to academic and industry leaders who share their experience and knowledge to facilitate insight into the contemporary health service management environment.\n\nStudents can focus on health services management or complete a major in:\n\nThe Planning major provides a blend of subjects to assist graduates in planning and evaluating health services, understanding health needs, and managing change in a dynamic and complex environment.\n\nThe Clinical Leadership major provides a blend of subjects to assist graduates in maximising the efficiency, effectiveness and safety of health services as well as ensuring that governance, quality and risk-mitigation frameworks contribute to excellence in healthcare delivery.",
  "awards": [
    "Master of Health Services Management in (name of major) (MHSM)"
  ],
  "faculty": [
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Online campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Engage in and translate ongoing personal and professional development through inquiry, critical thinking and reflective practice. "
    },
    {
      "number": 2,
      "text": "Evaluate and synthesise expert knowledge and apply skills to address real-world problems in health and social care, informed by evidence. "
    },
    {
      "number": 3,
      "text": "Demonstrate leadership in health and social care through communication and collaboration with specialist and nonspecialist audiences to optimise individual and system outcomes. "
    },
    {
      "number": 4,
      "text": "Demonstrate ability to apply socially responsible and ethical practice in health and social care. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants who do not have an undergraduate degree but who have extensive relevant work experience in a healthcare or human services field and can demonstrate the capacity to undertake tertiary study may also be considered eligible.\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include positions as managers and/or planners in health authorities, hospitals, primary and community care, aged care services, and other healthcare facilities in the public, private, not-for-profit, government and non-government health sectors.",
  "course_structure": "Students must complete a total of 72 credit points, choosing one of two majors (in Digital Health or Quality and Safety) or a no-major option to complete the course. In all options, with the exception of the no major, students choose two electives, from the list of electives provided within each choice block.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04409.html",
    "crawled_at": "2025-11-10T15:39:09.971874",
    "csv_source": "merged_Admission_Courses.csv"
  }
}