{
  "course_code": "C03055",
  "course_name": "Master of Sport and Exercise (Research)",
  "credit_points": "6 Credit points",
  "cricos_code": "032336M",
  "overview": "The Master of Sport and Exercise (Research) program is for graduates who wish to enhance their knowledge of an area, address policy or management issues, or pursue a research/academic career.\n\nThis program is suitable for students who have completed a coursework degree and wish to develop in a more focused way by means of research. Students develop critical and analytical skills and advanced research skills to enable in-depth exploration of their chosen area.",
  "awards": [
    "Master of Sport and Exercise (Research)"
  ],
  "faculty": [
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "Moore Park Precinct"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Research degrees are offered on a sponsored, scholarship or full-fee-paying basis. Contact the UTS: Health or the UTS Graduate Research School for further details.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nThe bachelor's degree must be in a related field of study.\n\nA new English proficiency requirement apply for all international students or local applicants with international qualifications who submit an application from 13 December 2022. The English proficiency requirement from 13 December 2022 is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nThe English proficiency requirement listed below only apply for international students or local applicants who have applied for the course before 13 December 2022.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include management-level positions in industry or government, and academic positions.",
  "course_structure": "The main requirement of the degree is the preparation of a thesis of 40,000–50,000 words, which presents the results of original research of a theoretical or applied nature.\n\nStudents are also required to complete the two-subject sequence relevant to their thesis topic. The first is an advanced research methods subject that also covers statistical analysis. The second involves reading and formal seminar presentations on current topics in the chosen area of study. In addition to these subjects, candidates may be required to enrol in subjects specified by their supervisors. During their candidature, students' progress is monitored by a master's assessment and regular progress reports.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03055.html",
    "crawled_at": "2025-11-10T14:15:08.632493",
    "csv_source": "merged_Admission_Courses.csv"
  }
}