{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The UTS Online Master of Urban Design is designed for professionals who want to develop their practical design capabilities to shape the lived experience within sustainable urban environments. Students explore the concept of environmental, economic and social sustainability in urban design and development, and apply their understanding to deliver creative solutions for planning and design in consideration of different design scales.\n\nThe course provides a practical approach to urban design across an array of areas, whilst exploring real-world case studies, learning from industry professionals and applying their understanding in authentic assessments.\n\nDelivered fully online, this course enables students to work full-time while gaining practical design skills and immediately apply what they learn to make a greater impact in their current role and design resilient urban environments.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "This program is accredited by the Planning Institute of Australia.",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "Inherent (essential) requirements are academic and non-academic requirements that are essential to the successful completion of a course.\n\nProspective and current students should carefully read the Inherent (Essential) Requirements Statement below and consider whether they might experience challenges in successfully completing this course. This Statement should be read in conjunction with the UTS Student Rules.\n\nProspective or current student concerned about their ability to meet these requirements should discuss their concerns with the Academic Liaison Officer in their faculty or school and/or UTS Accessibility Service on 9514 1177 or at accessibility@uts.edu.au.\n\nUTS will make reasonable adjustments to teaching and learning, assessment, professional experiences, course related work experience and other course activities to facilitate maximum participation by students with disabilities, carer responsibilities, and religious or cultural obligations in their courses.\n\nFor course specific information see the Faculty of Design, Architecture and Building Inherent (Essential) Requirements Statement.",
  "study_plans": [],
  "notes": "This course is not offered to international applicants.\n\nThis course is not offered to international students.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nApplicants with one of the following qualifications will be made an offer:\n\nApplicants without any of the above qualifications, but who meet the following criteria, may also be considered:\n\nThe English proficiency requirement for local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Master of Urban Design is for those with diverse backgrounds who are wanting to develop their practical design capabilities to shape the lived experience within sustainable urban environments.\n\nWith a Master of Urban Design, students build and practice the skills employers demand to add value to their professional career immediately. Upon successful completion of this course, graduates have a broad scope of jobs available both in government and private companies, including roles as:",
  "course_structure": "Students must complete 90 credit points of core subjects.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04439.html",
    "crawled_at": "2025-11-10T15:50:29.198131",
    "csv_source": "merged_Admission_Courses.csv"
  }
}