{
  "course_code": "C03032",
  "course_name": "Master of Sustainable Futures (Research)",
  "credit_points": null,
  "cricos_code": "028886D",
  "overview": "This degree involves a period of supervised study and research, culminating in the submission of a thesis. It is offered to both local and international students.\n\nGraduates from the master's have consistently achieved excellent examiners' reports from international leaders in their fields. Many have been eligible for the UTS Chancellor's Award, and several have been placed on the Chancellor's List.",
  "awards": [
    "Master of Sustainable Futures (Research)"
  ],
  "faculty": [
    "Vice",
    "Chancellor"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "Research degrees are offered on a sponsored, scholarship or full-fee-paying basis. Contact the Institute for Sustainable Futures or the UTS: Graduate Research School for further details.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate research studies.\n\nPrevious qualifications must be in a relevant field.\n\nApplications to the Institute for Sustainable Futures are assessed based on the following four criteria:\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 7.0 overall with a writing score of 7.0; or TOEFL: paper based: 584-609 overall with TWE of 5.0, internet based: 94-101 overall with a writing score of 27; or AE6: Pass; or PTE: 65-72 overall with a writing score of 65; or C1A/C2P: 185-190 overall with a writing score of 185.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "None",
  "course_structure": "This research degree is undertaken wholly by thesis.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c03032.html",
    "crawled_at": "2025-11-10T14:07:14.547443",
    "csv_source": "merged_Admission_Courses.csv"
  }
}