{
  "course_code": "C04301",
  "course_name": "Master of Good Manufacturing Practice",
  "credit_points": "96 Credit points",
  "cricos_code": "084264C",
  "overview": "The Master of Good Manufacturing Practice provides up-to-date and in-depth good manufacturing practice (GMP) knowledge within the pharmaceutical, biotechnology and medical device industries. The course provides critical knowledge of legislation relating to the registration, manufacture, storage and supply of licenced therapeutic goods; GxP and quality systems compliance; and the concepts of quality management, risk management, aseptic practices, supply chain, clinical trials, quality assurance and quality control within this heavily regulated industry – all essential ingredients for career development.\n\nThis is the only course of its kind in the Asia–Pacific region. The UTS: Pharmacy discipline has partnered with SeerPharma, the industry’s leading provider of technical compliance and quality assurance knowledge, to deliver students a practice-based and research-led education.\n\nDesigned by leading experts in the field, the course provides professional development options and career pathways for students at all levels of industry organisations. It is ideal for students wishing to commence or enhance their pharmaceutical industry manufacturing career with an industry-recognised qualification.",
  "awards": [
    "Master of Good Manufacturing Practice (MGMP)"
  ],
  "faculty": [
    "Graduate",
    "School",
    "of",
    "Health"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Reflect on the knowledge, skills and attributes required for the evaluation of current regulatory documents in Good Manufacturing Practice promoting the growth of personal and professional learning. "
    },
    {
      "number": 2,
      "text": "Devise, evaluate, audit and validate practices and processes using appropriate methodologies in a wide range of local, national and global Good Manufacturing Practice contexts. "
    },
    {
      "number": 3,
      "text": "Interpret published standards and requirements to design ethically and legally accountable approaches to pharmaceutical manufacturing and control. "
    },
    {
      "number": 4,
      "text": "Devise and implement quality-focused research and evidence-based, ethical and legally accountable solutions and/or approaches across a wide range of Good Manufacturing Practice fields. "
    },
    {
      "number": 5,
      "text": "Communicate effectively as an individual or within a team with colleagues, clients and stakeholders in written or spoken language appropriate to their needs. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe above qualifications must be in one of the following related disciplines:\n\nApplicants who do not satisfy the above academic and additional requirements may be considered on the basis of general and professional qualifications that demonstrate potential to pursue graduate studies via submission of a CV.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include:",
  "course_structure": "Students must complete 96 credit points of study, including 84 credit points of coursework and 12 credit points of research.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04301.html",
    "crawled_at": "2025-11-10T15:06:00.392379",
    "csv_source": "merged_Admission_Courses.csv"
  }
}