{
  "course_code": "C04288",
  "course_name": "Master of Social Impact and Not-for-Profit Management",
  "credit_points": "72 Credit points",
  "cricos_code": "084676E",
  "overview": "The Master of Not-for-Profit and Social Enterprise reflects best practice, current issues, and emerging trends in not-for-profit and social enterprise, and has been designed for individuals who are passionate about social justice, enabling them to develop innovative solutions that have social impact. With this in mind, the program includes subjects that seek to develop an understanding of the not-for-profit sector and the unique skills needed to effectively manage organisations that have a social purpose at their heart.\n\nThis course aims to produce graduates with professional competence in the specialist area of not-for-profit and social enterprise management, as well as high-level general management competencies needed to develop or manage complex organisations involved in the production of social good.\n\nThe course has a strong focus on professional practice, including two innovative capstone subjects – Industry Research Project or Internship Experience – which allow students to work either on or with contemporary industry issues and opportunities.",
  "awards": [
    "Master of Social Impact and Not-for-Profit Management (MSINFPM)"
  ],
  "faculty": [
    "Business"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "5 Year(s)",
  "duration_parttime": "3 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Develop and justify innovative solutions that respond to community and business needs, and have a social impact "
    },
    {
      "number": 2,
      "text": "Communicate information clearly, effectively and persuasively to a diverse range of stakeholders "
    },
    {
      "number": 3,
      "text": "Work effectively in teams and deliver negotiated project outcomes that contribute to social good "
    },
    {
      "number": 4,
      "text": "Implement and critically evaluate decisions to create positive outcomes for society, communities, and the environment as social entrepreneurs, advocates and not-for-profit managers "
    },
    {
      "number": 5,
      "text": "Integrate advanced knowledge of complex not-for-profit and social enterprise concepts and technological skills to lead professional practice that contributes to social good "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/3c39eb6347b22650a31de422036d43df"
    },
    {
      "name": "Autumn commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/7839eb6347b22650a31de422036d43e4"
    },
    {
      "name": "Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/f4392f6347b22650a31de422036d4303"
    },
    {
      "name": "Spring commencing, part time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/34392f6347b22650a31de422036d4308"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Career options include managing not-for-profit organisations or social enterprises, working in the field of corporate social responsibility, or in government, particularly in roles that work with community or not-for-profit organisations such as social and community welfare, environment advocacy, fundraising, education, international aid and development.",
  "course_structure": "Students must complete a total of 72 credit points made up of 11 subjects, comprising nine core subjects (54 credit points), one elective subject (6 credit points), and either Industry Research Project or Internship Experience (12 credit points).",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04288.html",
    "crawled_at": "2025-11-10T14:58:18.892759",
    "csv_source": "merged_Admission_Courses.csv"
  }
}