{
  "course_code": "V12060",
  "course_name": "TEQSA Category: Australian University",
  "credit_points": null,
  "cricos_code": "None",
  "overview": "The Master of Philosophy in Forensic Science provides students with a unique opportunity to undertake original research and gain in-depth knowledge in their chosen area of forensic science. Students have access to staff that are leading researchers and experts in their field. Undertaking this course allows students to explore their research potential and develop research skills. It is designed to provide a scholarship pathway to the PhD program.\n\nThis course is designed to expand students' knowledge and practice of forensic science alongside developing science management and leadership capabilities, culminating in a substantial research project in Year 2. The course contains compulsory core and elective practice-focused forensic science subjects across a range of disciplines from the crime scene to the laboratory. Professional subjects covering a range of skills crucial to all professional scientists – such as project and laboratory management, advanced scientific communication, ethics, innovation and science business models – complete Year 1.\n\nYear 2 comprises a substantial research component, giving students an opportunity to undertake original, cutting-edge research. For students with suitable achievement levels, this provides a direct pathway to a PhD, and carries points that can be used in the scholarship application process.",
  "awards": [],
  "faculty": [],
  "study_level": null,
  "location": [],
  "duration_fulltime": null,
  "duration_parttime": null,
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": null,
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [],
  "notes": "This course is not offered by direct entry. Admission is via Internal Course Transfer with faculty approval.",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nThis program is normally available to students who have commenced in the Master of Forensic Science (Extension) (C04392) or Master of Forensic Science (C04391), and demonstrated exceptional academic achievement and research potential. Admission is via internal course transfer. Prospective students must liaise with their program director to organise a supervisor and project.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "Depending on the area of specialisation, graduates may pursue employment with organisations such as the Australian Federal Police, state policing agencies, ASIO, CSIRO, ANSTO, customs, immigration, and private forensic agencies. Career options include criminalist, trace evidence specialist, forensic toxicologist, DNA specialist, scene-of-crime officer, team leader in investigations, fire investigator, fingerprint analyst.\n\nGraduates may also proceed to a career in research through entry to a PhD.",
  "course_structure": "The course requires 96 credit points of study, comprising 24 credit points of professional stream subjects, a 24 credit points of core subjects, and a 48-credit-point intensive research component.\n\nThe intensive research component of the course is a research project that extends over the final year and normally takes the form of an experimental, analytical or theoretical investigation. Candidates may also be required to undertake one or more critical reviews of the literature in the area of their project. During the course of their research project, candidates are also offered workshops to help with the writing and interpretation of results. The results of the project are presented in an oral seminar and in a written thesis, both of which are formally assessed.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04393.html",
    "crawled_at": "2025-11-10T15:36:33.633716",
    "csv_source": "merged_Admission_Courses.csv"
  }
}