{
  "course_code": "C04265",
  "course_name": "Master of Science (Extension)",
  "credit_points": "96 Credit points",
  "cricos_code": "080273A",
  "overview": "The world-class UTS Master of Science (Extension) is an advanced science degree designed to propel students into senior roles in their chosen scientific discipline. Supported by teaching excellence, industry collaboration and access to cutting-edge facilities and technologies, students gain the theoretical, practical and professional expertise to deliver meaningful impact in the global science sector. The Master of Science (Extension) includes an additional 24 credit points of electives beyond the standard Master of Science curriculum and can be completed in two years of full-time study.\n\nThis leading qualification supports students to further deepen or broaden their existing expertise or to tailor their learning to meet personal or professional goals. Course content combines high-level scientific skills development with professional and research opportunities, a choice of six industry-aligned majors that reflect priority areas of scientific advancement in Australia overseas, and a vast choice of elective options that includes subjects in business, intellectual property and leadership. Students work under the guidance of acclaimed scientists and mathematicians in their chosen discipline and benefit from flexible learning options that help them balance study, work and life.\n\nExplore the Master of Science in Philosophy Students who achieve a credit average in their first year of study can apply to transfer into the Master of Philosophy in Science. This highly specialised degree combines coursework subjects with an immersive research project, providing a pathway to a PhD. Students seeking a shorter course of study should consider the UTS Master of Science.\n\nChoice of major:",
  "awards": [
    "Master of Science in (name of Science major) (MSc)"
  ],
  "faculty": [
    "Science"
  ],
  "study_level": "Postgraduate",
  "location": [
    "City campus"
  ],
  "duration_fulltime": "2 Year(s)",
  "duration_parttime": "4 Year(s)",
  "duration_sessions": "None",
  "course_fee": "None",
  "course_intake": "None",
  "uac_codes": [],
  "language": "English",
  "availabilities": [],
  "professional_recognition": "None",
  "learning_outcomes": [
    {
      "number": 1,
      "text": "Demonstrate critical engagement with the appraisal of advanced knowledge and demonstrate advanced application of knowledge and technical skills to conduct research and generate new knowledge relevant to professional practice in science. "
    },
    {
      "number": 2,
      "text": "Assess, argue for, and conduct appropriate approaches to independent research and solving complex problems and apply a research methodology to address a research need in a relevant professional context. "
    },
    {
      "number": 3,
      "text": "Develop, prepare, and engage, at times collaboratively, in work practices that demonstrate an understanding of health and safety requirements, ethical conduct, risk management, organisation, record keeping and collaborative skills in the context of science. "
    },
    {
      "number": 4,
      "text": "Discover, create, and self-reflect on the processes used to determine the value, integrity, and relevance of multiple sources of information to derive innovative solutions to complex science problems. "
    },
    {
      "number": 5,
      "text": "Present and communicate complex ideas and justifications using appropriate communication approaches from a variety of methods (oral, written, visual) to communicate with discipline experts, scientists, industry, and the general public. "
    }
  ],
  "structure_notes": null,
  "structure": {},
  "inherent_requirements": "None",
  "study_plans": [
    {
      "name": "Analytical Chemical Technologies, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/467d5f4547bb6e50413994ed036d43d3"
    },
    {
      "name": "Analytical Chemical Technologies, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0a7d9f4547bb6e50413994ed036d4303"
    },
    {
      "name": "Environmental Consultancy and Conservation, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0e7d5f4547bb6e50413994ed036d43af"
    },
    {
      "name": "Environmental Consultancy and Conservation, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/027d5f4547bb6e50413994ed036d43e5"
    },
    {
      "name": "Mathematical and Statistical Data Science, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/0a7d5f4547bb6e50413994ed036d43b5"
    },
    {
      "name": "Mathematical and Statistical Data Science, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/467d5f4547bb6e50413994ed036d43d9"
    },
    {
      "name": "Medical Laboratory Science, Autumn commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/467d5f4547bb6e50413994ed036d439c"
    },
    {
      "name": "Medical Laboratory Science, Spring commencing, full time",
      "url": "https://coursehandbook.uts.edu.au/studyplan/8a7d5f4547bb6e50413994ed036d43de"
    }
  ],
  "notes": "None",
  "admission_requirements": "Applicants must have completed a UTS recognised bachelor's degree, or an equivalent or higher qualification, or submitted other evidence of general and professional qualifications that demonstrates potential to pursue graduate studies.\n\nEntry into any of the majors requires a minimum of a Bachelors degree in a related discipline.\n\nThe English proficiency requirement for international students or local applicants with international qualifications is: Academic IELTS: 6.5 overall with a writing score of 6.0; or TOEFL: paper based: 550-583 overall with TWE of 4.5, internet based: 79-93 overall with a writing score of 21; or AE5: Pass; or PTE: 58-64 with a writing score of 50; or C1A/C2P: 176-184 with a writing score of 169.\n\nEligibility for admission does not guarantee offer of a place.\n\n; Admission requirements for Australian students (ATAR): None; Admission requirements for Chinese students (Gaokao score out of 750): None; Admission requirements for students with GCE A Levels: None; Admission requirements for Hong Kong students (HKDSE): None; Admission requirements for Indian students (AISSC): None; Admission requirements for Indian students (ISC): None; Admission requirements for students with IB or Predicted IB: None; Admission requirements for Malaysian students (STPM with 3 AL Subjects): None; Admission requirements for Singaporean students (A Level): None; Admission requirements for USA students (SAT 1): None; Admission requirements for UTS Foundation Studies students: None",
  "career_options": "The Master of Science (Extension) prepares graduates for a diverse range of careers in science and beyond, or to continue on into the Master of Philosophy in Science, which provides a pathway to a PhD.\n\nCareer options include (but aren’t limited to):",
  "course_structure": "The course requires 96 credit points of study, comprising 24 credit points of professional stream subjects, a 48-credit-point major and 24 credit points of electives.",
  "metadata": {
    "source_url": "https://handbook.uts.edu.au/courses/c04265.html",
    "crawled_at": "2025-11-10T14:47:48.396838",
    "csv_source": "merged_Admission_Courses.csv"
  }
}